<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Scribus-Grundlagen</title>
</head>
<body>

<h2>Scribus-Grundlagen</h2>
<h3>Worin sich Seitenlayout von Textverarbeitung unterscheidet</h3>

<p>Was kann man mit Scribus tun &ndash; und was ist eigentlich ein &raquo;Seitenlayoutprogramm&laquo;?</p>

<p>Zun&auml;chst sollte man wissen, da&szlig; sich Scribus (wie alle modernen DTP-Programme) deutlich von einem Textverarbeitungsprogramm unterscheidet. Bei einer Textverarbeitung soll mit simplen Mitteln eine Seite eingerichtet werden &ndash; meist im Format A4 oder US Letter &ndash;, um dann unmittelbar den Text einzugeben. Ein Programm wie Scribus dagegen ist daf&uuml;r ausgelegt, die Gestaltung von Seiten zu erm&ouml;glichen, und solche Programme werden als DTP- oder Desktop-Publishing-Software bezeichnet</p>

<p>Programme dieser Kategorie geben dem Benutzer eine Vielzahl von M&ouml;glichkeiten an die Hand, verschiedene Objekte wie etwa Fotos, Logos, Textrahmen, Formen usw. in einer bestimmten Ausrichtung und mit gro&szlig;er Genauigkeit auf der Seite zu plazieren. An dieser Stelle sollen einige Grundlagen des Layouts und der Gestaltung von Drucksachen erl&auml;utert werden. Sollte dieses Gebiet f&uuml;r sie neu sein, dann empfiehlt es sich sehr, zun&auml;chst den Abschnitt <a href="qsg.html">F&uuml;r Schnelleinsteiger</a> zu lesen, um einen Eindruck davon zu bekommen, was man mit Scribus anfangen kann und wie sich Fehler vermeiden lassen.</p>

<h3>Die &raquo;Endmontage&laquo;</h3>
<p>Als Anf&auml;nger kann man mit einem Seitenlayoutprogramm schnell an einen Punkt gelangen, an dem man fast verzweifeln m&ouml;chte. Gew&ouml;hnlich geht man wohl davon aus, da&szlig; man einfach ein neues Dokument &ouml;ffnen und gleich mit dem Schreiben loslegen kann. Aber bei Scribus wird zun&auml;chst lediglich ein Bereich erstellt, in den man etwas einf&uuml;gen kann, und dabei wird nicht einmal davon ausgegangen, da&szlig; es sich unbedingt um einen Text handeln mu&szlig;.</p>

<p>Ein Dokument, das f&uuml;r eine Druckerei oder f&uuml;r die Ver&ouml;ffentlichung im Internet bestimmt ist, kann man vielleicht mit einem Auto oder mit einem Computer vergleichen, also mit einer Maschine, die aus Tausenden von Teilen besteht, von denen die meisten gar nicht vom Kfz- oder Computerhersteller gefertigt werden, sondern von seinen Zulieferern.</p>

<p>Wem das Bild einer &raquo;Fertigungslinie&laquo; als zu technisch erscheint, der kann sich vielleicht eine K&uuml;che vorstellen, in der der Layouter die Rolle des Chefkochs &uuml;bernimmt und dabei verschiedenes zusammenmischt: frische und vorgefertigte Lebensmittel sowie Selbstgekochtes, um mit einem wohlbedachten Arrangement nicht nur den Hunger zu stillen, sondern Genu&szlig; zu bereiten.</p>

<p>Sowohl der Hersteller als auch der Chefkoch f&uuml;gen Teile zu einem Ganzen zusammen, und genauso verh&auml;lt es sich im Grunde bei einem Seitenlayoutprogramm: Es stellt die &raquo;Endmontage&laquo; dar, mittels derer ein Dokument erzeugt wird, das dann ver&ouml;ffentlicht werden soll, meistens in gedruckter Form. Daher die Metapher des &raquo;Desktop <i>Publishing</i>&laquo;, also einer Ver&ouml;ffentlichung, die &raquo;vom Schreibtisch aus&laquo; geschieht.</p>

<h3>&raquo;Workflow&laquo; (Arbeitsablauf)</h3>
<p>Aber egal ob man nun Autos baut, kocht oder Seiten gestaltet: f&uuml;r ein wirklich &uuml;berzeugendes Ergebnis mu&szlig; man die Dinge im voraus bedenken und sich &uuml;ber seine Absichten klarwerden. Den ganzen Proze&szlig; des Planens, der Abstimmung und der Erstellung, also den Arbeitsablauf, nennt man im Englischen und inzwischen auch im Deutschen (als Fachbegriff) &raquo;Workflow&laquo;.</p>

<h4>Planung</h4>
<p>Ob man nun aus vielen Einzelteilen eine Maschine zusammensetzt oder ein komplexes Layout erstellt: in beiden F&auml;llen beginnt man oft &ndash; fast w&ouml;rtlich &ndash; am Rei&szlig;brett. Viele Dinge, darunter Autos oder M&ouml;bel, sind zun&auml;chst einmal auf einem Blatt Papier entworfen worden, denn beim Design ist es oft n&uuml;tzlich, den Computer auszuschalten und f&uuml;r einen Entwurf zum Zeichenblock zu greifen.</p>

<p>Da bereits viele interessante Designs f&uuml;r fast jeden denkbaren Zweck existieren, kann man nat&uuml;rlich ohne weiteres etwas Vorhandenes nehmen, um sich davon inspirieren zu lassen. Jedoch macht es dabei einen Unterschied, ob man von einem vorhandenen Design lernt oder dieses nur abkupfert. Im ersteren Fall ist einiger Aufwand vonn&ouml;ten; man mu&szlig; das Design n&auml;her untersuchen, z.B. mit dem Lineal die Seitenr&auml;nder und Abst&auml;nde abmessen. Wie dem auch sei6, nicht alles, was ins Auge f&auml;llt, ist tats&auml;chlich auch ein gutes Design f&uuml;r jeden beliebigen Zweck. Am besten ist es daher, man beginnt mit einer Grundidee von dem, was man bewirken m&ouml;chte: Will man z.B. n&uuml;tzliche Information verbreiten, oder m&ouml;chte man eher etwas grafisch zu Schau stellen, ein Produkt darbieten? Ist man sich einmal &uuml;ber den Zweck im klaren, dann ist es einfacher, ein paar gelungene Designs zu finden, die man sich zum Vorbild nehmen kann.</p>

<p>Bis man selbst&auml;ndig und mit einiger Sicherheit kreativ gestaltet, ist es also keine schlechte Idee, von den Besten auf diesem Gebiet zu lernen. Sp&auml;ter kann man sein Wissen vielleicht eher aus B&uuml;chern &uuml;ber Seitenlayout, Typographie und Farbtheorie gewinnen, denn dort finden sich oft viele gute Beispiele.</p>

<p>Wenn man ein Layout aufs Papier gebracht hat, von dem man &uuml;berzeugt ist, h&ouml;rt das Nachdenken dar&uuml;ber jedoch nicht auf, ganz im Gegenteil. W&auml;hrend einer Planungsphase sollte man unter anderem auch festlegen, welche Teile des Layouts unver&auml;nderlich bleiben sollen, um Bestandteil von <a href="pagetemplate1.html">Musterseiten</a> zu werden. Weiterhin sollte man sich Gedanken dar&uuml;ber machen, welche Elemente an verschiedenen Stellen wiederverwendet werden sollen, denn diese lassen sich in einem gesonderten Verzeichnis zusammenzufassen, das dann als Bibliotheksordner dient.</p>

<p>Neben der Gestaltung gibt es einen anderen wichtigen Aspekt bei der Planung eines Projekts, n&auml;mlich den kommerziellen Druck als die abschlie&szlig;ende Phase der &raquo;Endmontage&laquo;. Dabei ist es <b>sehr</b> wichtig im voraus zu wissen, welche Art von Dateien (z.B. welche PDF-Versionen) ein Drucker handhaben kann, und falls man <a href="color1.html">F&uuml;llfarben</a> verwenden will, sollte man vorher &uuml;berpr&uuml;fen, welche Farben der Drucker zuverl&auml;ssig wiedergeben kann. All diese Faktoren sind f&uuml;r die n&auml;chsten Schritte in der Produktion von Bedeutung. Auch f&uuml;r den Fall, da&szlig; man lediglich den eigenen Drucker verwenden m&ouml;chte, sollte man sich &uuml;ber die F&auml;higkeiten und Grenzen des Ger&auml;ts vorher klarwerden.</p>

<h4>Vorbereitung der Zulieferer</h4>
<p>Die ben&ouml;tigten Materialien, wie etwa Texte, Fotos und Grafiken, kann man nat&uuml;rlich alle selbst erstellen, aber viele Layouter &uuml;bernehmen dabei lediglich die Koordination und das Zusammenf&uuml;gen von Bestandteilen, die von anderen geschaffen oder bearbeitet wurden. So wie ein Automobilkonzern sich mit seinen Zulieferern abstimmt, um Reibungsverluste und St&ouml;rungen in der Endfertigung zu vermeiden, so k&ouml;nnen auch Sie Probleme vermeiden, indem Sie entsprechende Vorgaben f&uuml;r die &raquo;Komponenten&laquo; bzw. &raquo;Zutaten&laquo; Ihres Layouts machen (und wenn Sie alles selbst erstellen, dann sollten Sie wenigstens vorher einige Punkte im Ged&auml;chtnis festhalten, um sich sp&auml;tere Schwierigkeiten zu ersparen), denn erfahrungsgem&auml;&szlig; k&ouml;nnen inhaltliche &Auml;nderungen schnell eine v&ouml;llige Umgestaltung des Layouts erforderlich machen.</p>

<p>So sollte u.a. f&uuml;r Textautoren festgelegt werden, welche Dateiformate erlaubt sind. Idealerweise sollte man ein einziges Format bestimmen; falls dies nicht m&ouml;glich ist (vielleicht weil verschiedene Programme verwendet werden), dann kann man sich eventuell auf einfachen Text (<i>plain text</i>) als den kleinsten gemeinsamen Nenner einigen. Au&szlig;erdem sollte man darauf achten, da&szlig; die Autoren &uuml;berall die gleiche Rechtschreibung, Zeichensetzung usw. verwenden.</p>

<p>Bei Grafikdateien sollte man sich kundig machen, welche Formate am besten f&uuml;r den <a href="importhints.html">Datenimport</a> in Frage kommen, und dann alle Mitwirkenden bitten, sich daran zu halten. Ebenso sollte man eindeutige Vorgaben f&uuml;r die Verwendung von <a href="color1.html">F&uuml;llfarben</a>, Grafikaufl&ouml;sungen sowie das <a href="cms.html">Farbmanagement</a> machen.</p>

<h4>Bevor es losgeht</h4>
<p>Die Erfahrung zeigt, da&szlig; es es sinnvoll ist, mit der tats&auml;chlichen Arbeit der Gestaltung erst zu beginnen, wenn man alle Bestandteile beisammen hat. Dies gilt vor allem f&uuml;r Text. Wenn z.B. an einer Grafik Farb&auml;nderungen erforderlich werden, dann wird das vorhandene Layout davon nicht beeintr&auml;chtigt, aber &Auml;nderungen am Text, wie das Hinzuf&uuml;gen eines Absatzes oder auch nur einer Zeile, k&ouml;nnen <b>eine Menge</b> zus&auml;tzlicher Arbeit nach sich ziehen, da die Plazierung von Grafiken oder Beschriftungen entsprechend angepa&szlig;t werden mu&szlig;. Man sollte also sicherstellen, da&szlig; es im Verlaufe der Arbeit keine unangenehmen &Uuml;berraschungen gibt.</p>

<p>Es hat sich in der Praxis bew&auml;hrt, gleich zu Anfang alle zusammengeh&ouml;rigen Dateien in einem gesonderten Verzeichnis f&uuml;r das Projekt abzulegen, mit Unterverzeichnissen f&uuml;r Texte, Vektorgrafiken, Abbildungen usw. Dateien, die &ouml;fter wiederverwendet werden sollen, sollte man in ein spezielles Bibliotheksverzeichnis f&uuml;r Scribus kopieren. Wenn Sie alle diese Schritte hinter sich gebracht haben, k&ouml;nnen Sie tats&auml;chlich loslegen.</p>
<br>
<br>
</body>
</html>

