<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Farben hinzuf&uuml;gen und bearbeiten</title>
</head>
<body>
<h2>Farben hinzuf&uuml;gen und bearbeiten</h2>
Wenn Sie wissen wollen, wie man die komplette Farbpalette wechselt, <a href="color2.html">schauen Sie hier</a>.
<h3>Manuelle Methoden</h3>
<h4>Eine neue Farbe anlegen</h4>
<p>Hier nehmen wir wieder den <i>Farben</i>-Dialog, den wir im letzten Kapitel hatten (mit <i>Bearbeiten &gt; Farben</i>). Klicken Sie den Button <strong>Neu</strong>, und Sie sehen den Dialog <i>Farbe bearbeiten</i>. Vergeben Sie einen aussagekr&auml;ftigen Namen und stellen Sie mit den Schiebereglern Farbe und S&auml;ttigung ein. Sie k&ouml;nnen auch &uumlberall in den Regenbogen klicken, um rasch eine Ann&auml;herung an die Farbe zu erreichen, die Sie einstellen wollen. Klicken Sie <strong>OK</strong> um die neue Farbe zu Ihrer Palette hinzuzuf&uuml;gen. Beachten Sie, da&szlig; mit dieser Methode Ihre Farbpalette nur in diesem Dokument zur Verf&uuml;gung steht &ndash; weiter unten wird beschrieben, wie man eine Palette eines gespeicherten Dokuments importiert.</p>
<p>Sie haben 3 <i>Farbmodelle</i>, die Sie ausw&auml;hlen k&ouml;nnen: <strong>RGB</strong>, <strong>CMYK</strong> und <strong>Webfarben</strong>. Die letzte Auswahl limitiert die Farbwerte auf die, die in Farbr&auml;umen mit 8 und 16 Bit gleich dargestellt werden.</p>
<table width="100%">
<tr>
<td>
<img src="images/add_colors4.png"></td>
<td><img src="images/add_colors6.png"></td>
</tr>
</table>
<h4>Eine Farbe einer anderen Palette ausw&auml;hlen</h4>
<table width="90%" cellpadding="5">
<tr><td><p>Wenn man den Button oben rechts im Dialog <i>Farbe bearbeiten</i> anklickt, erscheint eine lange Auswahlliste, die alle Farbpaletten enth&auml;lt, die in Scribus verf&uuml;gbar sind. Wenn man nun eine dieser Farben anklickt, werden Name und RGB/CMYK-Werte als neue Farbe &uuml;bernommen. Viele dieser Farbs&auml;tze enthalten propriet&auml;re Schmuckfarben.</p></td></tr>
<tr><td>
<img src="images/add_colors5.png">
</p></td>
</tr></table>
<h4>Mit dem Farbw&auml;hler</h4>
<p>Die kleine Pipette in der Toolbar aktiviert den Farbw&auml;hler, der durch einen Klick auf einen Punkt des Bildschirms diese Farbe ausw&auml;hlt. Wenn diese Farbe noch nicht in der Farbpalette vorhanden ist, erscheint ein Dialog, der Sie auffordert, dieser Farbe einen Namen zu geben. Wenn Sie keinen Namen vergeben, wird die Farbe nicht hinzugef&uuml;gt, selbst wenn Sie <strong>OK</strong> klicken.</p>
<p><img src="images/add_colors3.png"></p>
<h4>Duplizieren</h4>
<p>Dazu w&auml;hlen Sie im <i>Farben</i>-Dialog die Farbe, die Sie ab&auml;ndern m&ouml;chten, und w&auml;hlen <strong>Duplizieren</strong>. Es erscheint der Dialog <i>Farbe bearbeiten</i>. Hier k&ouml;nnen Sie dann die gew&uuml;nschten Werte einstellen und einen Namen vergeben.</p>
<h4>Farben entfernen</h4>
<p>Dies kann man einzeln indem man eine Farbe ausw&auml;hlt und <strong>L&ouml;schen</strong> dr&uuml;ckt, oder man kann &ndash; falls man sich entschlossen hat, die Anzahl der Farben auf der Liste zu verringern &ndash; durch einen Klick auf <strong>Unbenutzte entfernen</strong> alle Farben l&ouml;schen, die aktuell nicht in diesem Dokument verwendet werden.</p>
<h3>Automatische und halbautomatische Methoden</h3>
<h4>Von einem anderen Dokument</h4>
<p>Wenn man mit einem fr&uuml;her gespeicherten Dokument arbeitet, &uuml;bernimmt man dessen Farbsatz. edenkt man dies, kann man dieses Dokument &ouml;ffnen, den Inhalt l&ouml;schen und es mit <i>Datei &gt; Speichern unter</i> unter einem neuen Namen speichern.</p>
<p>Speziell wenn man eine angepa&szlig;te Farbpalette hat, kann man also auch ein leeres Dokument erstellen, das man mit "farbschema3.sla" oder einem anderen aussagekr&auml;ftigen Namen benennt, um es sp&auml;ter wieder zu finden.</p>
Man kann auch eine Seite eines anderen Dokuments importieren, wobei dessen Farben auch importiert werden.</p>
<o>Wenn man schon mit einem neuen Dokument begonnen hat, kann man zu guter letzt noch <i>Bearbeiten &gt; Farben</i> &ouml;ffnen und <strong>Importieren</strong> w&auml;hlen, um Farben eines anderen Dokuments zu importieren.</p>
<h4>Von importierten Dateien</h4>
<p>Wenn man eine Datei aus der Bibliothek importiert, werden die Farben zum Dokument hinzugef&uuml;gt. Ebenso f&uuml;gen Vektorgrafiken (SVG, EPS usw.) die Farben zum Dokument hinzu, die sie enthalten. </p>

<table width="90%" cellpadding="5">
<tr>
<td><img src="images/add_colors1.png"></td>
<td><p>&nbsp; </p><p>&nbsp; </p><p>&nbsp; </p><p>In diesem Beispiel &ndash; wir haben ein SVG importiert &ndash; betrachten wir den Farbendialog (<i>Bearbeiten &gt; Farben)</i>, damit wir einige Details genauer beleuchten k&ouml;nnen.</p>
<p>Wir haben mit dem Scribus-Basic-Farbsatz begonnen und eine SVG-Grafik importiert. Diese hat die Farben hinzugef&uuml;gt, die mit <i>FromSVG</i> anfangen. Scribus fragt nicht nach einem OK, es entsteht eine Grafik mit vielen Farben.</p>
<p>Falls man nur die Farben einer Vektorgrafik (EPS und Varianten, PS) oder kompatibler Palettendateien [AI (Adobe Illustrator) GPL (Gimp Farbpalette), SOC (OpenDocument Farbpalette) oder einer kompatibel formatierten Scribus-XML-Ausf&uuml;hrung] importieren will, kann man das auch machen, indem man <strong>Importieren</strong> im <i>Farben</i>-Dialog ausw&auml;hlt.
</td></tr></table>
<p>Man beachte die vielen Schwarz, alle sind verschieden. Unser neu hinzugef&uuml;gtes Schwarz, <i>FromSVG#000000</i> ist ein RGB Schwarz, alle anderen sind CMYK. Wenn man den Mauszeiger &uuml;ber die Farben zieht, sieht man den Unterschied.</p>
<table cellpadding="5">
<tr>
<td></td><td><b>C%</b></td><td><b>M%</b></td><td><b>Y%</b></td><td><b>K%</b></td></tr>
<tr>
<td>Black</td><td align="center">0</td><td align="center">0</td><td align="center">0</td><td align="center">100</td></tr>
<tr>
<td>Cool Black</td><td align="center">60</td><td align="center">0</td><td align="center">0</td><td align="center">100</td></tr>
<tr>
<td>Registration</td><td align="center">100</td><td align="center">100</td><td align="center">100</td><td align="center">100</td></tr>
<tr>
<td>Rich Black</td><td align="center">60</td><td align="center">40</td><td align="center">40</td><td align="center">100</td></tr>
<tr>
<td>Warm Black</td><td align="center">0</td><td align="center">60</td><td align="center">30</td><td align="center">100</td></tr>
</table>

</body>
</html>
