<qt>
<title>Farbmanagement mit Scribus, eine Einf&uuml;hrung</title>
<h2>Farbmanagement mit Scribus, eine Einf&uuml;hrung</h2>

<h4>Aktivierung des Farbmanagements</h4>
<p>Um die Farbmanagement-Funktion einsetzen und nutzen zu k&ouml;nnen, werden folgende Voraussetzungen erwartet:</p>
<ul><li>LittleCMS-Bibliotheken m&uuml;ssen installiert und Scribus mit LCMS-Unterst&uuml;tzung kompiliert sein. Dies ist erkennbar, wenn Sie unter <strong>Hilfe &gt; &Uuml;ber Scribus</strong> nachschauen und nach &quot;C-C-T&quot; suchen. Das erste C bedeutet, da&szlig; Scribus mit LittleCMS-Unterst&uuml;tzung kompiliert worden ist. </li>
<li>Sie ben&ouml;tigen <strong>minimal</strong> 1 RGB- und 1 CMYK-Profil. Ab Scribus 1.2.3 gibt es 2 Basisprofile, womit sichergestellt ist, da&szlig; CMS sofort eingesetzt werden kann. In der Praxis ben&ouml;tigen Sie jedoch mehr. Ein sRGB f&uuml;r die meisten RGB-Farben und eines f&uuml;r jedes Farbger&auml;t. Das Profil f&uuml;r Ihren Monitor erzeugen spezielle Hilfsprogramme. Diverse CMYK-Profile dienen dem Drucken. Einige CMYK-Profile sind als &quot;Presse-Standards&quot; bekannt, d.h. es sind allgemeine kommerzielle Druckstandards, wie sie in Nordamerika und Europa verwendet werden. Wer auf Nummer Sicher gehen will, l&auml;dt sich the &quot;Windows&quot;-Version des Adobe ICC-Profilpakets herunter und entpackt es in ein Verzeichnis wie $home/.colors/icc. Frei verf&uuml;gbare Profile k&ouml;nnen Sie sich auch unter <a href="http://www.scribus.org.uk/modules.php?op=modload&name=Downloads&file=index&req=viewdownload&cid=16">ICC downloads</a> bei <a href="http://www.scribus.net">www.scribus.net</a> herunterladen.</a> </li>
<li>Ab der Version 1.2.3 erwartet Scribus unter Linux als Standardverzeichnis:
 <pre>$home/.color/icc</pre> und <pre>/usr/share/color/icc/</pre>
d.h. f&uuml;r pers&ouml;nliche oder systemweite ICC-Profile. <a href="http://www.scribus.net">www.scribus.net</a> verf&uuml;gt &uuml;ber eine kleine, jedoch stetig wachsende Sammlung frei verf&uuml;gbarer ICC-Profile, dort zu finden unter Downloads &gt; ICC. Unter Windows oder MacOSX erwartet Scribus sie in den voreingestellten Verzeichnissen. Fr&uuml;here Scribus-Versionen greifen auf das in den Einstellungen angegebene Verzeichnis zu.</li>
<li>Wenn das Farbmanagement f&uuml;r Sie Neuland ist, beachten Sie bitte die Links und die Dokumentation zum Farbmanagement bei www.scribus.net. Dort finden Sie die Theorie und Konzeption weit besser erkl&auml;rt, als ich das je hier k&ouml;nnte.</li></ul>
<h4>&Uuml;berblick</h4>
<p>Ziel eines Farbmanagement-Systems ist es, den Farbunterschied zwischen der Bildschirmdarstellung und dem tats&auml;chlichen Druckergebnis zu reduzieren, aber auch Farben anzuzeigen, die au&szlig;erhalb der Farbskala liegen, also jenseits des Farbbereichs Ihres ausgew&auml;hlten Druckers. Damit dies funktionieren kann, mu&szlig; sowohl f&uuml;r den Drucker als auch den Monitor ein Profil angelegt sein, das halbwegs pr&auml;zise ist. F&uuml;r Benutzer anderer Anwendungen, die das nicht kennen, k&ouml;nnen die Voreinstellungen und Beschreibungen ziemlich verwirrend sein. Wer sich zuvor mit den Fachbegriffen nicht vertraut gemacht hat, wird <strong>sehr</strong> leicht die falschen Einstellungen w&auml;hlen, was oft dazu f&uuml;hrt, da&szlig; Bilder auf dem Bildschirm oder als Ausdruck schlechter wirken. Danach sagt sich der Erstbenutzer kurz &quot;Mir reicht&apos;s!&quot; und schaltet das Farbmanagement ab.</p>

<p>Doch so geht es nat&uuml;rlich <strong>nicht</strong>. Sobald Sie etwas vom grundlegenden Konzept begriffen haben und Ihnen das Ger&auml;t f&uuml;r die Druckausgabe bekannt ist, k&ouml;nnen Sie voraussagen (und deutlich besser vorausbestimmen), wie Ihr Dokument nach dem Druck aussehen soll. Dies ist besonders dann hilfreich, wenn Sie Dateien versenden wollen, die sp&auml;ter als 4-Farb-Druck wiedergegeben werden oder als hochaufl&ouml;sende PDF-Dokumente auf die Reise gehen. Diese Art Farbmanagement-Unterst&uuml;tzung seitens Scribus ist meines Wissens die erste bei einem Open-Source-Programm. K&uuml;nftige Verbesserungen werden eine noch genauere Steuerung der Farbwiedergabe erm&ouml;glichen. Die j&uuml;ngsten CUPS-Versionen seit 1.1.15+ unterst&uuml;tzen jetzt den echten CMYK-Farbdruck. Die neueste Version von LittleCMS 1.15 enth&auml;lt viele neue Merkmale und Funktionen, die Scribus eine pr&auml;zisere Farbdarstellung erm&ouml;glichen; und das bei gleichzeitiger Leistungssteigerung.</p>

<p>Gehen Sie schrittweise vor, damit Farbmanagement zuverl&auml;ssig funktioniert (Was auf dem Bildschirm zu sehen ist, wird auch gedruckt):</p>

<ol>
	<li>Erfahren Sie etwas mehr &uuml;ber die Konzeption von Farbmanagement und lernen Sie Fachbegriffe. Links stehen weiter unten.</li>
	<li>Richten Sie die Profile ordentlich ein. Nachfolgend finden Sie eine Aufstellung von Farb-Tools f&uuml;r Linux. Am wichtigsten ist ein gutes und pr&auml;zises Monitorprofil. Die prof-Profiler eigenen sich ganz hervorragend zum Erstellen von Monitorprofilen. <a href="moncal.html">Hier</a> gibt es eine Anleitung zum Erstellen von ICC-Profilen f&uuml;r Ihren Monitor mittels lprof-Profil-Tools. <strong>Ohne ein ordentlich erstelltes Monitorprofil f&uuml;hrt der Einsatz des Farbmanagements zu unbefriedigenden Ergebnissen, sowohl beim Druck als auch bei der Bildschirmvorschau.</strong> </li>
	<li>Betten Sie die Bildprofile sorgsam in das jeweilige Bildbearbeitungsprogramm ein, wenn es irgend m&ouml;glich ist.</li>

</ol>

<p>Das in Scribus enthaltene Farbmanagement-System ist in erster Linie daf&uuml;r ausgelegt, farblich aufbereitete Grobdaten-PDFs (sogenannte Soft-Proofs) der Bilder innerhalb des Dokuments zu erm&ouml;glichen. Scribus kann auch eine Warnmeldung ausgeben, wenn Farben au&szlig;erhalb des Farbraumes des Ger&auml;tes (&quot;out of gamut&quot;) liegen und beim Druck m&ouml;glicherweise nicht genau wiedergegeben werden. (Die meisten Drucker haben einen engeren Farbraum, den sie wiedergeben k&ouml;nnen, als die meisten Monitore.) In Ihren Bildern enthaltene Profile werden weder eingebettet noch ver&auml;ndert. Einige Bilddateien, PNG und TIFF, k&ouml;nnen als Kopfdaten praktischerweise ein ICM- or ICC-Profil enthalten - mitunter auch als &quot;markiert&quot; (<strong><em>tagged</em></strong>) bezeichnet, mit einem Farbprofil. Sp&auml;ter werden wir noch beschreiben, wie und wann es sinnvoll sein mag, LittleCMS oder Photopaint daf&uuml;r zu verwenden, ein &quot;<strong>tag</strong>&quot; anzulegen oder ein Profil einzubetten. Wenn eine Datei markiert (<strong>tagged</strong>) ist, dann liest Scribus das im Bild enthaltene Profil mittels LittleCMS und wertet es aus, um die Farben innerhalb des Bildes genauer darstellen zu k&ouml;nnen. Wenn ein Bild keine solche Markierung enth&auml;lt, Sie aber das Ger&auml;teprofil kennen, das dem Bild zugewiesen werden sollte, dann k&ouml;nnen Sie immer noch die Einstellungen von CMS nutzen, um eine Vorschau zu erhalten, die mit dem im Dokument provisorisch zugewiesenen Profil auskommt. Hierbei ist Vorsicht geboten, damit nicht das falsche Profil zugewiesen wird, solange Sie bez&uuml;glich der Bildquelle nicht absolut sicher sind.</p>

<p>Das <strong>littlecms</strong>-Paket hat sich zu einer stabilen Bibliothek entwickelt. Unabh&auml;ngige Tests b&uuml;rgen f&uuml;r seine Genauigkeit, und LittleCMS hat Einzug in die Firmware von Druckern gehalten, die als die exotischsten und leistungsf&auml;higsten &uuml;berhaupt gelten. Die Tatsache, da&szlig; das Paket von einer sehr kleinen Gruppe von Leuten stammt, ist au&szlig;erordentlich bemerkenswert, wenn man bedenkt, wieviel Entwicklungsarbeit von gro&szlig;en Firmen wie Kodak, Adobe, Agfa und anderen betrieben wird. </p>

<p><strong>Was sind Farb- oder Ger&auml;teprofile?</strong></p>

<p><strong>ICC</strong>- oder <strong>ICM</strong>- Profile sind ein besonderer Dateityp, der die Farbcharakteristik von Ger&auml;ten wie Scannern, Monitoren oder Druckern beschreibt - grunds&auml;tzlich also all jener Ger&auml;te, die digitale Bilder erstellen, darstellen oder farblich ver&auml;ndern k&ouml;nnen. Es gibt auch Farbprofile, die als <strong>ger&auml;teunabh&auml;ngige</strong> oder <strong>Arbeitsfarbraum</strong>-Profile bekannt sind. Diese besonderen Dateien fungieren als &Uuml;bersetzer, die dazu dienen, zwischen unterschiedlichen Farbprofiltypen zu konvertieren. Eine ICC- oder ICM-Datei ist eine tabellarische Anordnung mathematischer Werte, mit denen ein Ger&auml;t Farbe messen und darstellen kann. Erfreulicherweise sind diese durch offene internationale Standards geregelt und funktionieren gleicherma&szlig;en auf Mac-, Windows-, Linux- oder Solaris-Systemen.</p>

<p><strong>Ger&auml;teprofile</strong> - sind gesonderte Dateien, die beschreiben, wie ein Ger&auml;t Farben erstellt (Scanner oder Digitalkamera), darstellt (Monitor) oder ausgibt (Drucker). Den Benutzern von Photoshop wird die Auswahl zwischen <strong>Arbeitsprofilen</strong> oder <strong>Arbeitsfarbraum</strong> vertraut sein - wobei es sich um Farbprofile handelt, die nicht zu einem bestimmten Ger&auml;t geh&ouml;ren, sondern die bei der Farbkonvertierung von einem Ger&auml;t zum anderen hilfreich sind. Zu den weithin bekannten RGB-&quot;Arbeitsfarbr&auml;umen&quot; z&auml;hlen sRGB, Adobe&reg; RGB 1998, Colormatch, Bruce RGB oder CIERGB. Benutzer von Photoshop oder anderer Farbsysteme m&ouml;gen sich fragen, ob hier nicht etwas fehlt, aber LittleCMS benutzt seine eigene Farbkonvertiermethode zur Umwandlung zwischen Arbeitsfarbr&auml;umen. Eine Einstellung weniger, um die man sich k&uuml;mmern mu&szlig;!</p>

<table width="100%"><tr><td align="center"><img src="images/cmsmodify1.png" align="center" title="Modify Color Management Dialog" alt="Modify Color Management Dialog"/></td></tr></table>

<p>Weshalb &quot;Soft-Proofing&quot;? Sobald die Ger&auml;teprofile richtig eingestellt sind, kann LittleCMS die Farben Ihres Monitors so anpassen, da&szlig; sie in genauerem Ma&szlig;e dem entsprechen, was letztlich als gedrucktes Dokument ausgegeben wird. Dies kann in zweifacher Hinsicht n&uuml;tzlich sein, ob Sie es nun zum kommerziellen Druck versenden oder von einem Dienstleister drucken lassen. Dar&uuml;ber hinaus l&auml;&szlig;t sich jedes Bild separat mit Scribus modifizieren, um ihm intern Profile zuzuweisen. (W&auml;hlen Sie Bild &gt; Rechtsklick &gt; &Auml;ndern). Auf diese Weise l&auml;&szlig;t es sich farbtechnisch f&uuml;r die Dokumentenausgabe aufbereiten, etwa als Film, als PDF/X-3 oder via direktem Belichtungsverfahren. Hierdurch bleibt die Bilddatei allerdings intern unver&auml;ndert. Vorschau-Profile, die einem Bild <strong>zugewiesen</strong> wurden, bleiben als Teil der Einstellung in einem Scribus-Dokument oder einer PDF-Erstellung erhalten. Au&szlig;erdem gibt es zu LittleCMS Befehlszeilen-Tools, um Profile mittels <strong>tifficc</strong> und <strong>jpegicc</strong> einzubetten. In der Dokumentation zu  LittleCMS sind die Optionen genau beschrieben. Desweiteren k&ouml;nnen Sie ICC-Profile einbetten mittels Cinepaint, Imagemagick und Krita in Kombination mit Adobe Photoshop.</p>
<br />

</qt>
