<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Das Farbmanagement einstellen</title>
</head>
<body>
<h2>Das Farbmanagement einstellen</h2>
<p><strong>Um mit dem Farbmanagement gute Vorschauen auf dem Monitor zu bekommen, sind zumindest folgende Schritte des Benutzers n&ouml;tig:</strong></p>
<ul>
<li>Es hilft wirklich, das &raquo;Eye-Candy&laquo; abzuschalten. Ja, KDE, Gnome, oder Mac&nbsp;OS&nbsp;X haben toll anzuschauende Oberfl&auml;chen, aber wenn es um akurate Farben geht, ist schlicht und einfach die beste Wahl &ndash; keine Animationen, keine raffinierten Grafiken. Das beste Ergebnis gibt es mit einem neutralen Grau oder einer hellen Farbe ohne Verlauf oder stylischem Hintergrund. So kann das Auge die Farbbalance bei Bildern besser beurteilen. Das gilt f&uuml;r alle Grafikprogramme. Das Ziel ist es doch, da&szlig; die Farben im Druck <i>so akurat wie m&ouml;glich</i> dargestellt werden.</li>

<li><i>Kalibrieren</i> bedeutet, den Bildschirm auf einen bekannten Status einzustellen. Die meisten Monitore sind standardm&auml;&szlig;ig auf eine Farbtemperatur von 9300k oder Kelvin eingestellt. Dies ist oft zu &raquo;kalt&laquo; oder &raquo;blaustichig&laquo;, um mit Farben genau zu arbeiten. <a href="http://www.color.org/">www.color.org</a> bietet eine Menge Empfehlungen f&uuml;r die Farb-Spezifikationen an. Die meisten Farb-Standards sind auf 5000k Lichttemperatur oder &raquo;Beleuchtung&laquo; eingestellt. F&uuml;r einen Monitor sind wohl 6500 Kelvin der beste Ausgangspunkt, um ihn einzustellen, da dies dem Sonnenlicht am n&auml;chsten ist. Zu Anfang wird der Bildschirm &raquo;gelbstichig&laquo; erscheinen, aber das Auge wird sich schnell darauf einstellen, wenn Helligkeit und Kontrast korrekt gesetzt sind.</li>

<li>Druckprofile h&auml;ngen stark vom gew&uuml;nschten Medium ab. Farbprofile f&uuml;r Zeitungen und ungestrichenes Papier haben ein kleineres &raquo;Farbspektrum&laquo, da Druck darauf grauer erscheint. Die lebendigen Farben und die S&auml;ttigung wie auf beschichtetem Papier oder Hochglanz-Fotografien ist damit nicht m&ouml;glich. Eine einzelne Druckmaschine kann deshalb dutzende Farbprofile haben, um die verschiedenen Anforderungen abzudecken.</li>
</ul>

<h4>Wie kommt man nun an die richtigen Profile f&uuml;r die Hardware?</h4>

<p>Es gibt &raquo;generische&laquo; Profile, die der Ger&auml;te-Hersteller mit Durchschnittswerten erzeugt und zum Download anbietet. Immer mehr Bildschirme, Scanner und Drucker bringen diese schon in ihrer Software mit. Diese Profile passen nahezu perfekt und sind daher eine gute Basis, vor allem wenn man sich keine teure Kalibrierungs-Hardware leisten m&ouml;chte. Auf der Homepage des Herstellers kann man nachschauen, ob es f&uuml;r ein Ger&auml;t ein Farbprofil gibt. F&uuml;r Monitore kann man auch die <a href="http://icc.opensuse.org/">Taxi</a>-Datenbank nutzen, die vom OpenSUSE-Projekt angeboten wird.</p>

<!--We need to add an overview over FLOSS tools for all platforms in a new version of this file-->

<p>Die genaueste Methode, einen Bildschirm einzustellen, ist mit einem Kalibrierungs-Ger&auml;t. Im Prinzip ist das eine Kamera, die Farben mi&szlig;t. Die Software erzeugt Referenzfarben auf dem Monitor und erstellt anhand der Daten der Kamera das Farbprofil. Noch vor kurzem gab es keine Linux-Treiber f&uuml;r die gebr&auml;uchlichen Farbme&szlig;-Ger&auml;te, aber dank des Einsatzes der Open-Source-Farbmanagement-Experten k&ouml;nnen heutzutage die meisten Ger&auml;te immerhin unter Linux, Mac&nbsp;OS&nbsp;X und Windows genutzt werden. Die Open-Source-Treiber k&ouml;nnen auch auf UNIX-Systemen kompiliert werden, wogegen Haiku, OS/2 und eComStation eher nicht unterst&uuml;tzt werden.</p>

<h4>Das Scribus-Farbmanagement einstellen</h4>
<p>Zu den Einstellungen des Farbmanagements kommt man &uuml;ber <a href="settings1.html">Dokument einrichten / Allgemeine Einstellungen</a>. Wie gesagt mu&szlig; mindestens ein RGB- und ein CMYK-Profil installiert sein, um das Farbmanagement zu aktivieren.<br>Da littleCMS die Profile lesen und Korrekturen vornehmen mu&szlig;, wird Scribus mit aktivem Farbmanagement beim Bearbeiten, Speichern und Schlie&szlig;en langsamer.</p>
<table width="100%"><tr><td align="center"><img src="images/cmsmodify1.png" align="center" title="Color Management Preferences" alt="Color Management Preferences"/></td></tr></table>

<p>&raquo;Systemprofile:&laquo; Diese 6 Dropdown-Men&uuml;s zeigen die auf dem System verf&uuml;gbaren Farbprofile. Die Profile f&uuml;r Bilder (z.B. Bitmap) und F&uuml;llfarben m&uuml;ssen einzeln eingestellt werden. Ebenso mu&szlig; man verschiedene Profile f&uuml;r RGB- und CMYK-Farbr&auml;ume ausw&auml;hlen. Zu dem &raquo;Druckerprofil&laquo; ist zu sagen, da&szlig; Scribus bisher nur Farbprofile f&uuml;r den professionellen Druck unterst&uuml;tzt. <b>Ein Profil f&uuml;r den heimischen Tintenstrahl-Drucker wird von Scribus nicht unterst&uuml;tzt und erscheint nicht in der Liste der verf&uuml;gbaren Profile.</b></p>

<!--<p>Solid colors can be described within <strong>RGB</strong> (red green blue) or <strong>CMYK</strong> (cyan,magenta,yellow and K for black - these colors represent the four inks used in process printing or in color ink jets). In this case, we are using some basic RGB colors, which will be later "soft proofed" in the CMYK color space of the printer, which will be a commercial process known as US <a  href="./lcms/swop.html">SWOP</a>on coated paper to ensure rich and vibrant colors.</p>

<p>It is handy to give your device profiles some sort of short hand way of naming. For example the D226500mon.icm monitor profile is a custom profile created with <A href="http://lprof.sf.net" id="LProf" onclick="LProf">LProf</A> with 2.2 gamma and 6500k temperature. The D is for daylight. Ambient light also affects your perception of color, sometimes radically with certain types of artificial light. The Sony 17 name comes from the description when the monitor profile was created with Qmonitorprofiler from littlecms.</p>-->
<p>Die Render-Priorit&auml;ten werden im <a href="cms3.html">n&auml;chsten Abschnitt</a> erkl&auml;rt.</p>
<p>Durch das Setzen des H&auml;kchens bei &raquo;Druckfarben auf dem Bildschirm simulieren&laquo; ahmen Scribus und littleCMS auf dem Monitor die Farben nach, die dem Farbprofil der Druckerei entsprechen.<br>
Wenn man &raquo;Farben au&szlig;erhalb des Farbbereichs markieren&laquo; w&auml;hlt, werden die Fl&auml;chen, die anhand des Druckerprofils nicht akurat gedruckt werden k&ouml;nnen, mit einer gr&uuml;nen Warnfarbe markiert. &Uuml;blicherweise werden Farben, die nicht dem Farbprofil des Druckers entsprechen, dunkler oder heller gedruckt oder die Farbe &auml;ndert sich.</p>

<table width="100%"><tr><td align="center"><img src="images/cms-gamut1.png"/></td><td align="center"><img src="images/cms-gamut2.png"/></td></tr>
    <tr><td><div align="center"><i>Anzeige einer Zeichnung mit Farbbereichswarnung ausgeschaltet (links) und aktiviert (rechts)</i></div></td></tr>
</table>
<p>Die letzte Option &raquo;Tiefenkompensierung benutzen&laquo; kann der Darstellung von Schatten in einem Bild helfen. Hier mu&szlig; man experimentieren, ob es die Bilder verbessert.</p>

</body>
</html>
