<qt>
<title>Farbmanagement mit Scribus, eine Einf&uuml;hrung, Teil 3</title>
<h2>Farbmanagement mit Scribus, eine Einf&uuml;hrung, Teil 3</h2>
<p ><strong>Rendering-Intents</strong></p>

<p>Wer dem Farbmanagement neu begegnet, f&uuml;r den sind die <strong><em>Rendering-Intents </em></strong>(RI) genannten Farbumrechnungsmethoden die andere R&auml;tselaufgabe. Die Wahl zwischen verschiedenen Rendering-Intents gibt Ihnen die M&ouml;glichkeit, LittleCMS mitzuteilen, wie Farben von einem Farbraum zum anderen abgebildet werden sollen.</p>

<p><strong>Perzeptiv</strong> - Dieser RI bildet Farbe &quot;gegl&auml;ttet&quot; ab, und er wahrt dabei  die Verwandtschaft zwischen &auml;hnlichen Farben. Dadurch kommt es nicht zur &quot;Beschneidung&quot; der Farbskala und einem m&ouml;glichen Detailverlust oder zur Bildung unsch&ouml;ner &quot;Farbb&auml;nder&quot;. Eine &quot;Beschneidung&quot; der Farbskala geschieht, wenn eine oder mehrere Farben, die beim Ausgangsbild unterschiedlich sind, im Druckergebnis gleich erscheinen. Der perzeptive RI nimmt &uuml;ber das ganze Bild verteilt kleine Anpassungen vor, um Farbverwandtschaften zu erhalten. Er opfert etwas von der farblichen Pr&auml;zision, um ein gef&auml;lliges Ergebnis zu gew&auml;hrleisten. F&uuml;r fotografische Bilder and Scan-Abtastungen ist dies in der Regel die beste Wahl und kann als Standardeinstellung dienen.</p> 

<p>Der perzeptive RI erzeugt die am besten einsch&auml;tzbaren Ergebnisse, wenn aus einer gro&szlig;en Auswahl von Bildquellen gedruckt wird; so zum Beispiel, wenn RGB-Bilder auf CMYK-Ger&auml;ten ausgegeben werden, oder wenn Sie CMYK-Ger&auml;te anpassen wollen, die voneinander grundverschieden sind. Sie k&ouml;nnen davon ausgehen, da&szlig; diese &quot;idiotensichere&quot; Einstellung stets dann die beste ist, wenn sehr verschiedenartige Bilder anfallen, die &uuml;blicherweise von gro&szlig;formatigen Druckeinrichtungen &uuml;bernommen werden.</p>

<p><strong>S&auml;ttigungserhaltend</strong> steht f&uuml;r Logos, Schmuckfarben usw., wobei versucht wird, die Farbmenge bzw. deren Klarheit und Deutlichkeit (Vividness) zu erhalten, was aber auch dazu f&uuml;hren kann, da&szlig; Fotos h&auml;&szlig;lich wirken. Wenn Sie es mit Logos in einem bestimmten Farbton zu tun haben, d&uuml;rften Sie mit der S&auml;ttigung eine bessere Farbharmonie erzielen, sofern Ihnen die Farbe wichtiger ist als das Bild.</p>

<p><strong>Absolut farbmetrisch: </strong>Wenn eine Farbe nicht druckbar ist, weil sie au&szlig;erhalb des Farbraums des Ausgabeger&auml;tes liegt, dann druckt dieser RI einfach die beste Entsprechung. Er reproduziert die Farben der darstellbaren Skala, kompromi&szlig;los und m&ouml;glichst getreu. So entsteht die genaueste Entsprechung der Schmuckfarben. Leider kann dies auch zum Abschneiden (Clipping) nichtdruckbarer Farben f&uuml;hren, so da&szlig; zwei Farben, die im Original verschieden sind, im Ausdruck gleich erscheinen. Wei&szlig;e Punkte werden in gleicher Weise abgeschnitten, und das verursacht dann Farbzuordnungsprobleme in den hellsten Bildteilen. Diese Art des Abschneidens - mit den daraus resultierenden Problemen - beschr&auml;nken die Brauchbarkeit dieser Visualisierung nahezu auf <!--<a href="./lcms/spot.html">-->Schmuckfarben. <!--</a>-->Einige Anwender werden bei einem Gelbfarbstich in ihrem Bild verdutzt sein, jedoch ist dieser RI unter genau kontrollierten Lichtverh&auml;ltnissen mit einer D50-Lightbox gemessen worden. Hierbei ergibt sich oft eine &quot;w&auml;rmere&quot; Temperatur als unter normalen Betrachtungsbedingungen. So kommt dieser RI fast ausschlie&szlig;lich zur Anwendung, wenn ein Firmenlogo oder eine Farbe haargenau getroffen werden soll - medienunabh&auml;ngig. Kodak-Gelb w&auml;re ein gutes Beispiel.</p>

<p><strong><em>Relativ farbmetrisch: </em></strong>Wenn eine zu druckende Farbe au&szlig;erhalb des Farbraums eines Ausgabeger&auml;ts liegt, dann liefert dieser RI das passendste Druckergebnis, wobei er als Anpassung Wei&szlig; als Farbe des Ausgabepapiers abbildet. Diese &quot;Wei&szlig;punkt&quot;-Abbildung verhindert die Problematik von &quot;Absolut farbmetrisch&quot;, wenn Bilder (au&szlig;er Schmuckfarben) betroffen sind. Werden  L&ouml;sungen wie ColorProof eingesetzt, um mit RGB-Tintenstrahldruckern den CMYK-Druck zu simulieren, k&ouml;nnen Sie diesen RI verwenden, wenn Ihnen das angestrebte Profil exakt bekannt ist. Benutzern von Adobe Press Ready wird dieses Konzept wohlbekannt sein. Die Vorgehensweise funktioniert gut, wenn Sie Ihre Profile (&uuml;blicherweise Scanner, seltener auch Digitalkameras) sorgf&auml;ltig in nach CMYK konvertierte Bilder eingebettet haben, und zwar mit Druckerprofilen, die gleicherma&szlig;en pr&auml;zise mit Farbme&szlig;ger&auml;ten entstanden sind. Dies ist am ehesten der Fall, wenn jemand mit viel Zeit und M&uuml;he seine Ger&auml;te feinkalibriert und profiliert hat. Es ist eine aufwendige ($$$) Ausr&uuml;stung zur Farbkalibrierung notwendig, damit der Drucker unter relativ &uuml;berschaubaren Bedingungen gemessen werden kann.</p>

<h4>Druckausgabe mit Scribus</h4>

<p>Den Benutzern von Scribus stehen f&uuml;r das Drucken mittels Farbmanagement-Intent eine Reihe von Optionen zur Verf&uuml;gung.</p>

<p>Scribus kann beim Druckvorgang wahlweise jenes Druckprofil verwenden, das Sie im Farbmanagement-Bedienfeld ausgew&auml;hlt haben. Das kann sehr praktisch sein, wenn Se zum Beispiel ein kommerzielles Druckerprofil mit Ihrem Tintenstrahldrucker via CUPS simulieren m&ouml;chten. </p>

<p>PostScript-Ausgabe - Hierzu w&auml;re notwendig, da&szlig; Sie Ihre Bilder vor der Aufnahme in eine Scribus-Datei markieren, um ein Scribus-Document dann entweder als echtes PostScript oder als einzelne EPS-Dateien auszugeben. Scribus verwendet Level 3-PostScript. Level 2- und Level 3-PostScript k&ouml;nnen ICC-Profile lesen und nutzen, die sich in einem Bild befinden. Die meisten farbf&auml;higen PostScript-Ger&auml;te sind in der Lage, eingebettete Profile zu lesen und f&uuml;r die Farbwiedergabe im PostScript zu nutzen, und zwar unter Verwendung eines sogenannten Farb-Wiedergabe-Verzeichnisses (Color Rendering Dictionary; CRD).</p>
</qt>
