From volkerius@h3c.de Sat Feb 10 14:48:55 2007
X-Virus-Flag: no
Return-Path: <volkerius@h3c.de>
X-Spam-Checker-Version: SpamAssassin 3.1.3-gr0 (2006-06-01) on 
	luxbg.bradney.info
X-Spam-Level: 
X-Spam-Status: No, score=-1.3 required=5.0 tests=AWL,BAYES_00,HTML_00_10,
	HTML_MESSAGE,HTML_TITLE_SUBJ_DIFF,TW_KZ autolearn=no version=3.1.3-gr0
Delivered-To: cbradney@zipworld.com.au
Received: from mailin2.pacific.net.au (mailin2.pacific.net.au [61.8.0.81])
	by mailstore1.syd.pacific.net.au (Postfix) with ESMTP id 22D70949B6
	for <cbradney@zipworld.com.au>; Sun, 11 Feb 2007 00:49:06 +1100 (EST)
Received: from enterprise.noxa.de (unknown [212.60.197.71])
	by mailin2.pacific.net.au (Postfix) with ESMTP id BEE25187447
	for <cbradney@zipworld.com.au>; Sun, 11 Feb 2007 00:49:04 +1100 (EST)
Received: (qmail 7153 invoked from network); 10 Feb 2007 14:48:56 +0100
Received: from cable-81-173-132-207.netcologne.de (HELO ?192.168.2.100?) (81.173.132.207)
  by 212.60.198.71 with SMTP; 10 Feb 2007 14:48:56 +0100
Message-ID: <45CDCD47.2060002@h3c.de>
Date: Sat, 10 Feb 2007 14:48:55 +0100
From: Volker Ribbert <volkerius@h3c.de>
User-Agent: Mozilla Thunderbird 0.8 (X11/20041012)
X-Accept-Language: en-us, en
MIME-Version: 1.0
To: cbradney@zipworld.com.au
Subject: cms4.html
References: <42E8CBC5.9030103@gmx.de> <200607192050.19227.cbradney@zip.com.au> <45AF78EF.3070908@h3c.de> <200701182102.21837.cbradney@zip.com.au>
In-Reply-To: <200701182102.21837.cbradney@zip.com.au>
Content-Type: multipart/mixed;
  boundary="------------020402020207090903090607"
X-getmail-filter-classifier: stream: OK
X-Virus-Status: No
X-Virus-Checker-Version: clamassassin 1.2.3 with clamdscan / ClamAV 0.88.7/2546/Sat Feb 10 09:55:09 2007
X-Length: 11101
X-UID: 116324
X-KMail-Filtered: 970411

This is a multi-part message in MIME format.
--------------020402020207090903090607
Content-Type: text/plain; charset=ISO-8859-1; format=flowed
Content-Transfer-Encoding: 7bit

Hello Craig,

Today, another file, cms4.html, has become ready. During the last weeks 
  I have changed my style of work to dedicating (merely) 10 to 15 
minutes a day to translating a Scribus file - but most of the time every 
morning (!), before I set out for my job. It seems to go smoothly - step 
by step. :-)

Kind regards,

Volker




Craig Bradney wrote:

> Glad to hear from you again. Thank you very much :) Happy New Year.
> 
> Well, things are going slowly in the Scribus world. We are heading towards 
> 1.3.4 but its taking its time. Soon, I hope. We would be very please to still 
> get contributions from you, you have helped a lot so far!
> 
> Good luck for the new job. I know what you mean, having started at Amazon in 
> June 06.
> 
> Regards
> Craig
> 


-- 
"Cars don't buy cars." Henry Ford

--------------020402020207090903090607
Content-Type: text/html;
 name="cms4.html"
Content-Transfer-Encoding: quoted-printable
Content-Disposition: inline;
 filename="cms4.html"

<qt>
<title>Farbmanagement mit Scribus, eine Einf&uuml;hrung, Teil 4</title>
<h2>Farbmanagement mit Scribus, eine Einf&uuml;hrung, Teil 4</h2>
<h4>PDF/X-3 und Farbmanagement</h4>
<p>Im Vorausgegangenen haben wir die Grundlagen behandelt und gesehen, wi=
e sich Farbmanagement aktivieren und richtig konfigurieren l&auml;&szlig;=
t. Betrachten wir nun einmal die Verwendung von PDF/X-3, um damit unsere =
Druckausgabe f&uuml;r den kommerziellen Einsatz zu optimieren. PDF/X-3 is=
t die neueste und fortschrittlichste ISO-Norm f&uuml;r PDF-Dateien. Scrib=
us unterst&uuml;tzt diese vollst&auml;ndig und ist dar&uuml;ber hinaus di=
e erste DTP-Applikation, die PDF/X-3-konforme Dateien direkt exportieren =
kann.</p>

<p>Der Hauptvorteil von PDF/X-3 liegt in der typischerweise genaueren Far=
bumsetzung von  RGB hin zur CMYK-Ausgabe des Druckers. Die Genauigkeit is=
t darauf zur&uuml;ckzuf&uuml;hren, da&szlig; im  Druckverfahren bis fast =
zuletzt mit RGB-Farben gearbeitet wird und erst der RIP (Raster Image Pro=
cessor) im Drucker die Umsetzung von RGB &gt; CMYK vollzieht. Nachteilig =
ist, da&szlig; nur die neuesten und frisch aktualisierten RIPs die Norm P=
DF/X-3 unterst&uuml;tzen, obgleich andere vielleicht fr&uuml;here PDF/X-x=
-Normen unterst&uuml;tzen. Da der RIP-Prozessor detaillierte Informatione=
n &uuml;ber den genauen Farbbereich und entsprechende F&auml;higkeiten be=
sitzt, ist in den meisten F&auml;llen davon auszugehen, da&szlig; die Ums=
etzung genauer ausf&auml;llt. Zwar schlie&szlig;t PDF/X-3 die Verwendung =
von CMYK-Bildern nicht aus, ist jedoch am besten zur Bearbeitung Ihrer Fa=
rben in RGB geeignet, solange dies im Verfahren m&ouml;glich ist. </p>
<p>Der Hauptnachteil beim Einsatz von PDF/X-3 besteht in zweierlei Hinsic=
ht: Mit ihm k&ouml;nnen Sie von Haus aus keine Transparenz einsetzen. PDF=
/X-3 basiert auf PDF-1.3, welches keine Transparenz unterst&uuml;tzt. Zum=
 anderen gibt es nur eine begrenzte - wenn auch wachsende - Anzahl Drucke=
r, die diese Unterst&uuml;tzung bieten. Fragen Sie im Zweifel nach! Meine=
 Tests haben sehr gute Resultate erbracht, mit einem Minimum an Farbversc=
hiebung. </p>
<p></p>
<p>Die andere Frage ist, welches Druckerprofil man verwenden sollte. Es g=
ibt zwei Strategien: Die erste besteht darin, ein reelles ICC-Profil Ihre=
s Drucks f&uuml;r die passende Papierart zu haben. Die zweite geht den We=
g, einen renommierten Druckstandard wie SWOP oder ECI einzusetzen. Der Ge=
brauch von PDF/X-3 erfordert das Zusammenspiel mit Ihrem Drucker, doch es=
 kann Ihnen dabei helfen, die Farbabstimmung des Resultats wirklich zu ve=
rbessern. Wie immer sollten Sie auf jeden Fall bei Ihrer Druckerei vorbei=
schauen, und zwar <strong>vorher</strong>. Falls Ihnen die gegebenen Antw=
orten nicht weiterhelfen, versuchen Sie es anderswo. Drucken ist ein Gesc=
h&auml;ft mit Konkurrenz, und fast immer gibt es eine Alternative.


<p><strong>Erfahrungen aus der Praxis</strong></p>

<p>Der Autor hat Scribus schon mit einer Vielzahl von Bildern und aktivie=
rtem Farbmanagement getestet. Die hochufl&ouml;senden RGB- und CMYK-TIFF-=
Grafiken wurden mit modernsten Farbmanagement-Tools unter Windows 2000 au=
fbereitet, mit Photoshop 6, mit hardware-kalibrierten und ebenso profilie=
rten professionellen DTP-Monitoren, und schlie&szlig;lich mit einem Kontr=
ollausdruck auf einem PostScript Level 3-Drucker. Diese Bilder werden als=
 Titelfotos f&uuml;r ein Magazin mit einer Jahresauflage von mehr als ein=
er Million Exemplaren eingesetzt. Da sie dieselben Druckerprofile wie bei=
 der Produktion des Magazins verwenden, k&ouml;nnen LittleCMS und Scribus=
 Voransichten erzeugen, die bemerkenswert pr&auml;zise ausfallen - wenn m=
an bedenkt, wie relativ neu LittleCMS und Scribus noch sind. Die Pr&auml;=
zision von LittleCMS ist mit jeder 1.1x-Version weiter gestiegen, insbeso=
ndere bei absolut farbmetrischem RI. LittleCMS 1.11+ besitzt eine Tiefenk=
ompensierung (Black Point Comp.), die Scribus einsetzen kann, wenn Little=
CMS 1.11 (oder h&ouml;her) installiert ist. Dies bewirkt bei Fotos eine K=
ontrastverbesserung.</p>

<p>Gegenw&auml;rtig ist das einzige frei erh&auml;ltliche Bitmap-Bildbear=
beitungsprogramm f&uuml;r Linux, das mit Farbmanagement etwas anfangen ka=
nn, Corel Photopaint. Es besitzt ein hohes Ma&szlig; an Flexibilit&auml;t=
 bez&uuml;glich farbmodifizierter Voransichten, und Sie k&ouml;nnen diese=
lbe Profilkombination aktivieren wie f&uuml;r Scribus. Das wahrscheinlich=
 wichtigste, was Sie Photopaint hinzuf&uuml;gen sollten, ist ein Monitorp=
rofil - falls ein solches mit Qmonitorprofiler erstellt wurde. Eine ander=
e n&uuml;tzliche Funktion f&uuml;r Bildvoransichten mit Photopaint ist se=
ine F&auml;higkeit, anzuzeigen, wenn Bilder au&szlig;erhalb des Farbraums=
 liegen, da Scribus die Einstellungen f&uuml;r das Farbmanagement entspre=
chend anwenden kann. Au&szlig;erdem k&ouml;nnen Sie das Hilfsprogramm <st=
rong>TIFFicc</strong> von LittleCMS einsetzen und diese Profile direkt an=
wenden. Es ist davon auszugehen, da&szlig; die n&auml;chste GIMP-Version =
2.4 &uuml;ber mehr Farbmanagement-Funktionalit&auml;t verf&uuml;gen wird.=
 </p>

<p>Wer mit Scribus erzeugte PDF-Dateien im Adobe Acrobat 4.05 betrachtet,=
 wird bei TIFF-Bildern in RGB und CMYK mitunter Farbverschiebungen bemerk=
en. Dies ist ein Fehler im Acrobat und kein Problem der PDF-Dateien, die =
Scribus erzeugt hat. Dieselben Dateien erscheinen mit dem Acrobat 5 v&oum=
l;llig einwandfrei - sowohl unter Windows 2000 als auch Mac OS - und wenn=
 die Ausgabe auf einem PostScript-Level 3-Drucker erfolgt. Adobe hat den =
Acrobat Reader 5.0.10 f&uuml;r Linux und Solaris herausgegeben, und diese=
r besitzt viele Verbesserungen, einschlie&szlig;lich Gewschwindigeit und =
Farbgenauigkeit. Alle Anwender sollten m&ouml;glichst zur Version 7 aufsc=
hlie&szlig;en, sobald der neue Reader herauskommt. Au&szlig;erdem bietet =
diese Version eine saubere Darstellung der neuen M&ouml;glichkeiten von S=
cribus&apos; PDF-Formularen. Wenn Ihnen etwas daran liegt, dann ist es m&=
ouml;glich, eine aktuelle Version von WINE zu installieren und sowohl den=
 Acrobat Reader 5.1 als auch die Vollversion des Acrobat 5.0.5 f&uuml;r W=
indows ohne besondere Probleme auszuf&uuml;hren.</p>

<p><strong>Fazit</strong></p>

<p>Anhand von Beispielen haben wir nun auf einfache Weise gezeigt, wie si=
ch Farbmanagement auf unser Dokument anwenden l&auml;&szlig;t. Man nehme =
das urpr&uuml;ngliche Bildmaterial, wende ein geeignetes Profil an und w&=
auml;hle dann den richtigen RI zur Umsetzung in ein anderes Farbmodell. I=
n unserem Beispiel weist Scribus - &uuml;ber das Kontrollk&auml;stchen &q=
uot;Drucker simulieren&quot; - LittleCMS an, eine Umsetzung in zwei Schri=
tten vorzunehmen, damit Ihr Monitor mit einer akzeptablen Genauigkeit auf=
warten kann, die auch farblich dem Druck Ihrer Bilder entspricht.</p>

<p>Das Bestreben, Scibus mit einem einfachen, jedoch wirksamen Farbmanage=
ment zu versehen, ist ein ehrgeiziger - und nach &Uuml;berzeugung des Aut=
ors durchaus ernster Versuch im Bereich freier Software, den Endanwender =
mit einem Farbmanagement auszustatten. Diese Art Ausstattung ist typische=
rweise eher bei Hochleistungsanwendungen der professionellen Druckvorstuf=
e anzutreffen. Da die Open Source hier unbekanntes Terrain betritt, sind =
Ihre Kommentare und Anregungen zu dieser Beschreibung, aber auch Ihre eig=
enen Farbmanagement-Erfahrungen, in hohem Ma&szlig;e willkommen. Dem Lese=
r sollte auch bewu&szlig;t sein, da&szlig; in der Grafikindustrie noch st=
&auml;ndig an der Verbesserung des Farbmanagements gearbeitet wird.</p>

<p><strong>Haben Sie etwas Geduld</strong> - Farbmanagement ist ein neuer=
 und entwicklungsf&auml;higer Teil des DTP. Es braucht halt etwas Zeit, b=
is man die Thorie versteht, welche schlie&szlig;lich zu praktischen Ergeb=
nissen f&uuml;hrt. </p>

<p>Danksagung an:</p>

<p>Mart&iacute; Maria, den Entwickler von LittleCMS, ohne den dieses nich=
t m&ouml;glich w&auml;re.</p>

</qt>

--------------020402020207090903090607--


