<qt>
<title>Farbmanagement mit Scribus, eine Einf&uuml;hrung, Teil 4</title>
<h2>Farbmanagement mit Scribus, eine Einf&uuml;hrung, Teil 4</h2>
<h4>PDF/X-3 und Farbmanagement</h4>
<p>Im Vorausgegangenen haben wir die Grundlagen behandelt und gesehen, wie sich Farbmanagement aktivieren und richtig konfigurieren l&auml;&szlig;t. Betrachten wir nun einmal die Verwendung von PDF/X-3, um damit unsere Druckausgabe f&uuml;r den kommerziellen Einsatz zu optimieren. PDF/X-3 ist die neueste und fortschrittlichste ISO-Norm f&uuml;r PDF-Dateien. Scribus unterst&uuml;tzt diese vollst&auml;ndig und ist dar&uuml;ber hinaus die erste DTP-Applikation, die PDF/X-3-konforme Dateien direkt exportieren kann.</p>

<p>Der Hauptvorteil von PDF/X-3 liegt in der typischerweise genaueren Farbumsetzung von  RGB hin zur CMYK-Ausgabe des Druckers. Die Genauigkeit ist darauf zur&uuml;ckzuf&uuml;hren, da&szlig; im  Druckverfahren bis fast zuletzt mit RGB-Farben gearbeitet wird und erst der RIP (Raster Image Processor) im Drucker die Umsetzung von RGB &gt; CMYK vollzieht. Nachteilig ist, da&szlig; nur die neuesten und frisch aktualisierten RIPs die Norm PDF/X-3 unterst&uuml;tzen, obgleich andere vielleicht fr&uuml;here PDF/X-x-Normen unterst&uuml;tzen. Da der RIP-Prozessor detaillierte Informationen &uuml;ber den genauen Farbbereich und entsprechende F&auml;higkeiten besitzt, ist in den meisten F&auml;llen davon auszugehen, da&szlig; die Umsetzung genauer ausf&auml;llt. Zwar schlie&szlig;t PDF/X-3 die Verwendung von CMYK-Bildern nicht aus, ist jedoch am besten zur Bearbeitung Ihrer Farben in RGB geeignet, solange dies im Verfahren m&ouml;glich ist. </p>
<p>Der Hauptnachteil beim Einsatz von PDF/X-3 besteht in zweierlei Hinsicht: Mit ihm k&ouml;nnen Sie von Haus aus keine Transparenz einsetzen. PDF/X-3 basiert auf PDF-1.3, welches keine Transparenz unterst&uuml;tzt. Zum anderen gibt es nur eine begrenzte - wenn auch wachsende - Anzahl Drucker, die diese Unterst&uuml;tzung bieten. Fragen Sie im Zweifel nach! Meine Tests haben sehr gute Resultate erbracht, mit einem Minimum an Farbverschiebung. </p>
<p></p>
<p>Die andere Frage ist, welches Druckerprofil man verwenden sollte. Es gibt zwei Strategien: Die erste besteht darin, ein reelles ICC-Profil Ihres Drucks f&uuml;r die passende Papierart zu haben. Die zweite geht den Weg, einen renommierten Druckstandard wie SWOP oder ECI einzusetzen. Der Gebrauch von PDF/X-3 erfordert das Zusammenspiel mit Ihrem Drucker, doch es kann Ihnen dabei helfen, die Farbabstimmung des Resultats wirklich zu verbessern. Wie immer sollten Sie auf jeden Fall bei Ihrer Druckerei vorbeischauen, und zwar <strong>vorher</strong>. Falls Ihnen die gegebenen Antworten nicht weiterhelfen, versuchen Sie es anderswo. Drucken ist ein Gesch&auml;ft mit Konkurrenz, und fast immer gibt es eine Alternative.


<p><strong>Erfahrungen aus der Praxis</strong></p>

<p>Der Autor hat Scribus schon mit einer Vielzahl von Bildern und aktiviertem Farbmanagement getestet. Die hochufl&ouml;senden RGB- und CMYK-TIFF-Grafiken wurden mit modernsten Farbmanagement-Tools unter Windows 2000 aufbereitet, mit Photoshop 6, mit hardware-kalibrierten und ebenso profilierten professionellen DTP-Monitoren, und schlie&szlig;lich mit einem Kontrollausdruck auf einem PostScript Level 3-Drucker. Diese Bilder werden als Titelfotos f&uuml;r ein Magazin mit einer Jahresauflage von mehr als einer Million Exemplaren eingesetzt. Da sie dieselben Druckerprofile wie bei der Produktion des Magazins verwenden, k&ouml;nnen LittleCMS und Scribus Voransichten erzeugen, die bemerkenswert pr&auml;zise ausfallen - wenn man bedenkt, wie relativ neu LittleCMS und Scribus noch sind. Die Pr&auml;zision von LittleCMS ist mit jeder 1.1x-Version weiter gestiegen, insbesondere bei absolut farbmetrischem RI. LittleCMS 1.11+ besitzt eine Tiefenkompensierung (Black Point Comp.), die Scribus einsetzen kann, wenn LittleCMS 1.11 (oder h&ouml;her) installiert ist. Dies bewirkt bei Fotos eine Kontrastverbesserung.</p>

<p>Gegenw&auml;rtig ist das einzige frei erh&auml;ltliche Bitmap-Bildbearbeitungsprogramm f&uuml;r Linux, das mit Farbmanagement etwas anfangen kann, Corel Photopaint. Es besitzt ein hohes Ma&szlig; an Flexibilit&auml;t bez&uuml;glich farbmodifizierter Voransichten, und Sie k&ouml;nnen dieselbe Profilkombination aktivieren wie f&uuml;r Scribus. Das wahrscheinlich wichtigste, was Sie Photopaint hinzuf&uuml;gen sollten, ist ein Monitorprofil - falls ein solches mit Qmonitorprofiler erstellt wurde. Eine andere n&uuml;tzliche Funktion f&uuml;r Bildvoransichten mit Photopaint ist seine F&auml;higkeit, anzuzeigen, wenn Bilder au&szlig;erhalb des Farbraums liegen, da Scribus die Einstellungen f&uuml;r das Farbmanagement entsprechend anwenden kann. Au&szlig;erdem k&ouml;nnen Sie das Hilfsprogramm <strong>TIFFicc</strong> von LittleCMS einsetzen und diese Profile direkt anwenden. Es ist davon auszugehen, da&szlig; die n&auml;chste GIMP-Version 2.4 &uuml;ber mehr Farbmanagement-Funktionalit&auml;t verf&uuml;gen wird. </p>

<p>Wer mit Scribus erzeugte PDF-Dateien im Adobe Acrobat 4.05 betrachtet, wird bei TIFF-Bildern in RGB und CMYK mitunter Farbverschiebungen bemerken. Dies ist ein Fehler im Acrobat und kein Problem der PDF-Dateien, die Scribus erzeugt hat. Dieselben Dateien erscheinen mit dem Acrobat 5 v&ouml;llig einwandfrei - sowohl unter Windows 2000 als auch Mac OS - und wenn die Ausgabe auf einem PostScript-Level 3-Drucker erfolgt. Adobe hat den Acrobat Reader 5.0.10 f&uuml;r Linux und Solaris herausgegeben, und dieser besitzt viele Verbesserungen, einschlie&szlig;lich Gewschwindigeit und Farbgenauigkeit. Alle Anwender sollten m&ouml;glichst zur Version 7 aufschlie&szlig;en, sobald der neue Reader herauskommt. Au&szlig;erdem bietet diese Version eine saubere Darstellung der neuen M&ouml;glichkeiten von Scribus&apos; PDF-Formularen. Wenn Ihnen etwas daran liegt, dann ist es m&ouml;glich, eine aktuelle Version von WINE zu installieren und sowohl den Acrobat Reader 5.1 als auch die Vollversion des Acrobat 5.0.5 f&uuml;r Windows ohne besondere Probleme auszuf&uuml;hren.</p>

<p><strong>Fazit</strong></p>

<p>Anhand von Beispielen haben wir nun auf einfache Weise gezeigt, wie sich Farbmanagement auf unser Dokument anwenden l&auml;&szlig;t. Man nehme das urpr&uuml;ngliche Bildmaterial, wende ein geeignetes Profil an und w&auml;hle dann den richtigen RI zur Umsetzung in ein anderes Farbmodell. In unserem Beispiel weist Scribus - &uuml;ber das Kontrollk&auml;stchen &quot;Drucker simulieren&quot; - LittleCMS an, eine Umsetzung in zwei Schritten vorzunehmen, damit Ihr Monitor mit einer akzeptablen Genauigkeit aufwarten kann, die auch farblich dem Druck Ihrer Bilder entspricht.</p>

<p>Das Bestreben, Scibus mit einem einfachen, jedoch wirksamen Farbmanagement zu versehen, ist ein ehrgeiziger - und nach &Uuml;berzeugung des Autors durchaus ernster Versuch im Bereich freier Software, den Endanwender mit einem Farbmanagement auszustatten. Diese Art Ausstattung ist typischerweise eher bei Hochleistungsanwendungen der professionellen Druckvorstufe anzutreffen. Da die Open Source hier unbekanntes Terrain betritt, sind Ihre Kommentare und Anregungen zu dieser Beschreibung, aber auch Ihre eigenen Farbmanagement-Erfahrungen, in hohem Ma&szlig;e willkommen. Dem Leser sollte auch bewu&szlig;t sein, da&szlig; in der Grafikindustrie noch st&auml;ndig an der Verbesserung des Farbmanagements gearbeitet wird.</p>

<p><strong>Haben Sie etwas Geduld</strong> - Farbmanagement ist ein neuer und entwicklungsf&auml;higer Teil des DTP. Es braucht halt etwas Zeit, bis man die Thorie versteht, welche schlie&szlig;lich zu praktischen Ergebnissen f&uuml;hrt. </p>

<p>Danksagung an:</p>

<p>Mart&iacute; Maria, den Entwickler von LittleCMS, ohne den dieses nicht m&ouml;glich w&auml;re.</p>

</qt>
