<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Der Farbkreis</title>
</head>
<body>

<h2>Der Farbkreis</h2>
<table width="90%" cellpadding="5">
<tr><td><img src="../en/images/RYB_color_wheel.png" title="Das RYB-Farbrad" alt="Das RYB-Farbrad"/>
<p><i>Das RYB-Farbrad</i></td>
<td><p>Urspr&uuml;nglich von Wissenschaftlern wie Isaac Newton eingef&uuml;hrt, um <i>alle</i> Farben des <i>physikalischen Spektrums</i> darzustellen, wird ein Farbkreis (oder Farbrad) heutzutage von K&uuml;nstlern und Designern dazu verwendet, Farben anhand der <i>Wahrnehmung</i> auszuw&auml;hlen. Ein Farbkreis verwendet dazu wie die <a href="color1.html">RGB- und die CMY(K)-Farbmodelle</a> das Konzept <a href="https://de.wikipedia.org/wiki/Grundfarbe">Grundfarben</a>. In diesem Fall Rot, Gelb und Blau, deren englische Namen (Red, Yellow, Blue) auch zu der Abk&uuml;rzung RYB f&uuml;hrten. Im Gegensatz zu Farbkreisen, die auf den RGB- oder CMY(K)-Farbmodellen aufbauen, verfolgt der Scribus-Farbkreis den traditionellen &raquo;k&uuml;nstlerischen&laquo; oder &raquo;Wahrnehmungs&laquo;-Ansatz, da dieser (fast immer) zu optisch ansprechenden Ergebnissen f&uuml;hrt, indem er sich mathematischer Formeln bedient, die von Goethe und seinen Nachfolgern beobachtet und erforscht wurden.</p>
</tr>
</table>
<h3>Der Farbkreis-Dialog</h3>
<p>Der Farbkreis-Dialog (unter <i>Extras&nbsp;&gt; Farbkreis</i>) sieht auf den ersten Blick recht einfach aus, ist aber in Wahrheit sehr vielseitig. Man kann ihn nur mit einem ge&ouml;ffneten Dokument aufrufen, da die erstellten Farb-Zusammenstellungen zu den Farben des Dokuments hinzugef&uuml;gt werden.</p><br>
<table width="100%"><tr><td align="center"><img src="images/colorwheel.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/></td></tr></table>

<h4>Allgemein</h4>
<p>Oben links sieht man den Farbkreis. Abh&auml;ngig vom gew&auml;hlten Farbschema sieht man einen oder mehrere kleine Kreise am Rand des Farbkreises. Dies sind Farb-Indikatoren, die man mit der Maus verschieben kann, um das Farbschema zu ver&auml;ndern. In der Mitte des Farbkreises ist immer eine Farbe. Das ist die <i>Grundfarbe</i>, die die anderen Farben innerhalb des Farbschemas festlegt. Diese Farbe kann man &auml;ndern, indem man auf eine beliebige Stelle im Farbkreis klickt oder indem man rechts eine andere Grundfarbe einstellt.</p>
<p>Unterhalb des Farbkreises kann man das Farbschema w&auml;hlen, was weiter unter beschrieben wird. Da die Farbschemata geometrisch angeordnet sind, kann man bei manchen (aber nicht allen) den &raquo;Winkel&laquo; oder &raquo;Abstand&laquo; der Farben ver&auml;ndern.</p>
<h4>Vorschau</h4>
<p>Im Vorschau-Bereich sieht man eine Vorschau des gew&auml;hlten Farbschemas und einen Beispieltext, der zeigt, wie Text als 100% RGB-Schwarz und 100% RGB-Wei&szlig; vor diesen Farben im Hintergrund aussieht.</p> 
Eine wichtige Eigenschaft der Vorschau ist, da&szlig; sie die Ansicht bei Farbblindheit simulieren kann (<i>Art der Sehbehinderung</i>). Wenn man mit Farbharmonien arbeitet, sollte man immer bedenken, da&szlig; manche Kombinationen, die bei den meisten Menschen funktionieren, bei Menschen mit bestimmten Sehbinderungen gar nicht funktionieren. Zum Beispiel k&ouml;nnen zwei genau gegens&auml;tzliche Farben gleich aussehen, oder Text kann vor einem farbigen Hintergrund f&uuml;r diese Menschen komplett unsichtbar sein.</p>

<h4>Farbmodelle</h4>
<p>Um die <i>Grundfarbe</i> festzulegen, unterst&uuml;tzt der Farbkreis-Dialog drei Farbmodelle und hat zudem ein Feld, um sie variabel einzustellen. CMYK, RGB und HSV sind unter <a href="color1.html">Farbpaletten</a> beschrieben. Zus&auml;tzlich kann man jede Farbe im Dokument nehmen, z.B. aus der aktuellen Farbpalette oder auch alle importierten oder selbst kreierten Farben.</p>

<h4>Farbschema</h4>

<p><b>Monochromatische Farben:</b></p>
<p>Das monochromatische Farbschema (wie im Bild oben) besteht aus einer Kombination aus einer Grundfarbe mit je einer dunkleren und helleren Variante. Man kann den &raquo;Winkel&laquo; nicht &auml;ndern, da es zwischen diesen Farben keine geometrische Relation gibt.</p>

<table width="80%" cellpadding="5">
<tr><td><p><b>Analoge Farben:</b></p></td></tr>
<tr><td align="center"><img src="../en/images/cw-analogous_20.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/><br />Winkel = 20
<p><img src="../en/images/cw-analogous_30.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/><br />Winkel = 30</td>
<td align="left" rowspan="2"><p>Das analoge Farbschema erzeugt Harmonien indem benachbarte Farben im Farbkreis verwendet werden. Bei einem kleinen Winkel sind die Farben gef&auml;lliger, bei gr&ouml;&szlig;eren Winkeln werden die Kontraste gr&ouml;&szlig;er.</p>
<p>In diesen Bildern ist die Grundfarbe ganz rechts.</p></td>
</tr>
<tr><td><p><b>Komplement&auml;rfarbe:</b></p></td</tr>
<tr><td align="center"><img src="../en/images/cw-complementary.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/><br />Grundfarbe links</td>
<td align="left"><p>Komplement&auml;rfarben stehen sich im Farbkreis gegen&uuml;ber, der Winkel betr&auml;gt also immer 180°. Am besten eignen sie sich f&uuml;r f&uuml;r einen starken Kontrast zwischen gr&ouml;&szlig;eren Fl&auml;chen. Sie sollten aber nicht f&uuml;r Text und Text-Hintergrund verwendet werden.</p></td>
</tr>
<tr><td><p><b>Gespaltene Komplement&auml;rfarben:</b></p></td></tr>
<tr><td align="center"><img src="../en/images/cw-splitcompl_20.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/><br />Winkel = 20
<p><img src="../en/images/cw-splitcompl_40.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/><br />Winkel = 40</td>
<td align="left">Die Grundfarbe ist ganz rechts.<br />Dies ist im Grunde eine Kombination aus analogen und Komplement&auml;rfarben. Die ersten zwei Farben von links sind mit dem eingestellten Winkel analoge Farben zur Grundfarbe. Die n&auml;chsten zwei Farben sind die Komplement&auml;rfarben dieser analogen Farben.</td>
</tr>
<tr><td><p><b>Triadisch:</b></p></td></tr>
<tr><td align="center"><img src="../en/images/cw-triadic.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/><br />Grundfarbe rechts</td>
<td align="left">Ein festes Schema mit drei Farben im 120°-Winkel.</td>
</tr>
<tr><td><p><b>Triadisch (Doppelte&nbsp;Komplement&auml;rfarben)</b></p>
<b><span style="color:#B91023">&uuml;bersetzung aus dem Dialog &uuml;bernommen - tetradic wird mit triadisch &uuml;bersetzt!</span><b></td></tr>
<tr><td align="center"><img src="../en/images/cw-tetradic_20.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/><br />Winkel = 20
<p><img src="../en/images/cw-tetradic_40.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/><br />Winkel = 40</td>
<td align="left">Die Grundfarbe ist ganz rechts.<br />Die zweite Farbe von links ist eine einzelne analoge Farbe mit dem eingestellten Winkel, die erste und dritte Farbe sind die entsprechenden Komplement&auml;rfarben. Die Komplement&auml;rfarben sind dabei die erste und vierte Farbe und die zweite und dritte.</td>
</tr></table>
<h4>Die Schemata nutzen</h4>
<p>Bei so vielen Schemata und Einstellungen gibt es nat&uuml;rlich nicht die eine passende L&ouml;sung. Durch das Studieren von Werbung, Homepages oder anderen Beispielen ansprechenden Designs kann man viel lernen, wenn man sein Augenmerk auf das Farbschema richtet, und sich &uuml;berlegt, welches gut funktioniert und welches nicht. Es gibt gute Gr&uuml;nde f&uuml;r analoge und f&uuml;r Komplement&auml;rfarben, und die meisten Designs haben beides in unterschiedlichen Bereichen der Seite.</p>
<h4>Farbharmonien zu den Farben des Dokuments hinzuf&uuml;gen</h4>
<p>Im Farbkreis-Dialog unten rechts wird das &raquo;Ergebnis&laquo; in allen drei Farbmodellen angezeigt. Leider werden die Namen der Farben automatisch erzeugt und man kann sie im Farbkreis-Dialog nicht &auml;ndern. Aus diesem Grund mu&szlig; man sie mit <i>Bearbeiten&nbsp;&gt; Farben</i> <a href="color1.html">umbenennen</a>, falls man mehrere Farbharmonien in einem Dokument verwenden will oder falls man zusammengeh&ouml;rige Farben in der Liste der Farben beieinander haben will.</p>
<p>Ganz unten findet man zwei M&ouml;glichkeiten, die Farben zu den Dokumentfarben hinzuzuf&uuml;gen: &raquo;Hinzuf&uuml;gen&laquo; und &raquo;Ersetzen&laquo;.</p>
<p><b>Hinzuf&uuml;gen</b> f&uuml;gt die neu erstellten Farben zu den Dokument-Farben hinzu. Falls man schon eine andere Farbharmonie erstellt hat ohne die Farben umzubenennen, erscheint dieser Dialog:</p><br>
<table width="100%"><tr><td align="center"><img src="images/cw-warning.png" title="Der Farbkreis-Dialog" alt="Der Farbkreis-Dialog"/></td></tr></table>
<p>Bei Klick auf <strong>OK</strong> erscheint der <i>Farben</i>-Dialog und man kann die Farben umbenennen. Danach kommt man zum Farbkreis zur&uuml;ck und kann die neue Farbharmonie hinzuf&uuml;gen.</p>
<p><b>Ersetzen</b> wird &ndash; wenig &uuml;berraschend &ndash; Farben fr&uuml;her erzeugter Farbschemata ersetzen, wenn sie den gleichen Namen haben.</p>
<h4>Einschr&auml;nkungen</h4>
<p>Sowohl beim RYB-Farbmodell als auch seiner Umsetzung in Scribus gibt es einige Einschr&auml;nkungen:</p>
<ul>
<li>Das RYB-Farbmodell ist <b>unvollst&auml;ndig</b>. Es gibt keine neutralen Farben wie Schwarz, Wei&szlig; oder Grau, und es ist bei CMYK- und Schmuckfarben nicht zuverl&auml;ssig. Einige Farbhersteller wie Pantone oder RAL bieten deshalb spezielle Software an, um Farbharmonien mit ihren Schmuckfarben zu erstellen. <a href="color6.html">dtp studios</a> &raquo;Digital Colour Atlas&laquo; untersagt sogar Farbharmonien mit unterschiedlichen Farbsystemen.</li>
<li>Die Umsetzung in Scribus bietet (noch) nicht alle m&ouml;glichen RYB-Farbharmonien an. Das Scribus-Team arbeitet daran.</li>
<li>Man mu&szlig; sich der <a href="color1.html">Unterschiede</a> zwischen CMYK- und RGB-Farbmodellen ebenso bewu&szlig;t sein, wie den Ergebnissen bestimmter <a href="cms3.html">Render-Priorit&auml;ten</a>. Naturgesetze lassen sich nicht umgehen, und manchmal hilft nur Erfahrung (und ein verl&auml;&szlig;lich eingerichtetes Farbmanagement), um ein entt&auml;uschendes Druckergebnis zu vermeiden.</li>
</ul>
</body>
</html>
