<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Farbpaletten verwalten</title>
</head>
<body>
<h2>Farbpaletten verwalten</h2>
<h3>Die Standard-Farbpalette &auml;ndern</h3>
<p>Die Standard-Farbpalette kann nur ge&auml;ndert werden, wenn kein Scribus-Dokument ge&ouml;ffnet ist. Dann &ouml;ffnet man mit <i>Bearbeiten &gt; Farben</i> die Farbverwaltung:</p>

<table width="100%"><tr><td align="center"><img src="images/colrs-mgt1_1.png" title="Scribus Farbverwaltung" alt="Scribus Farbverwaltung" /></td></table><br/>
<table width="100%"><tr><td align="center"><img src="images/colrs-mgt1.png" title="Scribus Farbverwaltung" alt="Scribus Farbverwaltung" /></td></table><br/>

<p>Jetzt kann man f&uuml;r <i>neue</i> Dokumente eine Farbpalette als Standard festlegen. Die &Auml;nderungen wirken sich nicht auf bereits existierende Dokumente aus, da die Farbpalette bei ihnen schon im Dokument <a href="color1.html">gespeichert</a> ist.<br>Manche der Farbpaletten in Scribus sind aus bestimmten Gr&uuml;nden angelegt worden. Deshalb sollte man etwas &uuml;ber Farbpaletten lernen, bevor man die Standard-Farbpalette &auml;ndert.<br>Manchmal besteht auch die Druckerei oder der Auftraggeber auf bestimmte Farben.</p>
<blockquote>
<h4><font color="red">Achtung!</font></h4>
<p>In &auml;lteren Versionen der Dokumentation sah es aus, als ob Farben in den Scribus-Farbs&auml;tzen &uuml;berhaupt nicht ge&auml;ndert werden k&ouml;nnen &ndash; das kommt aber ganz darauf an, wo diese gespeichert sind und ob man dort Schreibzugriff hat. Wenn man die Farben bearbeitet, ohne da&szlig; ein Dokument ge&ouml;ffnet ist, und man den Speicherort der Farben angepa&szlig;t hat (z.B. das Home-Verzeichnis des Benutzers), kann man jede Farbe jeder Palette &auml;ndern. Durch einen Klick auf <strong>Ok</strong> wird die Farbpalette f&uuml;r die Zukunft gespeichert. Wenn man die Farbe bei einem ge&ouml;ffneten Dokument &auml;ndert, wird die Farbe nur f&uuml;r dieses Dokument ge&auml;ndert. Trotzdem ist davon abzuraten, da Probleme aufgrund ge&auml;nderter Farben entstehen k&ouml;nnen, z.B. wenn man Teile eines Dokuments in ein anderes importiert.</p>
<p>Schmuckfarben werden durch den Namen definiert. Eine &Auml;nderung der Farbwerte f&uuml;hrt hier zwangsl&auml;ufig zu Fehlern.</p>
</blockquote>
<p>Bei einer Standard-Installation kann man die mitgelieferten Farbpaletten nicht &auml;ndern. Das ist gewollt, da der Sinn standardisierter Farben ist, da&szlig; sie bei allen Dokumenten, auf allen Computern und Plattformen identisch sind. Deshalb werden alle Farbpaletten so installiert, da&szlig; man nur Lesezugriff hat, und sie &raquo;geblockt&laquo; sind.</p>
<p>Nat&uuml;rlich gibt es manchmal Gr&uuml;nde, eine geblockte Palette zu bearbeiten, z.B. wenn man die Anzahl der Farben f&uuml;r ein bestimmtes Projekt reduzieren will. In dem Fall w&auml;hlt man (ohne ge&ouml;ffnetes Dokument) &raquo;Farbpalette speichern&laquo;. Dadurch wird eine Kopie im Home-Verzeichnis des Benutzers gespeichert und erscheint in der Liste der verf&uuml;gbaren Farbpaletten. Diese Palette ist jetzt bearbeitbar. Vorsicht &ndash; jede &Auml;nderung daran ist dauerhaft!</p><br>
<table width="100%"><tr><td align="center"><img src="images/colrs-mgt2.png" title="Speichern einer bearbeitbaren Kopie einer geblockten Farbpalette" alt="Speichern einer bearbeitbaren Kopie einer geblockten Farbpalette" /></td></tr></table><br/>

<h3>Neue Farbpaletten installieren oder importieren</h3>
<p>Wenn man Farbpaletten eines Drittanbieters gekauft oder heruntergeladen und keine Root- / Administratorrechte hat, kopiert man die Dateien in einen bestimmten Ordner im Home-Verzeichnis. Hat man Root- / Administratorrechte kann man sie auch in den Installationsordner kopieren. Beachten Sie bitte die Lizenzbestimmungen, da viele die Anzahl der Nutzer einschr&auml;nken.</p>
<p>Hier die relevanten Verzeichnispfade der unterst&uuml;tzten Betriebssysteme:</p>


<h4>Linux/UNIX</h4>
<p>Wenn man Scribus &uuml;ber einen Paketmanager wie RPM, DEB oder die BSD-Ports installiert hat, m&uuml;ssen die Farbpaletten entweder nach <code>/usr/lib/scribus/swatches</code> oder nach <code>/usr/local/lib/scribus/swatches</code> kopiert werden. Bei 64-Bit-Systemen nach <code>/usr/lib64/scribus/swatches</code> oder <code>/usr/local/lib64/scribus/swatches</code>, sofern man eine 64-Bit-Version installiert hat. Der Ort h&auml;ngt aber von der Konfiguration des Paketmanagers der Distribution ab.</p>
<p>Wenn man Scribus selbst kompiliert hat, mu&szlig; man die Farbpaletten nach <code>installation_directory/share/scribus/swatches</code> kopieren.</p>
<p>Falls man keine Rootrechte hat, kann man die Dateien auch nach <code>/home/user_name/.scribus/swatches/locked</code> kopieren.</p>
<p>Falls der Ordner nicht existiert, mu&szlig; man ihn erstellen.</p>
<h4>Mac&nbsp;OS&nbsp;X</h4>
<p>Bei Mac&nbsp;OS&nbsp;X kopiert man die Paletten in <code>/Library/Preferences/Scribus/swatches/locked</code> des Home-Verzeichnisses.</p>
<p><i>Bei verschiedenen Versionen von Mac&nbsp;OS&nbsp;X ist der</i> /Library<i>-Ordner versteckt. Mit</i> Gehe zu > Gehe zu Ordner<i> im Finder und Eintippen von</i> ~/Library<i> kann man ihn sichtbar machen. Alternativ kann man im Finder auf</i> Gehe zu<i> klicken und dabei die alt-Taste dr&uuml;cken, und im darunterliegenden Men&uuml; erscheint der Ordner Library. Wenn der Ordner dauerhaft sichtbar sein soll, gibt man in einem Terminal</i> chflags nohidden /Users/[username]/Library/<i> ein</i>.</p>
<p>Falls der Ordner <code>locked</code> nicht existiert, mu&szlig; man ihn erstellen.</p>
<h4>OS/2 Warp 4 und eComStation</h4>
<p>Hier kopiert man die Dateien in den Ordner <code>C:\Scribus-{version}\scribus\lib\swatches\locked</code>.</p>
<p>Falls der Ordner <code>locked</code> nicht existiert, mu&szlig; man ihn erstellen.</p>
<h4>Haiku</h4>
<p>Die richtigen Ordner sind <code>/boot/apps/Scribus/share/scribus/swatches</code> oder <code>/boot/home/config/settings/Qt/.scribus/swatches/locked</code>.</p>
<h4>Windows</h4>
<p>Bei Windows kopiert man die Dateien in den Ordner <code>C:\Program Files\Scribus {version}\share\swatches</code>.</p>
<p>Wenn man keine Administratorrechte hat, kann man die Dateien auch in das Nutzerverzeichnis kopieren. Bei Windows 2000, XP und 2003 ist dies <code>C:\Documents and Settings\username\Application Data\Scribus\swatches\locked</code>, und ab Windows Vista <code>C:\Users\username\AppData\Roaming\Scribus\swatches\locked</code>.</p> 
<p>Falls der Ordner <code>locked</code> nicht existiert, mu&szlig; man ihn erstellen.</p>
<br>
<br>
</body>
</html>
