<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Farbpaletten in Scribus (6): Galaxy-Gauge-Farbpaletten</title>
</head>
<body>
<h2>Farbpaletten in Scribus (6): Galaxy-Gauge-Farbpaletten</h2>

<p><a href="http://www.galaxygauge.com/">Galaxy Gauge&trade;</a> hat sich auf professionelle Instrumente f&uuml;r Graphik-Designer spezialisiert, unter anderem auch f&uuml;r wissenschaftliche Ver&ouml;ffentlichungen. Der Sitz ist in Colorado (USA) und die Hauptm&auml;rkte sind Nordamerika, Gro&szlig;britannien, Irland und Ozeanien (Australien und Neuseeland).</p>
<p>Die Galaxy-Farbpaletten in Scribus entsprechen dem Farb&uuml;bereinstimmungs- und Prognosesystem von Galaxy Gauge. Ein vermutlich einzigartiges Merkmal dieses Systems ist die leichte Abstimmung zwischen Designer und Kunde. W&auml;hrend man bei anderen Systemen teure Farbb&uuml;cher, -tafeln oder -karten kaufen mu&szlig;, kann hier der Designer gedruckte Referenzen zu moderaten Preisen kaufen und sie via Email verteilen, so da&szlig; schon bei der Entscheidung &uuml;ber das Design beide Seiten die gedruckten Farben sehen k&ouml;nnen. Dank der Aufnahme des Galaxy-Gauge-Systems in Scribus k&ouml;nnen die Benutzer schnell Entscheidungen aus der analogen Welt in digitale Dokumente &uuml;bertragen.</p>

<h3>In Scribus mitgelieferte Galaxy Gauge&trade;-Farbpaletten</h3>

<p><b>Galaxy Color Map&trade; Pro Main:</b> Diese CMYK-Farben entsprechen der Hauptpalette des <a href="http://www.galaxygauge.com/p_col_cmp.html">Galaxy-Color-Map-Pro</a>-Tools. Durch eine Steigerung um 20% jeder CMYK-Komponente ergibt sich ein gr&ouml;&szlig;erer Farbbereich als bei jeder anderen Galaxy-Farbpalette. Eine Pastell-Palette erh&ouml;ht die Komponenten in Schritten zu 5% und bietet so feine Abstufungen f&uuml;r sanfte CMYK-Farben. Die gedruckte Referenz &raquo;Color Map Pro&laquo; ist f&uuml;r gestrichenes und ungestrichenes Papier erh&auml;ltlich.<br><i>Anzahl der Farben: 1,287</i></p>

<p><b>Galaxy Color Directory:</b> Diese Palette entspricht dem &raquo;Galaxy Color Directory&laquo;, das in Color Map Pro and Color Zil enthalten ist. Sie enth&auml;lt mehr als 70 mit Namen benannten Farben, was bei Kundengespr&auml;chen und bei Projekten, bei denen die Farben eher mit Namen als Prozentwerten bezeichnet werden, n&uuml;tzlich ist.<br><i>Anzahl der Farben: 79</i></p>
<br>
<table width="100%"><tr><td align="center"><img src="images/galaxy_gauge.png" align="center" title="Die Galaxy-Color-Directory-Palette in Scribus" alt="Die Galaxy-Color-Directory-Palette in Scribus"/></td></tr></table>
<br>

<p><b><a href="color7b.html">Galaxy Color Harmonizer&trade;</a>:</b> Diese CMYK-Farben entsprechen dem Galaxy-Color-Harmonizer-Farbrad des Galaxy-Color-Map-Pro-Tools, mit dem man einfach wissenschaftlich designte und Farbraum-kalibrierte ansprechende Farbkombinationen zusammenstellen kann.<br><i>Anzahl der Farben: 167</i></p>

<p><b>Galaxy Neutrals and Rich Blacks:</b> Diese CMYK-Farben entsprechen dem &raquo;Galaxy neutral and rich black color&laquo;-Prognose-Tool.<br><i>Anzahl der Farben: 48</i></p>

<p><b><a href="color7c.html">Galaxy Emotional Color Tool&trade;</a>:</b> Diese CMYK-Farben entsprechen dem Galaxy-Color-Mix-and-Emotions-Tool der Galaxy-Color-Map-Pro- und Color-Zil-Tools. Mit ihnen kann man emotionale Effekte durch spezifische Farb- und Ton-Kombinationen erzielen.<br><i>Anzahl der Farben: 71</i></p>

<p><b>Galaxy Visible Color Spectrum:</b> Dies sind die CMYK-&Auml;quivalente der sichtbaren nat&uuml;rlichen Farben der einzelnen, nicht gemischten Lichtwellenl&auml;ngen. Kombiniert ergeben die Farben Wei&szlig;, mit gezielt gew&auml;hlten Kombinationen alle sichtbaren Farben. Die Farben korrelieren mit den Wellenl&auml;ngen in Nanometer, sie k&ouml;nnen mit Online-Konvertern, Galaxy Color Zil oder dem <a href="http://www.galaxygauge.com/p_sci_sci.html">Specura-Tool</a> in Frequenzen, Energie (in Joule) oder Elektronenvolt umgerechnet werden.<br><i>Anzahl der Farben: 12</i></p>

<p><b>Galaxy Blackbody Spectrum:</b> Wenn ein Objekt erhitzt wird und sich seine Temperatur erh&ouml;ht, wechselt seine Farbe durch das Blackbody-Spektrum. Die Temperatur eines Sterns, erhitzten Metalls oder eines anderen Objekts kann ungef&auml;hr durch seine Farbe im Blackbody-Spektrum festgestellt werden. Die Temperaturen sind in Kelvin, k&ouml;nnen aber in Fahrenheit oder Celsius umgerechnet werden.<br><i>Anzahl der Farben: 16</i></p>

<p><b>Galaxy Pocket Color&trade; Map:</b> Diese Palette entspricht den Farben der <a href="http://www.galaxygauge.com/p_col_sml.html">Galaxy-Pocket-Map</a>.<br><i>Anzahl der Farben: 168</i></p>

<p><b>Galaxy Color Zil&trade; Main:</b> Diese Farbpalette erh&ouml;ht stufenweise jede Farbe des CMYK-Farbmodells um 25%. Es gibt auch eine Pastell-Palette mit Stufen von 10% f&uuml;r sanfte Farben. Die Palette entspricht dem <a href="http://www.galaxygauge.com/p_col_clz.html">Galaxy-Color-Zil</a>-Tool.<br><i>Anzahl der Farben: 625</i></p>

<p>Zus&auml;tzlich zu den professionellen Hilfsmitteln wie gedruckten Farbreferenzen bietet Galaxy Gauge f&uuml;r Scribus-Nutzer einige interessante <a href="http://www.galaxygauge.com/p_etc_fre.html">Gratis-Downloads</a>, darunter einen Farbkalibrierungs-Leitfaden (PDF), Dateien f&uuml;r die <a href="cms2.html">Hardware-Kalibrierung</a> und einen CMYK-Farbbalken (EPS), der als Alternative zum Kalibrierungsbalken in Scribus genutzt werden kann.</p>
<br>
<br>
</body>
</html>