<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Farbpaletten</title>
</head>
<body>
<h3>Farbpaletten</h3>
<h5>In diesem Kapitel geht es um das Bearbeiten und Verwalten von Farb-<a href="WwFill.html">F&uuml;llungen</a>, nicht um das Farbmanagement. Dieses wird in einem <a href="cms.html">eigenen Kapitel</a> beschrieben.</b></i></h5>
<p>In Scribus gibt es verschiedene Methoden, F&uuml;llfarben und Farbpaletten zu erstellen, zu importieren und zu verwalten. Dar&uuml;ber hinaus hat Scribus das <a href="colorwheel.html">Farbkreis-Plugin</a>, mit dem man Farbharmonien erstellen und sogar f&uuml;r Farbenblinde testen kann.</p>
<h3>Wieso Farbpaletten?</h3>
<p>Die Antwort auf diese Frage ist eng verwandt mit der Antwort auf die grunds&auml;tzliche Frage &raquo;Was ist Farbe?&laquo;. Darauf gibt es keine einfache Antwort, da &raquo;Farbe&laquo; auf so viele Weisen beschrieben werden kann. Zum Beispiel als eine Kombination von Wellenl&auml;ngen, eine Kombination von Farbwerten innerhalb eines bestimmten &raquo;Farbmodells&laquo;, als eine Kategorie anhand &auml;sthetischer Regeln usw. Deshalb wurden im Laufe der Zeit viele verschiedene sogenannte &raquo;Farbmodelle&laquo; entwickelt, von denen viele Teil der &raquo;Farblehre&laquo; wurden. Diese ist selbst eine &raquo;Meta-Lehre&laquo;, da sie von vielen Disziplinen beeinflu&szlig;t wird. Darunter Physik, Neurowissenschaft, Biologie, Mathematik, Ingenieurwesen und sogar Kunst, Handwerk und Literatur. &raquo;Farbe&laquo; ist eine der wenigen F&auml;lle, bei denen K&uuml;nstler wie Johann Wolfgang von Goethe oder Albert Henry Munsell einen entscheidenden Beitrag f&uuml;r die Lehre leisteten.</p>
<p>Nutzer von Grafik-Programmen m&uuml;ssen die Einzelheiten der Farblehre nicht lernen, aber gewisse Grundkenntnisse schaden auch nicht. Grunds&auml;tzlich hilft das Verst&auml;ndnis der oben genannten Punkte viel, wenn man mit Farben arbeitet. Der Cartoon zeigt humoristisch, um was es geht:</p>

<table width="100%"><tr><td align="center"><img src="images/colrs-caricature.png" title="Color Names &ndash; Courtesy of http://www.thedoghousediaries.com" alt="Color Names &ndash; Courtesy of http://www.thedoghousediaries.com" /></td></tr></table><br>
<p>Wie oft in guten Cartoons steckt auch hier etwas Wahrheit dahinter. Und zwar, da&szlig; es verschiedene Wahrnehmungen und Einteilungen von Farben gibt, die sehr individuell sind. Man stelle sich zwei Personen vor, die eine im &raquo;M&auml;dchen&laquo;-, die andere im &raquo;Jungs&laquo;-Spektrum, die am Telefon &uuml;ber die Auswahl einer Farbe reden &ndash; es wird einfach unm&ouml;glich sein, da sowohl die Farbnamen als auch die Wahrnehmung (subjektiv) unterschiedlich sind. Deshalb sind vordefinierte Farbpaletten eine M&ouml;glichkeit, &uuml;ber Farben zu <b>kommunizieren</b> ohne subjektive Farbmodelle oder eine philosophische Farblehre zu verwenden. Aussagekr&auml;ftige Namen der Farben k&ouml;nnen dabei die Kommunikation noch erleichtern.</p>
<p>Farbpaletten k&ouml;nnen auch dazu verwendet werden, die Farben f&uuml;r ein einheitliches Erscheinungsbild eines Projekts zu definieren.</p>
<p>In der Praxis bedeutet dies, da&szlig; man nur die Farben einer Farbpalette und die selbst kreierten (und die, die man zu der Palette hinzugef&uuml;gt hat) als Text-, F&uuml;ll- und Linienfarben oder Farbverl&auml;ufe verwenden kann.</p>

<h4>Farben in den Scribus-Farbpaletten</h4>
<p>Scribus kommt von Haus aus mit einer Vielzahl Farbpaletten. Diese Farbpaletten dienen unterschiedlichen Zwecken, die auf <a href="color3.html">verschiedenen Seiten</a> beschrieben werden. Es gibt Paletten in den verschiedensten Gr&ouml;&szlig;en, die von &raquo;Scribus Basic&laquo;, einer Reihe elementarer RGB- und CMYK-Farben, bis zu z.B. &raquo;X11&laquo; gehen, die eine gro&szlig;e Anzahl an (RGB-)Farben enth&auml;lt.</p>
<p>Die Farbpaletten in Scribus k&ouml;nnen vier Farbarten enthalten, die durch verschiedene Symbole gekennzeichnet sind:</p>

<table border="0">
	<col width=2*>
	<col width=2*>
	<col width=auto>
  <tbody>
    <tr valign=top>
      <td><img src="images/rgb.png"></td>
      <td> </td>
      <td><b>RGB-Farben</b>: Diese Farben werden im RGB-Farbmodell definiert. Jede Farbe entsteht durch die Addition der drei Hauptfarben Rot, Gr&uuml;n und Blau.</td>
    </tr>
    <tr valign=top>
      <td><img src="images/cmyk.png" align="top"></td>
      <td></td>
      <td><b>CMYK-Farben</b>: Die Farben des CMYK-Farbmodells beschreiben die vier Tintenfarben im Farbdruck: Cyan, Magenta, Gelb und Schwarz.</td>
    </tr>
    <tr valign=top>
      <td><img src="images/spot.png"></td>
      <td></td>
      <td><b>Schmuckfarben</b>: Eine Schmuckfarbe kann im RGB- oder CMYK-Farbraum angelegt sein, der Unterschied ist, da&szlig; sie in einem PDF oder einer PostScript-Datei mit ihrem <i>Namen</i> gespeichert wird. Der Name verweist auf eine Referenz in der &raquo;realen Welt&laquo;, wie z.B. einem gedruckten Farbrad. Eine Druckerei kann damit eine bestimmte Tinte mischen oder kaufen, die genau den Spezifikationen entspricht. Jede Schmuckfarbe erfordert eine eigene Druckplatte, weshalb man sie sehr vorsichtig einsetzen sollte, da dies die Druckkosten in die H&ouml;he treibt. Ein typischer Einsatzzweck sind Firmenlogos. Der rote Punkt neben dem Farbmodell-Zeichen (RGB oder CMYK) zeigt eine Schmuckfarbe an.</td>
    </tr>
    <tr valign=top>
      <td><img src="images/register.png"></td>
	<td></td>
      <td><b>Registrations-Farbe</b>: Dies ist eine ganz besondere &raquo;Farbe&laquo;, die f&uuml;r Registrierungs-Zeichen genutzt wird. Dadurch k&ouml;nnen Drucker feststellen, ob ein Vierfarb-Druck erfolgreich war. Obwohl sie als CMYK-Farbe angezeigt wird, besteht sie aus so vielen Farben wie es Druckplatten ben&ouml;tigt. Jede Farbpalette kann nur eine Registrations-Farbe haben. Sie wird durch ein &raquo;Fadenkreuz&laquo;-Zeichen angezeigt.</td>
      <td></td>
    </tr>
    <tr valign=top>
      <td><img src="images/alert.png"></td>
	<td></td>
      <td>Wenn man mit aktiviertem <a href="cms.html">Farbmanagement</a> arbeitet, sind wahrscheinlich einige oder sogar alle Farben au&szlig;erhalb des Fabspektrums. Zum Beispiel kann aufgrund des gew&auml;hlten ICC-Profils eine Farbe nicht von einem Farbmodell in ein anderes &raquo;&uuml;bersetzt&laquo; werden, und es kann zu Farbver&auml;nderungen kommen. In dem Fall sieht man eine Warnung neben der Farbe.</td>
      <td></td>
    </tr>
  </tbody>
</table>

</body>
</html>
