<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
  
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>Links in PDF-Dateien</title>

  
</head><body>
<h2>Links in PDF-Dateien</h2>
<h3>und Anmerkungen</h3>
<p>In diesem Kapitel geht es darum, wie man anklickbare Links in PDF-Dateien erstellt, die zu einer anderen Stelle im Dokument verlinken, zu einem anderen PDF oder auch in das Internet. Hier geht es nicht darum, <strong>Textrahmen zu verlinken</strong>, dies wird unter <strong><a href="WwText.html">Textrahmen</a></strong> beschrieben.
</p>
<p>Der einfachste Weg, ein Verkn&uuml;pfungsfeld zu erstellen (und genau das wird hier gemacht), ist, in der Toolbar auf <i>Link einf&uuml;gen</i> zu klicken (vorausgesetzt die <strong>PDF-Tools</strong> sind aktiviert &ndash; mit einem Rechtsklick auf die Toolbar sieht man, welche Elemente angezeigt werden). Das Icon sieht aus wie zwei Schuhabdr&uuml;cke.
</p>
<p><img src="../en/images/pdftools.png"/></p>
<p>Jetzt kann man ein Rahmen-&auml;hnliches Feld erstellen. Es &auml;hnelt einem Textrahmen, und man kann sogar wie bei einem Textrahmen einen Text eingeben. Daf&uuml;r mag es Gr&uuml;nde geben, um z.B. eine Referenz in Scribus zu haben, aber es wird keine der Rahmen-Eigenschaften sp&auml;ter im PDF sichtbar sein! Das betrifft nicht nur den Text, sondern auch s&auml;mtliche F&uuml;ll- oder Linienfarben. Man kann also in Scribus einen halbtransparenten Hintergrund machen, um zu sehen, wo das Link-Feld ist, dieser wird aber im PDF nicht sichtbar sein.
</p>
<p>Tats&auml;chlich sieht man z.B. im Adobe Reader nur, da&szlig; sich der Mauszeiger ver&auml;ndert, wenn man &uuml;ber ein klickbares Feld f&auml;hrt &ndash; normalerweise eine Hand mit ausgestrecktem Zeigefinger. Dies kann leicht &uuml;bersehen werden, so da&szlig; man gerne noch einen weiteren Hinweis h&auml;tte, der anzeigt, wo ein Link ist. Und vielleicht noch, wohin er f&uuml;hrt. Dies kann alles sein, was man in einem Textfeld machen kann, z.B. ein Unterstrich oder eine andere Farbe. <i>Zu erw&auml;hnen ist, da&szlig; das Link-Feld ein Rechteck bleibt, selbst wenn man die Form ver&auml;ndert. Es gibt also keinen Grund, dies zu tun.</i>
</p>
<h4>Anmerkungen</h4>
<table cellpadding="5" width="80%">
<tr><td><img src="images/annotation.png"/></td>
<td><p>Links sieht man den Dialog, wenn man den Rahmen rechtsklickt und <i>PDF-Optionen > Eigenschaften der Anmerkung</i> w&auml;hlt.</p>
<p>Ganz oben im Dropdown-Men&uuml; sieht man <strong>Text</strong>. Damit erstellt man eine Popup-Anmerkung, die erscheint, wenn man im PDF mit der Maus &uuml;ber das Feld f&auml;hrt &ndash; ein Doppelklick in das Feld l&auml;&szlig;t die Anmerkung dauerhaft erscheinen. Im PDF-Programm sieht man dann ein Symbol, das auf die Anmerkung hinweist.</p>
</tr>
</table>
<blockquote>Man kann auch erst einen Textrahmen einf&uuml;gen und diesen mit <i>PDF-Optionen > Als PDF-Anmerkung verwenden</i> zu einer Anmerkung machen und dann mit einem Rechtsklick wieder <i>PDF-Optionen > Eigenschaften der Anmerkung</i> aufrufen. Auch bei dieser M&ouml;glichkeit sind im PDF kein Inhalt oder sonstige Rahmeneigenschaften au&szlig;er einer Popup-Anmerkung zu sehen.</blockquote>
<h4>Verkn&uuml;pfung</h4>
<table cellpadding="5" width="80%">
<tr><td><img src="images/link.png"/></td>
<td><p>W&auml;hlt man <strong>Verkn&uuml;pfung</strong>, kann man einen einzelnen Punkt auf einer bestimmten Seite als Ziel angeben. Wie hier gezeigt, sieht man eine Vorschau der Seite, um den Punkt genau festzulegen.</p>
<p>Versuche haben ergeben, da&szlig; man z.B. bei einem Bild am besten einen Punkt knapp links oberhalb angibt, wenn man nach dem Verweis das ganze Bild sehen soll. Das ist nat&uuml;rlich vernachl&auml;ssigbar, wenn die ganze Seite auf dem Monitor angezeigt wird.</p>
</tr>
</table>
<h4>Externe Verkn&uuml;pfung</h4>
<table cellpadding="5" width="80%">
<tr><td><img src="images/externallink.png"/></td>
<td><p>Bei einer <strong>Externen Verkn&uuml;pfung</strong> mu&szlig; man erst ein PDF w&auml;hlen, zu dem verwiesen wird.</p>
<p>Danach kann man wie bei einer Verkn&uuml;pfung einen Punkt auf einer bestimmten Seite angeben. Auch hier bekommt man eine kleine Vorschau, um das Linkziel festzulegen.</p>

</tr>
</table>
<h4>External Web-Link</h4>
<table cellpadding="5" width="80%">
<tr><td><img src="images/externalweblink.png"/></td>
<td><p>W&auml;hlt man <strong>Externe Webverkn&uuml;pfung</strong>, erscheint ein Textfeld, in das man die URL eintragen kann.</p>
<p>Bei z.B. dem Adobe Reader und Evince ist es im Gegensatz zu Okular nicht n&ouml;tig, <strong><i>http://</i></strong> anzugeben. Grunds&auml;tzlich ist es daher ratsam, die ganze URL einzugeben.</p>
<p>Verlinkt man zu einer Datei (z.B. einer PDF) auf einer Webseite, gibt es nicht die M&ouml;glichkeit, eine bestimmte Seite zu bestimmen.</p>
<p>Hier ist es auch m&ouml;glich, einen <strong><i>mailto:</i></strong>-Link einzuf&uuml;gen, der beim Klick eine neue Mail mit der im <strong>To:</strong>-Feld angegebenen Mailadresse im Mailprogramm &ouml;ffnet.
</tr>
</table>
</body></html>
