<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Scribus-Downloads</title>
</head>
<body>
<h3>Scribus-Downloads</h3>

<hr />

<h4>Bezugsquellen f&#252;r Scribus 1.3.x:</h4>

<p>Windows 2000/XP:<a> <a href="http://windows.scribus.net">http://windows.scribus.net</a></a>
</p>
<p>MacOSX: <a href="http://aqua.scribus.net">http://aqua.scribus.net</a></p>

<p>Debian- und Ubuntu-Pakete: </b><a href="http://debian.scribus.net">apt-get setup</a> Beachten Sie, da&#223; wir in unseren Repositorien derzeit keine 64-Bit-Ubuntu-Pakete zur Verf&#252;gung stellen.</p>

<p>Sie k&#246;nnen Tar-Archive mit den Quellen und Dokumentvorlagen sowie einige RPM-Dateien von unserer
<a href="http://sourceforge.net/project/showfiles.php?group_id=125235">Sourceforge-Downloadseite</a> herunterladen.</p>

<h4>RPM-Distributionen:</h4>
<p>Dank des <a href="http://en.opensuse.org/Build_Service">Open Suse Build Service</a> freuen wir uns, Ihnen ein <a href="http://download.opensuse.org/repositories/home:/mrdocs/">Scribus-RPM-Repositorium</a> anbieten zu k&#246;nnen. Es enth&#228;lt 32-Bit- und 64-Bit-RPM-Pakete der stabilen Reihe 1.3.3.x und f&#252;r eher Abenteuerlustige 1.3.x-Entwicklerversionen von Scribus. Die RPM-Pakete werden st&#228;ndig aktualisiert, und zwar mit SVN-Schnappsch&#252;ssen f&#252;r Fedora 5&ndash;7, Mandrake 2007 und SUSE 10 oder h&#246;her, einschlie&#223;lich SLED (Suse Enterprise Desktop 10).  Die einzige Einschr&#228;nkung, die wir momentan machen m&#252;ssen, ist, da&#223; wir keine Entwicklerversionen f&#252;r alle Distributionen ausliefern k&#246;nnen, weil sie nicht die neuesten Bibliotheken bereitstellen, die unsere Entwicklerversion ben&#246;tigt, um zu funktionieren.
<br />Sie k&#246;nnen unsere Repositorien ohne Probleme mit YAST, Yum oder Smart verwenden, denn sie enthalten RPM-Metadaten. Wir verwenden diesen Build-Server auch f&#252;r regul&#228;re Ver&#246;ffentlichungen. Was stabile Versionen angeht, wurden die 1.3.3.x-Pakete ausreichend getestet, und sie unterscheiden sich nicht wesentlich von den Paketen, die die jeweiligen Distributionen ausliefern. Falls Sie irgendwelche Probleme mit den RPM-Paketen haben, stellen Sie bitte eine Fehlermeldung im Scribus-Bugtracker ein: http://bugs.scribus.net. </p>
<p>Zus&#228;tzlich finden Sie einige Pakete in dem genannten Repositorium, die im Zusammenhang mit Scribus von Bedeutung sind, darunter etwa GSview, ICC-Profile und einige andere n&#252;tzliche Werkzeuge.</p>

<!--<li><b>Extra Document Templates</b> - http://www.scribus.org.uk/downloads/1.2.2/scribus-temp-all-1.2.2.tar.bz2</li>
<!--<li><b>Translation source files</b> (not needed for Scribus usage) - http://www.scribus.org.uk/downloads/1.2.2/scribus-po-files.tar.bz2</li>-->
Zum Herunterladen von aktuellen Quelltexten aus SVN lesen Sie bitte die  <a href="install1.html">SVN-Anweisungen</a>.

</body>
</html>