<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Voreinstellungen und Verwaltung von Schriftarten mit Scribus</title>
</head>
<body>
<h2>Voreinstellungen und Verwaltung von Schriftarten mit Scribus</h2>

<h3>&Uuml;berblick</h3>

<p>Scribus verf&uuml;gt &uuml;ber einige sehr praktische Panel-Register, mit denen sich die zu benutzenden Schriftarten unkompliziert verwalten lassen. Au&szlig;erdem k&ouml;nnen Sie die Global-Einstellungen f&uuml;r Schriftarten und Schriftarten-Ersetzungen, die f&uuml;r Scribus gelten sollen, leicht selbst vorgeben. Mit den neuen, eigenen Voreinstellungen k&ouml;nnen Sie:</p>

<ul>
	<li>zus&auml;tzliche benutzerdefinierte Pfade f&uuml;r Schriftarten setzen, die weder root-Rechte ben&ouml;tigen noch eine manuelle Anpassung der XF86Free-Konfiguration erfordern.</li>
	<li>selbst festlegen, welche Schriftarten verwendet und wie diese in Ihre Scribus-Dokumente eingebettet werden.</li>
	<li>vorbestimmen, wie fehlende oder nicht verf&uuml;gbare Schriftarten (im fliegenden Wechsel) durch andere ersetzt werden.</li>
</ul>

<p>Auf den ersten Blick mag es etwas verwirren, da&szlig; einige Optionen zun&auml;chst nicht anw&auml;hlbar sind. Dahinter steht jedoch eine gewisse Logik, wie wir sehen werden. Seit je her besteht eine der H&uuml;rden der Schriftarten-Verwaltung mit Xfree86 darin, da&szlig; manche Anwendungen einfach ihr Schriftarten-Verzeichnis an den von Xfree86 erstellten Standardpfad anh&auml;ngen. Das neuere Funktionsprinzip von fontconfig und Freetype2 haben das ge&auml;ndert und endlich eine L&ouml;sung f&uuml;r eines der &auml;ltesten Probleme gebracht, das der Endbenutzer mit Linux als Desktop-System bislang hatte.</p>


<h3>Schriftarten-Verzeichnisse zum Pfad hinzuf&uuml;gen:</h3>

<p>Starten Sie Scribus, <strong>ohne</strong>  ein Dokument zu &ouml;ffnen. Dann klicken Sie auf <strong>Bearbeiten &gt; Einstellungen &gt; Schriftarten</strong>, und es erscheint ein Register-Panel. W&auml;hlen Sie die Registerkarte &quot;Zus&auml;tzliche Pfade&quot;:</p>

<table width="100%"><tr><td align="center"><img src="../en/images/fontpref1.png" alt="Adding additional font paths." title="Adding additional font paths."/></td></tr></table>

<p>Hier k&ouml;nnen Sie Schriftarten-Pfade hinzuf&uuml;gen, die nicht zu den Standardpfaden von XFree86 oder X-org geh&ouml;ren. Im folgenden Beispiel sehen Sie drei benutzerdefinierte Pfade zu Schriftarten, die wir in Scribus benutzen wollen. Das Verzeichnis <code>.fonts</code> ist das Standardverzeichnis f&uuml;r das neue <a href="fontconfig.html">fontconfig</a>, das zusammen mit Xft2 Bestandteil neuerer Distributionen ist. Klicken Sie auf  <strong>OK</strong>, und Scribus f&uuml;gt diese Schriftarten-Pfade hinzu, so da&szlig; alle korrekt installierten Schriften sogleich in neuen oder vorhandenen Dokumenten eingesetzt werden k&ouml;nnen.</p>

<h3>Schriftarten-Ersetzung</h3>

<p>Wenn Scribus ein neues Dokument &ouml;ffnet, &uuml;berpr&uuml;ft das Programm, ob alle im Dokument benutzten Schriftarten vorhanden sind. Ist das nicht der Fall, bekommen Sie gleich beim &Ouml;ffnen des Dokuments die M&ouml;glichkeit, eine Ersetzung vorzunehmen. Au&szlig;erdem k&ouml;nnen Sie diese Zuweisung auf der Registerkarte <strong>Font-Ersetzungen</strong> einstellen. Auf diese Weise k&ouml;nnen Sie das voreingestellte Ersetzungsprofil &auml;ndern. Im vorliegenden Beispiel ersetzen wir die Schriftart &quot;Timmons Bold&quot; (zu StarOffice 5.2 geh&ouml;rig) durch eine TrueType-Version von &quot;Times New Roman&quot;.</p>

<table width="100%"><tr><td align="center"><img src="../en/images/fontpref2.png" alt="Font Substitutions" title="Font Substitutions" /></td></tr></table>

<h4>Verf&uuml;gbare Schriftarten</h4>

<p>Diese Registerkarte listet die auf Ihrem System verf&uuml;gbaren Schriftarten, gegebenenfalls mit benutzerdefinierten Pfadangaben. Hier k&ouml;nnen Sie auch einstellen, welche einzelne Schriftart jeweils von Scribus verwendet bzw. welche Schriftarten in PostScript-Dateien eingebettet werden sollen.	</p>

<table width="100%"><tr><td align="center"><img src="../en/images/fontpref3.png" alt="Available Fonts and Embedding Preferences" title="Available Fonts and Embedding Preferences"/></td></tr></table>

<p>Im diesem Beispiel wurde die Schriftart Nimbus Roman (eine &quot;Times Roman&quot;-Nachbildung) deaktiviert, weil sie auf anderen Plattformen gelegentlich Anzeigeprobleme bereitet; zumal der Acrobat Reader ohnehin die eigenen Multi-Master-Fonts als Ersetzung benutzt.</p>

<h3>Weitere Anmerkungen zur Schriftarten-Verwaltung:</h3>
<ul>
	<li><strong>Subset</strong> zu aktivieren bedeutet, da&szlig; alle Zeichen, die eine Schriftart umfa&szlig;t, in den PostScript-Datenstrom oder ein PDF-Dokument eingebunden werden. Dies erm&ouml;glicht zwar kleinere PDF-Dateien, macht aber selbst kleinere &Auml;nderungen mit Druckvorstufen-Tools wie PitStop schwierig. Sofern die PDF-Dateien nicht f&uuml;r Ihre Druckerei bestimmt sind, k&ouml;nnen Sie die Subset-Option getrost aktivieren. Dies ist bedeutsam, wenn Sie die Gr&ouml;&szlig;e einer PDF-Datei zum Herunterladen m&ouml;glichst klein halten m&ouml;chten.</li>
	<li><strong>OpenType-Schriftarten</strong> lassen sich standardm&auml;&szlig;ig nicht komplett einbetten, wodurch andere Anwendungen weitgehend leichter mit ihnen umgehen k&ouml;nnen. OpenType- und Unicode-TrueType-Schriftarten k&ouml;nnen sehr gro&szlig; werden. Daher werden Sie als Umri&szlig;schriften in  PDF-Dokumente exportiert. Dort, im PDF-Format, k&ouml;nnen diese genutzt werden, w&auml;hrend andere Anwendungen h&auml;ufig passen m&uuml;ssen.</li>
	<li><strong>In Umrisse konvertieren.</strong> Scribus kann wahlweise Text in PostScript-Umrisse umwandeln. M&ouml;glicherweise brauchen Sie diese Option, wenn der Rasterbildprozessor (RIP) oder Belichter Ihrer Druckerei noch kein PDF 1.4 akzeptiert. Manchmal ist sie auch eine gute Wahl, bevor Sie SVG- oder EPS-Dateien exportieren. Wenn Sie wissen, da&szlig; EPS-Dateien f&uuml;r andere Programme oder Plattformen bestimmt sind, dann sollten Sie diese Option aktivieren.</li>
</ul>
</body>
</html>
