<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Schriftarten im Detail</title>
</head>
<body>
<h2>Schriftarten im Detail</h2>

<p>Wenn beim DTP Schwierigkeiten auftauchen, geht es nicht selten um Schriftarten. Nach meiner Erfahrung z&auml;hlen Sie zu den Hauptproblemen des DTP &uuml;berhaupt, und sie sorgen via Mailing-Liste und IRC-Channel best&auml;ndig f&uuml;r Fragen. Grob gesch&auml;tzt zielen 50% der schriftartspezifischen Fehlerberichte auf Probleme mit den Schriftarten selbst.</p>

<p>Scribus benutzt zur Schriftartgestaltung die Freetype2-Bibliotheken. Schon w&auml;hrend des Ladens f&uuml;hrt Scribus eine Fehlerpr&uuml;fung durch, um die Qualit&auml;t der Schriftarten zu testen. Nicht alle Schriftarten sind uneingeschr&auml;nkt f&uuml;r DTP geeignet. Doch weshalb?</p>

<p>Um eine gute Ausgabequalit&auml;t zu erzielen, sind hochwertige Schriftarten n&ouml;tig - ganz egal auf welcher Plattform. Auch wenn Sie mich als Wichtigtuer betrachten, ich werde <b>niemals</b> eine Schriftart verwenden, die es als Shareware zum kostenlosen Download gibt. Hier sind die Schriftarten, die ich benutze und denen ich vertraue (unsortiert):</p>

<ul>
	<li>Die neuesten Ghostscript-Fonts. Auf der Internet-Seite von Artifex k&ouml;nnen Sie diese Schriftarten als TrueType-Variante herunterladen. Mit dieser Alternative erhalten Sie auch einige zus&auml;tzliche Schriftarten, die gut f&uuml;r DTP geeignet sind.  </li>
	<li>Jede der Adobe- oder Bitstream-Schriftarten von Xfree86 oder X.org: darunter Charter, Luxi und Utopia als ganz hervorragende Schriftarten. Die PDF-Version dieser Dokumentation verwendet &uuml;brigens Utopia f&uuml;r den Haupttextk&ouml;rper.</li>
	<li>Jede der Lucida-Schriftarten, die im Java-Paket von SUN enthalten sind.</li>
	<li>Microsoft Web-Fonts - ausgenommen Wingdings, das beim DTP nicht nur Scribus Probleme bereiten kann (abgestellt in Version 1.2.2).</li>
	<li>Die Schriftfamilie Lido CE ist eine Alternative zu Times Roman und sehr gut gemacht, von einer hochangesehenen Design-Schmiede.</li>
	<li>Gentium - ein guter Ansatz, eine frei verf&uuml;gbare Unicode-Schriftart zu entwickeln, die fast alle lateinischen Schriften unterst&uuml;tzt.</li>
	<li>Die Schriftfamilie Bitstream Vera - Diese wurde der Gnome-Stiftung &uuml;berlassen und ist in den meisten Distributionen enthalten. Vera Serif ist dabei eine echte Rarit&auml;t, eine Serifenschrift n&auml;mlich, die auf dem Bildschirm besonders gut zu lesen ist. </li>
	<li>Jede der Bitstream-Schriftarten, die in Corel Draw enthalten sind. Einige meiner Kunden setzen diese Schriftarten seit Jahren in der professionellen Druckvorstufe ein, ohne je ein Problem gehabt zu haben.</li>
	<li>Alle Schriftarten von Adobe. Sie z&auml;hlen zu den besten, und wer sie hat, findet die neuen OpenType-Fonts grandios. Dabei ist Scribus eine der ganz wenigen Anwendungen, die OpenType gut unterst&uuml;tzt, einschlie&szlig;lich der problemlosen PDF-Einbindung mit einwandfreiem Druckergebnis.</li>
	<li>Jede der Schriftarten, die in StarOffice 6.0+ enthalten sind. Diese ersetzen teilweise die Standard-Schriften von Windows und enthalten noch weitere Schriftarten. Sie alle sind von Agfa Monotype lizensiert und normalerweise problemlos in Scribus einsetzbar.</li>
</ul>
<p>Links zum Herunterladen der oben genannten Schriftarten finden Sie auf der Website von Scribus. </p>

<p>Einige Distributionen beinhalten freie oder Shareware-Schriftarten mit den unterschiedlichsten Bezeichnungen. Ich verzichte darauf und habe sie aus einigen Installationen gel&ouml;scht, ohne sie zu vermissen. </p>

<p>Seien Sie nicht &uuml;berrascht, wenn TrueType-Schriftarten, die Sie als Shareware oder Klonkopie irgendwo heruntergeladen haben, zu einem entt&auml;uschenden Druckergebnis f&uuml;hren.  TrueType-Schriftarten aus Shareware-Quellen setzen die Codierspezifikationen manchmal nicht ordnungsgem&auml;&szlig; um, so da&szlig; sie in einer PostScript-Umgebung problematisch sind. Um gute und vor allem postscriptf&auml;hige Schriftarten zu erhalten, sind intensive Testreihen zu durchlaufen. Ein Beispiel: Verdana (aus der MS WebFont-Kollektion) wurde erst nach Ablauf eines ganzen Jahres fertiggestellt.</p>

<p>Lassen Sie sich auch nicht t&auml;uschen, wenn die URW-Schriftarten bei der Bildschirmvorschau mangelhaft wirken - es sind ausgezeichnete Druckerschriftarten! Palladio oder Utopia beispielsweise sehen auf dem Bildschirm nicht wirklich gut aus, sind jedoch exzellente Schriftarten, wenn Gedrucktes leicht und gut lesbar sein soll. Es hat also durchaus seinen Grund, weshalb Serviceunternehmen und Druckereien buchst&auml;blich tausende Euro f&uuml;r hochwertige Schriftart-Kollektionen ausgeben. </p>

<p>Was die Installation betrifft: Wenn Sie das Verzeichnis <code>$home/.fonts</code> f&uuml;r zus&auml;tzliche Schriftarten verwenden, sollte Scribus diese problemlos finden. F&uuml;r all jene, die sich beim Installieren noch mit irgendwelchen Kommandozeilentools herumschlagen, gibt es ab KDE 3.2 eine verbesserte Version von Keith Drummonds KFontInstaller. Ab KDE 3.3 funktioniert KFontInstaller fast perfekt, und es gibt sogar eine Font-Vorschau im Konqueror. Ich halte dieses Programm f&uuml;r eines der besten und benutzerfreundlichsten, die es gibt - auf jeglicher Plattform. Empfehlenswert! </p>

<p>Scribus macht es einfach, zus&auml;tzliche Schriftarten-Pfade einzurichten. Schlie&szlig;en Sie einfach alle Dokumente, und w&auml;hlen Sie Einstellungen -&gt; Schriftarten -&gt; Zus&auml;tzliche Pfade. W&auml;hlen Sie den neuen Pfad, und klicken Sie auf OK. Falls die Schriftarten dann noch nicht angezeigt werden, m&uuml;ssen Sie diese eventuell der Datei <code>$home/.fonts.conf</code> hinzuf&uuml;gen (oder je nach Distribution anders vorgehen). Wenn einige dann immer noch nicht erscheinen, hat vermutlich Scribus&apos; Font-&Uuml;berpr&uuml;fungsroutine diese Schriftarten deaktiviert. Einige Tipps zu grundlegenden Tests finden Sie unter: <a href="fonts4.html">Schriftarten im Vergleich</a> </p>
</body>
</html>
