<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>

		<title>Schriftarten im Vergleich - Teil 2</title>
</head>
<body>
	<h2>Schriftarten im Vergleich - Teil 2</h2>
	
<h4>Ein zweiter Qualit&auml;tstest f&uuml;r Schriftarten.</h4>
<p>Bestandteil von Scribus ist ein sehr sch&ouml;nes und zugleich wirksames Beispiel, das zeigt, was sich mit dem Python-Scripter in Scribus anstellen l&auml;&szlig;t. Das Skript namens &quot;Font Sampler&quot;, geschrieben von Steve Callcott, ist ein Hilfsmittel zum Erzeugen eines nett gemachten Kataloges mit all Ihren Schriftarten, den Sie auch ausdrucken und heften k&ouml;nnen - oder einfach als PDF-Datei zum Nachschlagen verwenden. So lassen sich auch gelegentlich, und zwar relativ leicht, besch&auml;digte Schriftarten oder solche entdecken, denen wichtige Zeichenelemente fehlen und die beim Druck problematisch werden k&ouml;nnten, was besonders f&uuml;r hochqualitative bzw. gesch&auml;ftliche Drucksachen von Belang ist.</p>

<div align="center"><img src="../en/images/fontsampler.png" alt="Font Sampler with all fonts selected" width="702" height="549" hspace="15" vspace="15" align="middle" border="0" title="Font Sampler with all fonts selected" /></div>
<p>Was Sie f&uuml;r den Einsatz dieses Scripter-Moduls ben&ouml;tigen:
<ul>
<li>Tkinter - versieht Python-Skripte mit einer grafischen Benutzeroberfl&auml;che.</li>
<li>(Wahlweise) Python-Imaging, bestehend aus mehreren Python-Bibliotheken zur Bildverarbeitung und f&uuml;r die nette Vorschau oben verantwortlich.</li>
<li>und nat&uuml;rlich die Scribus-seitige Unterst&uuml;tzung von Python.</li>
</ul>
</p>
<p>Das Starten des Moduls ist kinderleicht:</p>
<center><img src="../en/images/Scripter.png" alt="Launching the Font Sampler" width="380" height="185" hspace="15" vspace="15" align="middle" border="0" title="Launching the Font Sampler" /></center>
<p>Nun, je nach Anzahl Ihrer Schriftarten, Schriftartentypen und Arbeitsgeschwindigkeit bzw. -speicher Ihres Rechners, dauert es u.U einige Zeit, bis das Skript l&auml;uft. 700 oder mehr Schriftarten ben&ouml;tigen auf einem Pentium 4 leicht einige Minuten. Vergessen Sie dabei nicht, da&szlig; die Skripte nicht nur s&auml;mtliche Schriftarten durchk&auml;mmen, sondern wie von Geisterhand Seiten hinzuf&uuml;gen und  selbst&auml;ndig gestalten. Falls Ihnen dabei der Speicher knapp wird, weil Sie sehr viele Schriftarten haben (in einer Gr&ouml;&szlig;enordnung von mehr als 1000), dann sollten Sie die Arbeit besser in Untermengen aufteilen.</p>

<h4>Ergebnisse: </h4>

<center><img src="../en/images/fontsampler2.png" alt="Scripter output showing broken font" width="893" height="534" hspace="15" vspace="15" align="middle" border="0" title="Scripter output showing broken font" /></center>

<p>Betrachten Sie die Darstellungen links und rechts. Auf der linken Seite sehen Sie eine namhafte Type1-Schriftart von hoher Qualit&auml;t. Auf der rechten Seite ist eine Freeware-Schriftart aus einem Fehlerbericht dargestellt. Wenn - wie oben - einige Zeichenelemente fehlen, deutet das nicht immer auf eine eine besch&auml;digte Schriftart hin. Einige spezielle Schriftarten wie Symbolschriften, Dingbats und manche nicht-lateinische Schriftarten bringen u.U. ein sehr &auml;hnliches Resultat, doch sind solche Ergebnisse eher bei einer normalen Schriftart ein Hinweis auf m&ouml;gliche Schwierigkeiten.</p>


<h4>Ein Blick in die Konsole</h4>
<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>Font /usr/X11R6/lib/X11/fonts/URW/p052023l.pfb is broken, discarding it
Font /usr/X11R6/lib/X11/fonts/URW/p052023l.pfb is broken, discarding it
Font /usr/X11R6/lib/X11/fonts/URW/p052023l.pfb is broken, discarding it....
</pre>
</td></tr></table></blockquote>
Wenn die Konsole ge&ouml;ffnet ist, zeigt Scribus dort die Schriftarten an, die beim Laden ausfallen, und dann wiederum jene, denen bei Benutzung bestimmte Zeichenelemente fehlen oder die besch&auml;digt sind. Die selbe Schriftart erscheint u.U. mehrere Male, w&auml;hrend Scribus mittels Freetype nach vorhandenen Zeichenelementen sucht. <strong>Dies ist eine gute Sache&trade;</strong> Fehlerhafte Schriftarten bringen Scribus zum Absturz oder verursachen beim Export oder Druck andere b&ouml;se &Uuml;berraschungen.
</body>
</html>
