<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Hinweise zur Silbentrennung</title>
</head>
<body>
<h2>Hinweise zur Silbentrennung</h2>
<h3>Einleitung</h3>
<p>Diese Funktion bereichert die Textformatierung unter Scribus um eine intelligente Steuerung der Silbentrennung. Basierend auf den Regelcodes von Tex und OpenOffice.org verf&uuml;gt sie &uuml;ber einen erprobten Algorithmus zur Trennung von Silben in W&ouml;rtern.</p>

<h3>Verwendung</h3>
<p>Silbentrennung. Markieren Sie einen Textrahmen, richten Sie den Text nach Ihren W&uuml;nschen aus, und klicken Sie in der Men&uuml;leiste auf Extras &gt; Silbentrennung. Automatisch bedeutet genau das, was es meint: Aktivieren Sie die &quot;Silbentrennung&quot; aus dem Men&uuml;, und sie wird &auml;hnlich einer Absatzvorlage auf den gew&auml;hlten Textrahmen angewandt. Bei jeder &Auml;nderung der Schriftart, Schriftgr&ouml;&szlig;e oder des Kernings wird der Text automatisch neu gesetzt und die Silben neu getrennt.</p>

<table width="100%"><tr><td align="center"><img src="../en/images/hyphen1.png" align="center" alt="Hyphenator Settings Dialog" /></td></tr></table>

<p>In den meisten F&auml;llen k&ouml;nnen Sie die Silbentrennung bei der Voreinstellung belassen: automatisch. Alternativ w&auml;hlen Sie einen Textrahmen und aktivieren die Silbentrennung per Men&uuml;. Sie k&ouml;nnen Scribus auch veranlassen, die Silbentrennung direkt durchzuf&uuml;hren, w&auml;hrend Sie schreiben.</p>

<table width="100%"><tr><td align="center"><img src="../en/images/hyphen2.png" align="center" alt="Possible Hyphenation Dialog" title="Possible Hyphenation Dialog" /></td></tr></table>

<p>Ist die Silbentrennung auf &quot;manuell&quot; eingestellt, k&ouml;nnen Sie &uuml;ber die Trennungsvorschl&auml;ge f&uuml;r jedes Wort selbst entscheiden, wie das folgende Beispiel zeigt.</p>

<table width="100%"><tr><td align="center"><img src="../en/images/hyphen3.png" align="center" alt="Possible Hyphenation Dialog" title="Possible Hyphenation Dialog" /></td></tr></table>

<p>Zur Dokumentation geh&ouml;rt eine Beispieldatei namens <code>hyphen.scd.gz</code>, in der  unterschiedliche Layout-M&ouml;glichkeiten f&uuml;r Textspalten kurz und &uuml;bersichtlich dargestellt sind.</p>

<p>Das beste Erscheinungsbild erzielen Sie wahrscheinlich, wenn Sie den Text als <strong>Blocksatz</strong> formatieren.</p>

<p>Gegenw&auml;rtig ist die Silbentrennung f&uuml;r folgende Sprachen verf&uuml;gbar: Katalanisch, Tschechisch, D&auml;nisch, Englisch, Finnisch, Franz&ouml;sisch, Deutsch, Griechisch, Irisch (G&auml;lisch), Italienisch, Ungarisch, Litauisch, Polnisch, Portugiesisch, Russisch, Slovakisch, Slowenisch, Spanisch, Schwedisch und Ukrainisch.</p>
</body>
</html>
