<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Import mit Scribus - Tricks f&uuml;r Fortgeschrittene</title>
</head>
<body>
<h2>Import mit Scribus - Tricks f&uuml;r Fortgeschrittene</h2>
<p>Wie schon auf der vorherigen Seite gesagt, ist es eine der schwierigeren Aufgaben beim DTP, etwas in das eigene Layout <em>hinein</em>zubekommen. Im folgenden finden Sie einige Tips, die ich bei der Arbeit mit dem neuen SVG-Importer entwickelt habe. F&uuml;r mich ist der SVG-Import aus verschiedenen Gr&uuml;nden vorteilhaft: Er l&auml;&szlig;t sich mit Scribus bearbeiten und kann auch farblich sehr leicht modifiziert werden. Er ist kompakt, und die erzeugten PDF-Dateien sind ebenfalls klein. Importierte SVG-Dateien lassen sich einwandfrei drucken.</p>
<p>Hintergrund: Ich hatte mich bereit erkl&auml;rt, vor einer Gruppe hiesiger Fachleute, die zumeist aus MS-orientierten Web-Entwicklern bestand, eine Pr&auml;sentation vorzuf&uuml;hren. Mein Thema war PDF und das Web. Mein Ziel war es, aufzuzeigen, an welchen Stellen sich PDF-Dateien in den Web-Inhalt integrieren lassen. Ich war entschlossen, Scribus herauszustellen und diesen Leuten zu demonstrieren, wie m&auml;chtig Entwicklerwerkzeuge auf der Basis freier Software sein k&ouml;nnen &ndash; und dies in Form einer PDF-&quot;Pr&auml;sentation&quot;.</p>
<p>Sogleich stellten sich einige Schwierigkeiten ein:</p>
<ol>
	<li>Die Vorf&uuml;hrung sollte auf einem tollen Sharp-Pr&auml;sentationsbildschirm stattfinden, also kam es auf Qualit&auml;t an.</li>
	<li>Ich hatte viele verschiedene Dateien, die alle mit in die Pr&auml;sentation hinein sollten.</li>
</ol>
<p>Problem: Das Scribus-Logo mu&szlig;te ins SVG-Format, denn ich wollte beide Logos (das von Scribus und das der Gruppe) als SVG haben, um diese stark vergr&ouml;&szlig;ern zu k&ouml;nnen &ndash; etwa bis auf 2 Meter Gr&ouml;&szlig;e. Und so habe ich es gemacht:</p>

<p>Franz hatte das Original-Logo dankenswerterweise im EPS-Format erstellt. Allerdings war ein Teil des Logos in der EPS-Datei eine Bitmap-Datei. Meine Geheimwaffe war <code>pstoedit</code>, ein kleines Befehlszeilenprogramm, das Bitmap-, EPS- und PS-Dateien in alle m&ouml;glichen anderen Vektorformate umwandelt. Wenn es korrekt installiert ist, k&ouml;nnen Sie es als eine Art Plug-in f&uuml;r GSview verwenden.</p>
<p>&Ouml;ffnen Sie das Scribus-Logo als EPS-Datei in GSview. W&auml;hlen Sie &quot;Bearbeiten&quot; &gt; &quot;Konvertierung in Vektor-Format&quot;, und es erscheint folgende Dialogbox:</p>

<table width="100%"><tr><td align="center"><img src="../en/images/pstoedit1.png" alt="pstoedit"/></td></tr></table><br />

<p>Beim Durchsehen der beeindruckend langen Liste an Dateiformaten f&uuml;r den Export bin ich auf Sketch (heute: Skencil) gesto&szlig;en, das f&uuml;r SVG geeignet ist. Also habe ich es ausgew&auml;hlt und <strong>Text nach Polygone</strong> markiert. Warum? Der Umgang mit SVG-Text ist heikel, und er funktioniert in Sketch (oder Inkscape) noch nicht ganz zuverl&auml;ssig. Danach zeigte GSview kurz einen leeren Bildschirm und schon hatte ich eine Sketch-Datei (mit .sk-Endung). Ich habe sie mit Sketch ge&ouml;ffnet, und alles sah gut aus, also exportierte ich die SVG-Datei aus Sketch, um sie nach Scribus zu importieren. Perfekt. Nein, noch nicht ganz. Einige Elemente hatten den Export nicht sauber &uuml;berstanden und waren im SVG-Format unsichtbar. (Zu diesem Zeitpunkt war der SVG-Importer eine Woche alt, und so schrieb ich es seiner Fehlerhaftigkeit bzw. einer Fehlfunktion zu. Sp&auml;ter fand ich jedoch heraus, da&szlig; dies <strong>nicht</strong> der Fall gewesen war. Scribus eignet sich also ohne weiteres, <em>wohlgeformtes</em> SVG zu importieren!)</p>
<p> Rein intuitiv &ouml;ffnete ich also dieselbe SVG-Datei in Sodipodi und speicherte sie erneut. Dann importierte ich sie wieder: Schon besser, aber noch nicht perfekt. Nun entdeckte ich in Sodipodi, da&szlig; es eine Option gibt, die <strong>im einfachen SVG-Format</strong> speichern l&auml;&szlig;t. Gut, also sind wir fast am Ziel. Ich konnte die Elemente der Gruppe klar erkennen, doch waren einige von ihnen leer. Zur&uuml;ck in Scribus, hob ich die Gruppierung aller Elemente in der importierten SVG-Datei auf und w&auml;hlte die leeren aus. Interessanterweise entdeckte ich im Vektorgrafikdialog in Scribus, da&szlig; einige der Pfade nicht geschlossen  waren. Ein Klick auf &quot;Pfad schlie&szlig;en&quot; - und voila, es erschienen die Farben. Nach wenigen Minuten des Klickens und Pfad-schlie&szlig;ens hatte ich das Scribus-Logo in Scribus, als SVG. Aufgabe erledigt.</p>

<p>Denselben Trick habe ich benutzt, um Tabellen in einem PDF-Dokument nach Scribus zu importieren. Einer der Scribus-Anwender auf der Liste hatte versucht, Scribus anstelle von InDesign zu benutzen. Beim Testen stellte sich als Problem heraus, da&szlig; es Scribus an Tabellenunterst&uuml;tzung mangelt und InDesign diese gut beherrscht. Daher kamen wiederum PStoedit, Sketch und Sodipodi als Retter zum Einsatz.</p>
<p>Ich bekam also die InDesign-Datei. Sie in Scribus zu reproduzieren w&auml;re zwar m&ouml;glich, aber etwas zu zeitaufwendig gewesen. Von InDesign aus exportierte ich eine PDF-1.3-Datei, schlicht und einfach. Dann: &Ouml;ffnen der PDF-Datei in GSview. Einsatz des PStoedit-Plugins, um diese wieder ins Sketch-Format zu konvertieren. Datei mit Sketch &ouml;ffnen &ndash; sieht auf dem Bildschirm perfekt aus. Exportieren nach SVG. &Ouml;ffnen der Datei in Scribus. Wir sind fast am Ziel. SVG-Datei nochmals in Sodipodi &ouml;ffnen und im einfachen SVG-Format abspeichern. Importieren nach Scribus. Resultat: Ein perfektes Spiegelbild der originalen PDF-Datei.</p>
<p>Vorbehalte: Am besten klappt es mit EPS- oder PDF-Dateien, die Text oder Vektorelemente wie Kurven oder Linien enthalten. Vergessen Sie Dateien mit Fotos oder komplexen Farbverl&auml;ufen! Doch zum Konvertieren von Logos, Tabellen und teilweise sogar stilisiertem Text ist es eine originelle und zugleich n&uuml;tzliche M&ouml;glichkeit, Grafik in Scribus hineinzubekommen. Diese l&auml;&szlig;t sich dann nicht nur bearbeiten, sondern Sie k&ouml;nnen auch sicher sein, da&szlig; sie als PDF-Dokument oder im Druckergebnis perfekt wiedergegeben wird.</p>

<p><strong><em>Meine Erfahrungen:</em></strong> Erstens, <strong>PStoedit</strong> ist ein wirklich bemerkenswertes Hilfsprogramm, das sich &uuml;ber GSview besonders einfach bedienen l&auml;&szlig;t. Die Qualit&auml;t der Konvertierung war &ndash; selbst mit Standardeinstellungen &ndash; einfach erstaunlich. Die Kurven in der EPS-Datei von Scribus  entsprachen vollst&auml;ndig der SVG-Grafik - und ebenso die Farben. Zweitens ist das Neuspeichern eines komplexen Bildformats in einer anderen Anwendung (als derjenigen, die es erzeugt hat) manchmal mit einem &quot;Reinigungseffekt&quot; verbunden. Meiner Erfahrung nach kann aber auch das Gegenteil der Fall sein. Drittens sollten Sie keine Angst haben, etwas zu experimentieren, insbesondere mit SVG. SVG ist ein herrliches Dateiformat mit vielen F&auml;higkeiten. Es ist allerdings relativ neu, und keine Anwendung (weder freie noch kommerzielle Software) kann es derzeit perfekt im- oder exportieren. Dar&uuml;ber hinaus ist kein einziger Vektoreditor in der Lage, die SVG-Spezifikationen vollst&auml;ndig zu unterst&uuml;tzen.</p>

<p>So, und nun wissen Sie, weshalb SVG mein neues Lieblingsformat ist.</p>
</body>
</html>
