<qt>
<title>Vorwort</title>
<h2>Vorwort</h2>

<p>Dieses Dokument ist der optimistische Versuch, eine etwas andere Art technischer Dokumentation zu schaffen. Ziel ist es, den Lesern einen anderen neuen Weg zu weisen, wie sie eine Software kennenlernen und zugleich deren programmeigene Werkzeuge benutzen k&ouml;nnen - w&auml;hrend sie weiter entwickelt wird, um dieses einfache Schriftwerk zu erstellen. Am besten und einfachsten ist die Dokumentation als Papierausdruck zu lesen - alternativ auch in elektronischer Form mit dem frei erh&auml;ltlichen Acrobat Reader von Adobe.</p>

<p>Da&szlig; ich dies hier &uuml;berhaupt schreibe, ist ein treffliches Beispiel f&uuml;r Zuf&auml;lle im Leben. Vielleicht ist es sogar eine kleine Story wert. Von einem Freund aus dem IT-Bereich dazu angeregt, begann ich, mich stundenweise mit RedHat Linux zu besch&auml;ftigen, um meinen Horizont &uuml;ber den vertrauten PC-Bereich hinaus zu erweitern. Wer eine neue Welt erforscht, h&auml;lt h&auml;ufig nach Dingen Ausschau, die es in der alten schon gegeben hat, und sei es nur zum Vergleich. Als ich  Gnome und KDE entdeckte und sogar lernte, Programme zu kompilieren, habe ich gemerkt, da&szlig; es gar nicht so schwierig ist. </p>

<p>Eine Stippvisite bei Google f&uuml;hrte mich zu einer Seite mit Scribus 0.3.6, einem QuarkXPress-&auml;hnlichen DTP-Programm, dessen Entwicklung gerade erst begonnen hatte. Also herunterladen, ein &quot;./configure&quot; durchf&uuml;hren ... doch es kam eine Meldung, da&szlig; ich Scribus nicht kompilieren k&ouml;nne. Sofort setzte ich eine kurze Mail mit dem Fehlergeschwafel ab, das ich noch nicht verstand. Zu meinem Erstaunen erhielt ich kaum 20 Minuten sp&auml;ter eine h&ouml;fliche Antwort mit der Erkl&auml;rung, was ich falsch gemacht h&auml;tte. Ein gutes Zeichen...</p>

<p>Einige Emails und einige Wochen sp&auml;ter besa&szlig; Scribus einen Dokumentar, der sehr wenig von Anwendungsentwicklung verstand und nicht einmal das einfachste in HTML schreiben konnte. Dennoch, ich kannte und mochte Desktop Publishing, und ich hatte jenen 6. Sinn, der mir sagte, da&szlig; Scribus nicht nur etwas ganz Besonderes werden konnte, sondern es bereits war. </p> 

<p>In der Welt von OpenSource gibt es einige gro&szlig;artige Programme ohne jegliche Dokumentation. Und es gibt fabelhafte Programmierer, die absolut miserabel sind, wenn sie etwas dokumentieren (Franz kann ausgezeichnet Dinge erkl&auml;ren, obwohl er Englisch als Fremdsprache spricht).</p>

<p>Demgem&auml;&szlig; ist das nun folgende mein bescheidener Versuch, einem gro&szlig;artigen Programm zu helfen.</p>
</qt>
