<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Scribus im IRC</title>
</head>
<body>
<h2>Scribus im IRC</h2>

Der Scribus-IRC-Kanal ist <a href="irc://irc.freenode.net/#scribus">irc://irc.freenode.net/#scribus</a>. Daneben gibt es einen IRC-Kanal f&uuml;r Entwickler: <a href="irc://irc.freenode.net/#scribus-dev">irc://irc.freenode.net/#scribus-dev</a>

<h4>N&uuml;tzliche Hinweise</h4>
<p>Ein Teil der Scribus-Community trifft sich online im IRC (Internet Relay Chat). Manche werden diese Art von Support eher ungew&ouml;hnlich finden, aber unserer Erfahrung nach funktioniert er ausgesprochen gut. Normalerweise ist mindestens ein Mitglied des Scribus-Teams oder ein erfahrener Anwender &raquo;anwesend&laquo;. Die beste Zeit, um Fragen zu stellen, ist normalerweise der Abend in der mitteleurop&auml;ischen Zeitzone (MEZ). Viele denken, wenn sie IRC h&ouml;ren, an sogenannte Flame wars oder widerw&auml;rtigen Streit, aber #scribus ist wirklich ein freundlicher und angenehmer Kanal. Beleidigungen und P&ouml;beleien werden hier nicht geduldet. Eine gute deutschsprachige Einf&uuml;hrung zum Thema IRC finden Sie beim <a href="http://de.opensuse.org/IRC-Einf&uuml;hrung">OpenSUSE-Projekt.</a></p>

<h4>Nur keine falsche Sch&uuml;chternheit. Fragen Sie einfach!</h4>
<p>Wenn Sie den Kanal zum erstenmal betreten, sagen Sie einfach &raquo;Hi&laquo; oder &raquo;Hallo&laquo; und stellen Sie Ihre Frage. Nat&uuml;rlich kann es (wie im richtigen Leben) nicht schaden, wenn Sie sich kurz vorstellen. Am besten probieren Sie es zun&auml;chst auf englisch, aber es gibt unter den Anwesenden zahlreiche, die auch andere Sprachen beherrschen. Deutsch und Franz&ouml;sisch sind normalerweise kein Problem. </p>


<h4>Beschreiben Sie Ihr Problem m&ouml;glichst genau</h4> 
<p>Es hilft bei der Probleml&ouml;sung, wenn man mehr erf&auml;hrt als: &raquo;Etwas ist schiefgegangen, und jetzt funktioniert Scribus nicht, wie es soll.&laquo;</p>
<ul>
<li>Erw&auml;hnen Sie zuerst, welches Betriebssystem, welche Qt- und welche Scribus-Version Sie verwenden. Dies ist &auml;u&szlig;erst hilfreich, weil einige typische Probleme plattformspezifisch sind.</li>
<li>Beschreiben Sie Ihr Problem m&ouml;glichst so, da&szlig; andere es leicht verstehen k&ouml;nnen. Denken Sie insbesondere daran, da&szlig; die &uuml;brigen Anwesenden nicht vor <b>Ihrem</b> Computer sitzen.</li>
<li>Seien Sie darauf vorbereitet, da&szlig; Ihnen m&ouml;glicherweise Detailfragen zu auf Ihrem Rechner installierten Programmen gestellt werden.</li></ul>

<h4>Haben Sie Geduld</h4>

<p>IRC eignet sich sehr gut f&uuml;r verz&ouml;gerungsfreie Kommunikation, aber manchmal sind kompetente Anwesende mit anderen Dingen besch&auml;ftigt (z.B. damit, Scribus zu programmieren&nbsp;&hellip;). Manche Entwickler sind 24 Stunden lang ununterbrochen eingeloggt &ndash; man nennt dies &raquo;Idling&laquo;, d.h. sie sind gar nicht an Ihrem Computer und schalten sich u.U. erst sp&auml;ter in die Kommunikation ein. Das bedeutet nat&uuml;rlich nicht, da&szlig; sie tagelang auf eine Antwort warten m&uuml;&szlig;ten. Dar&uuml;ber hinaus gibt es in #scribus einen freundlichen sogenannten &raquo;Bot&laquo; mit dem Namen <i>mrscribe</i>, der Nachrichten weiterleiten kann. Mehr zu diesem Helferlein weiter unten.</p>

<h4>Trotz IRC sollten Sie zuerst in der Online-Hilfe nachschauen</h4>

<p>Zum mindesten sollten Sie die Suchfunktion des Hilfebrowsers einmal benutzt haben, um zu sehen, ob Ihr Problem mit Hilfe der Online-Doukmentation gel&ouml;st werden kann. Wie Sie feststellen werden, hat das Scribus-Team sehr viel Arbeit in das Schreiben und das &Uuml;bersetzen der Dokumentation gesteckt (auch wenn sie noch immer nicht ganz vollst&auml;ndig ist). Diese M&uuml;he haben wir uns gemacht, um <b>Ihnen</b> zu helfen.</p>

<h4>Lernen Sie MrScribe kennen</h4>
<p>MrScribe ist unser netter &raquo;Bot&laquo;. Bots sind n&uuml;tzliche Programme im IRC, mit deren Hilfe sich manche Aufgabe erleichtern l&auml;&szlig;t. Er steckt auch voller n&uuml;tzlicher Informationen und zeigt den ihm einprogrammierten Humor der Scribus-Entwickler. Unter <a href="http://supybot.com/">http://supybot.com/</a> erfahren Sie mehr &uuml;ber MrScribe.</p>

<h4>Empfehlungen f&uuml;r IRC-Programme</h4>
<p>Nachdem wir seit Jahren rund um die Uhr im IRC vertreten sind, sehen wir uns imstande, Ihnen guten Gewissens ein paar Programme zur Nutzung dieses Mediums zu empfehlen:</p>
<ul>
   <li><a href="http://www.xchat.org">X-Chat</a> &ndash; ein ausgereiftes IRC-Programm auf GTK+-Basis, das f&uuml;r Linux/UNIX, <a href="http://www.psyon.org/projects/xchat-win32/">Windows</a> und <a href="http://xchataqua.sourceforge.net/twiki/bin/view/Main/WebHome">Mac&nbsp;OS&nbsp;X</a> erh&auml;ltlich ist.</li>
   <li><a href="http://konversation.kde.org/">Konversation</a> &ndash; ein &auml;u&szlig;erst stabiles und benutzerfreundliches Programm, das einen gewaltigen Funktionsumfang hat. Konversation ist Teil von KDE. Die Scribus-Entwickler, soweit sie Linux verwenden, schw&ouml;ren auf diese Software!</li>
<li>Wenn Sie kein separates IRC-Programm installieren m&ouml;chten, k&ouml;nnen Sie auch ein Plug-in f&uuml;r Ihren Browser installieren. F&uuml;r alle bekannten Browser sind derartige Erweiterungen erh&auml;ltlich.</li>
 </ul>
<h4>&raquo;Lounging&laquo;</h4>
<p>Wenn Ihre Frage zu Ihrer Zufriedenheit beantwortet ist, m&uuml;ssen Sie den Kanal nicht gleich wieder verlassen. #scribus ist nicht nur f&uuml;r Entwickler oder fortgeschrittene Anwender gedacht, sondern auch Anf&auml;nger sind eingeladen, sich in die Konversation einzuschalten. Au&szlig;erdem ist #scribus insofern eine Rarit&auml;t, als hier auch &uuml;ber Gott und die Welt geplaudert wird und sehr viele Sp&auml;&szlig;chen gemacht werden. &raquo;off-topic is on-topic&laquo; hei&szlig;t das selbstironische Motto&nbsp;&hellip;</p>
<p>Entwicker erkennen Sie meist, daran, da&szlig; sie Operator-Status haben (wenn Ihr IRC-Programm das anzeigen kann). &Uuml;brigens ist der IRC-Kanal einer jener Orte, an denen die Entwickler sehr viel &uuml;ber die Probleme der Anwender erfahren, und diese Erfahrungen flie&szlig;en direkt in die Entwicklung ein. Manchmal wird sogar der Programmcode im Zuge einer laufenden IRC-Diskussion angepa&szlig;t!</p>
<p>F&uuml;r Sie kann die passive Anwesenheit den Vorteil haben, da&szlig; Sie etwas &uuml;ber die allerneuesten Funktionen erfahren oder n&uuml;tzliche Tricks von den Scribus-Gurus lernen k&ouml;nnen. Wenn Ihnen danach ist, legen Sie also einfach die F&uuml;&szlig;e hoch und genie&szlig;en Sie es&nbsp;&hellip;</p>
<br>
</body>
</html>
