<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Wie Sie Ihr erstes PDF-Online-Formular mit Scribus erstellen</title>
</head>
<body>
<h2>Wie Sie Ihr erstes PDF-Online-Formular mit Scribus erstellen</h2>
<p><em><strong>mit Dank an Maciej Hanski</strong>, der dies freundlicherweise aus dem polnischen Original (mit GNU-Lizenz f&uuml;r freie Dokumentation) &uuml;bersetzt hat.</em></p>
<p><strong>Die Beispieldatei <code>scribusformphp.tar.gz</code>, ein Tarball-Archiv mit PHP-Datei und einem Beispieldokument, ist erh&auml;ltlich unter http://docs.scribus.net</a></p>

<p>Einer der gr&ouml;&szlig;ten Vorteile von Scribus ist die M&ouml;glichkeit, PDF-Formulare mit eingebetteten JavaScript-Skripten (als Adobe-eigene Version, beschrieben in der Adobe Javascript-Referenz unter http://partners.adobe.com/asn/developer/pdfs/tn/5186AcroJS.pdf) zu erstellen.</p>

<p>Es ist recht einfach, mit Scribus ein neues Formular zu erstellen. Als erstes klicken wir auf die Schaltfl&auml;che &quot;Neues Dokument&quot; oder w&auml;hlen im Men&uuml; unter <strong>Datei</strong> den Punkt  <strong>Neu</strong>.</p>

<table width="100%"><tr><td align="center"><img src="images/formularz_nowy.png" alt="Create a new doc" title="Create a new doc" /></a></td></tr></table>

<br />
<p>Nachdem wir das Gitternetz (Men&uuml; <strong>Ansicht</strong> -&gt; <strong>Gitter ein</strong>) aktiviert haben, wird es uns dabei helfen, die Formularfelder korrekt auf der Seite auszurichten. F&uuml;r den Titel und die Feldbezeichnungen ben&ouml;tigen wir einige Textrahmen - Nur wenige Klicks auf die Schaltfl&auml;che <strong>[ab]</strong>, und alle Textrahmen erscheinen im Nu.</p>

<table width="100%"><tr><td align="center"><img src="images/siatka_menu.png" border="0" alt="null" /></td></tr></table>

<p>Wenn unsere Rahmen mit Text gef&uuml;llt sind, k&ouml;nnen wir ihre Eigenschaften &uuml;ber die  <strong>Eigenschaften</strong>-Palette &auml;ndern, die sich im Men&uuml; unter <strong>Werkzeuge</strong> befindet.</p>

<table width="100%"><tr><td align="center"><img src="images/siatka_jednostki_miar.png"  alt="" /></td></tr></table>


<br />

<div>Nun k&ouml;nnen wir beginnen, Formularelemente hinzuzuf&uuml;gen: einige Textfelder und eine Schaltfl&auml;che zum Abschicken unseres Formulars. Um ein Feld hinzuzuf&uuml;gen, klicken Sie einfach auf den Pfeil rechts neben dem <strong>OK</strong>, und w&auml;hlen Sie aus der Auflistung einen Typ aus: Schaltfl&auml;che, Textfeld, Kontrollk&auml;stchen, Kombinationsfeld oder Listenfeld.</div>

<br />
<table width="100%"><tr><td align="center"><img src="images/symbole.png" alt="null" /></td></tr></table>

<p>Das gerade aktive Element des Formulars hat einen Rahmen mit rotem Rand; Sie k&ouml;nnen ein Element aktivieren, indem Sie auf die Schaltfl&auml;che &quot;Ausw&auml;hlen&quot; (die mit dem Pfeilkreuz) und dann auf das gew&uuml;nschte Element klicken.</p>
<br />

<table width="100%"><tr><td align="center"><img src="images/ulica.png" alt="null" /></td></tr></table>

<br />
 
<p>Wenn Sie auf ein Element rechtsklicken, aktivieren Sie ein neues Men&uuml;. Wir w&auml;hlen  <strong>Feldeigenschaften</strong> und definieren Feldnamen (wir brauchen die Feldnamen f&uuml;r unser PHP-Skript, wohin das Formular gesendet wird), Feldtypen (z.B. Zahl, Zeit, Datum) sowie Aktionen, die bei bestimmten Ereignissen ausgef&uuml;hrt werden sollen (Mouse-Enter, Mouse-Exit, onBlur - also beim Verlassen des Elements - usw.).</p>

<br /><br />

<table width="100%"><tr><td align="center"><img src="images/wlasciwosci_pola.png" alt="null"  border="0" /></td></tr></table>

<br />

<p>Hier definieren wir das Feld <strong>No</strong> als Zahl. Der Acrobat Reader wird danach nichts anderes als g&uuml;ltige Eingabe akzeptieren.</p>

<br />

<table width="100%"><tr><td align="center"><img src="images/formularz_pole_num.png" border="0" alt="null" /></td></tr></table>

<br />

<p>Hier definieren wir nun selbst ein Kontrollskript f&uuml;r das Feld <strong>Name</strong>: Nach &Auml;nderung des Feldinhalts wird ein akustisches Signal ert&ouml;nen, und es erscheint eine Warnmeldung (nicht sehr anspruchsvoll, ich wei&szlig;, doch immerhin ausreichend, um die M&ouml;glichkeiten von PDF zu zeigen). Scribus hat einen eigenen einfachen Texteditor, mit dem wir das Skript als separate Datei speichern k&ouml;nnen. Selbstdefinierte Skripte lassen sich nicht nur auf Formularfeld-Ebene, sondern auch als globale Skripte anlegen (<strong>Bearbeiten</strong> -&gt; <strong>JavaScripts</strong>).</p>

<br />

<table width="100%"><tr><td align="center"><img src="images/formularz_js_skrypt.png" alt="null" /></td></tr></table>
<br />

<p>Wenn das Skript gespeichert und der Editor geschlossen ist, erscheint der Skript-Inhalt unter <strong>Feldeigenschaften</strong>.</p>
<br />

<table width="100%"><tr><td align="center"><img src="images/formularz_js_sprawdzanie.png" border="0" alt="null" /></td></tr></table>

<br />

<p>Wir m&uuml;ssen noch festlegen, an welchen URL der Inhalt des Formulars gesendet wird (Ein einfaches PHP-Skript an der Zieladresse wird die empfangenen Daten formatieren und darstellen). Unter &quot;Eigenschaften&quot; w&auml;hlen wir f&uuml;r die Schaltfl&auml;che den Aktionstyp <strong>Submit form/Formular abschicken</strong> und geben die Adresse unseres PHP-Skripts ein: <strong>scribus_test.php</strong>. Schlie&szlig;lich markieren wir noch das K&auml;stchen <strong>Daten als HTML &uuml;bertragen</strong> (die andere M&ouml;glichkeit, als FDF-Daten, w&auml;re etwas ganz anderes), und damit sind wir nun fertig.</p>

<br />

<table width="100%"><tr><td align="center"><img src="images/wyslij_formularz.png" alt="null" /></td></tr></table>

<br />

<p>Das einzige, was noch zu tun bleibt, ist der Export des Dokuments nach PDF: Men&uuml;auswahl <strong>Datei -&gt; Export... -&gt;; Export nach PDF...</strong>.<br />Wir w&auml;hlen <strong>Acrobat 5.0</strong> als Dateiformat aus und speichern das Dokument.</p>

<br />
<table width="100%"><tr><td align="center"><img src="images/formularz_export_PDF.png" border="0" alt="null" /></td></tr></table>
<br />

<p>Das Ergebnis unserer Arbeit kann von hier heruntergeladen und getestet werden: http://docs.scribus.net. Damit das Formular &uuml;bermittelt werden kann, m&uuml;ssen wir es in einem Browserfenster &ouml;ffnen, wobei Netscape 4.* oder Mozilla die sichersten sind (Kontrollieren Sie die Plugins von Mozilla, um zu sehen, ob das Acrobat Reader-Plugin aktiviert ist. Falls nicht, m&uuml;ssen Sie es mit Mozillas Plugin-Verzeichnis symbolisch verlinken. In meinem Fall hier hei&szlig;t Mozillas Plugin-Verzeichnis <strong>/usr/lib/mozilla-1.3/plug-in</strong>, und das hiermit zu verlinkende Plugin hei&szlig;t <strong>/usr/local/Acrobat5/Browsers/intellinux/nppdf.so</strong>).</p>

<p><strong>Mein ganz pers&ouml;nlicher Eindruck:</strong> Scribus ist als Werkzeug f&uuml;r die Arbeit mit PDF-Formularen komfortabler zu bedienen als Adobe Acrobat 5.0 (der einzigen Version, mit der ich gearbeitet habe). Es ist wesentlich einfacher, mit Scribus ein Dokumentenlayout zu gestalten, denn Acrobat gestattet nur das Bearbeiten existierender Dokumente, ein v&ouml;llig neues Erstellen ist damit nicht m&ouml;glich. Scribus stellt uns die volle Kontrolle &uuml;ber das Endergebnis zur Verf&uuml;gung und l&auml;&szlig;t uns viel mehr Freiheit beim &Auml;ndern eines Dokumentenlayouts. Au&szlig;erdem lassen sich Scribus-Dateien sogar mit einem simplen Texteditor bearbeiten, denn sein Dateiformat basiert v&ouml;llig auf XML.</p>
<p><em>Maciej Hanski</em> - 22.10.2003</p>

<p><strong>Einige n&uuml;tzliche PDF/JavaScript-Links:</strong></p>
<ul>
	<li><a href="http://www.planetpdf.com/mainpage.asp?WebPageID=229" target="_blank">Planet PDF</a></li>
	<li><a href="http://partners.adobe.com/asn/developer/pdfs/tn/5186AcroJS.pdf" target="_blank">Acrobat JavaScript Object Specification</a></li>
	<li><a href="http://ahnews.music.salford.ac.uk/scribus/documentation/pdfs/javascriptpdfa4.pdf" target="_blank">JavaScript and Scribus</a></li>
</ul>

<p><strong>Einige n&uuml;tzliche CGI/PHP-Links:</strong></p>
<ul>
	<li><a href="http://www.cgi101.com/book/ch4/text.html">http://www.cgi101.com/book/ch4/text.html</a></li>
	<li><a href="http://www.cgi101.com/book/ch4/post-cgi.html">http://www.cgi101.com/book/ch4/post-cgi.html</a></li>
	<li><a href="http://www.mkaz.com/reference/php/setup_linux.html">http://www.mkaz.com/reference/php/setup_linux.html</a></li>
</ul>

</body>
</html>
