<qt>
<title>Erstellung von PDF-Pr&auml;sentationen</title>
<h2>Erstellung von PDF-Pr&auml;sentationen</h2>
<h3>PDF f&uuml;r Pr&auml;sentationen</h3>
<p>Das Erstellen von PDF-Dateien f&uuml;r Pr&auml;sentationen ist mit Scribus nicht nur einfach, sondern auch sehr wirkungsvoll. Wer PDF-Dokumente anstelle traditioneller Pr&auml;sentationsprogramme einsetzt, genie&szlig;t dabei einige Vorteile:</p>

<ol>
	<li>Sie sind portabel. Sie k&ouml;nnen eine PDF-Pr&auml;sentation mit Scribus erzeugen und diese dann auf fast jedem Computer mit dem Adobe Reader darstellen. Andere Formate ben&ouml;tigen &uuml;blicherweise eine Installation &quot;ihres&quot; Programms, und nur wenige gibt es f&uuml;r andere Plattformen.</li>
	<li>Es stehen Ihnen alle Scribus-Werkzeuge zum Zeichnen, zur Textgestaltung und Bildbearbeitung zur Verf&uuml;gung, die in vielen F&auml;llen jenen anderer Pr&auml;sentationsprogramme &uuml;berlegen sind. Nur wenige k&ouml;nnen SVG- oder EPS-Dateien einwandfrei importieren.</li>
	<li>Ihre Texte sind typografisch besser kontrollierbar.</li>
	<li>Da sie in Scribus erstellt wurden, k&ouml;nnen Sie sie mit h&ouml;herer Aufl&ouml;sung exportieren und bekommen ein exzellentes Druckergebnis.</li>
</ol>

<h4>Empfohlene Einstellungen und Tips:</h4>
<ul>
	<li>Verringern Sie die Aufl&ouml;sung aller Bilder auf 72&ndash;96 dpi. Je nach Aufl&ouml;sung Ihres Betrachterger&auml;ts k&ouml;nnen Sie bis 120 dpi gehen, doch ein h&ouml;herer Wert bringt kein Mehr an Sch&auml;rfe. Nehmen Sie f&uuml;r diesen Arbeitsschritt ein Bildbearbeitungsprogramm wie GIMP, und importieren Sie erst dann in Scribus.</li>
	<li>Betten Sie alle Schriftarten ein. Damit ist sichergestellt, da&szlig; Abst&auml;nde und Layout immer gleich bleiben, ganz egal auf welcher Plattform.</li> 
	<li>Als Layout k&ouml;nnen Sie US-Letter oder A4 im Querformat verwenden. Damit treffen Sie relativ genau die Bildschirmdarstellung des Adobe Readers im Vollbildmodus.</li>
	<li>Verwenden Sie bei der Darstellung von Fotos oder Screenshots einen schwarzen oder dunklen Hintergrund auf Ihrer Seite. Auf diese Weise wirken die Farben kr&auml;ftiger und der Betrachter bekommt mehr Kontrast, um alle Details auf Ihren Bildern erkennen zu k&ouml;nnen.</li>
	<li>Benutzen Sie f&uuml;r Ihre Bilder RGB-Farben und w&auml;hlen Sie stets "Monitor/Internet" f&uuml;r den Export.</li>
	<li>Und hier noch ein Trick, den ich beim Einsatz von PDF f&uuml;r Pr&auml;sentationen gelernt habe. Laden Sie das PDF-Dokument und lassen Sie alle Seiten einmal durchlaufen, bevor Sie die Pr&auml;sentation zeigen, so da&szlig; sich alle Daten im Hauptspeicher befinden. Hierdurch bekommen Sie auf dem Bildschirm weichere &Uuml;berg&auml;nge.</li>
</ul>
</qt>
