<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Dateien f&uuml;r den kommerziellen Druck vorbereiten</title>
</head>
<body>
<h2>Dateien f&uuml;r den kommerziellen Druck vorbereiten</h2>
<p>Wenn Sie noch nie mit Druckereien zu tun hatten und f&uuml;r den reibungslosen Ablauf einer kommerziellen Druckserie sorgen m&ouml;chten, dann k&ouml;nnen Sie nichts besseres tun als m&ouml;glichst fr&uuml;hzeitig den Kontakt zu Ihrer Druckerei zu suchen. Wenn Sie Mi&szlig;verst&auml;ndnisse vermeiden und Ihre Zielvorstellung optimal vermitteln, werden 90% der m&ouml;glichen Fehler gar nicht erst auftreten. Sollte ein Betrieb Ihre Fragen nicht zufriedenstellend beantworten, dann gehen Sie zum n&auml;chsten! In der Druckereibranche gibt es viel Konkurrenz. Die besten bieten ebenso solides Fachwissen wie guten Service. </p>


<h3>Stellen Sie Fragen:</h3>

<h4>Wenn ein Betrieb das PDF-Format akzepiert, welches Level?</h4>

<p> PDF 1.3 (Acrobat 4), PDF 1.4 (Acrobat 5) oder PDF/X-3 (ISO-Standard)? Wenn PDF/X-3 akzepiert wird, k&ouml;nnen Sie sich gl&uuml;cklich sch&auml;tzen. Dieser PDF-Typ ist f&uuml;r kommerzielles Drucken am weitesten fortgeschritten und ausdr&uuml;cklich daf&uuml;r konzipiert, eine solide Farbtreue zwischen Systemen sicherzustellen. Wenn ein Betrieb den Gebrauch bestimmter ICC-Profile empfehlen kann - um so besser!</p>

<h4>Wie sieht es mit dem Konvertieren von PDF in andere Formate (wie EPS) aus? </h4>

<p>Sein Sie sich bewu&szlig;t, da&szlig; nicht alle DTP-Anwendungen in der Lage sind, die neueren Merkmale und Funktionen von PS3 oder PDF 1.4 so zu unterst&uuml;tzen, wie Scribus es tut. Wenn die Systeme der Druckerei unterhalb von PDF 1.4 arbeiten, dann ist diese L&ouml;sung <strong>nicht</strong> empfehlenswert.</p>

<h4>Kann der Betrieb ein ICC-Profil des von ihm verwendeten Druckers erstellen und vorlegen, falls die Farbtreue zu w&uuml;nschen &uuml;brig l&auml;&szlig;t?</h4>

<h4>Welches PS-Level verwendet der eingesetzte Rastergrafik-Wandler (RIP)?</h4>

<p>Dies kann ein entscheidender Faktor daf&uuml;r sein, wie Sie Ihre Dateien vorbereiten m&uuml;ssen. Besitzt der Betrieb einen RIP mit 3015.xxx oder dar&uuml;ber, k&ouml;nnen Sie sicher sein, da&szlig; dieser RIP zu 100% mit den Merkmalen und Funktionen von Scribus umgehen kann. Vielleicht kann Ihnen das dort niemand so direkt beantworten, aber... </p>

<p>Schauen Sie sich die Anmerkungen zur <a href="prepress.html">Druckvorstufe</a> an, und Sie erhalten sogar ein gedrucktes Exemplar der PDF-Datei, auch wenn die Druckerei noch nie etwas von Scribus geh&ouml;rt hat. Eine Liste mit Druckereien, die Scribus unterst&uuml;tzen, wird demn&auml;chst hier online zu finden sein.</p>

<p>Sollten Sie noch weitere Fragen haben, stellen Sie diese bitte in der Mailingliste oder im IRC-Chat. Normalerweise findet sich dort ein kluger Geist, der Ihre Fragen beantworten kann.</p>

</body>
</html>