<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>F&uuml;r Schnelleinsteiger</title>
</head>
<body>
<h2>F&uuml;r Schnelleinsteiger</h2>

<p>Bevor wir mit der Beschreibung von Scribus ins Detail gehen, ist es vielleicht n&uuml;tzlich, erst einmal ein Gef&uuml;hl daf&uuml;r zu bekommen, wie das Programm funktioniert. Dazu wird im folgenden als Beispiel gezeigt, wie man f&uuml;r den Katalog einer internationalen Rembrandt-Ausstellung ein einfaches Titelblatt gestalten k&ouml;nnte. Um die einzelnen Schritte nachzuvollziehen, ben&ouml;tigt man:</p>
<ul><li>die Schriftarten <a href="http://scripts.sil.org/cms/scripts/page.php?site_id=nrsi&amp;item_id=Gentium&amp;_sc=1" class="external text" title="http://scripts.sil.org/cms/scripts/page.php?site_id=nrsi&amp;item_id=Gentium&amp;_sc=1" rel="nofollow">Gentium</a> und <a href="http://mirror.cs.wisc.edu/pub/mirrors/ghost/GPL/current/ghostscript-fonts-std-8.11.tar.gz" class="external text" title="http://ftp.gnome.org/pub/GNOME/sources/ttf-bitstream-vera/1.10/" rel="nofollow">Bitstream Vera Sans</a>, die auf Ihrem Computer installiert sein sollten;</li>
<li>Rembrandts Selbstportrait, erh&auml;ltlich unter <a href="http://commons.wikimedia.org/wiki/Image:Rembrandt_Harmensz._van_Rijn_137.jpg" class="external text" title="http://commons.wikimedia.org/wiki/Image:Rembrandt_Harmensz._van_Rijn_137.jpg" rel="nofollow">Wikimedia</a>;
</li><li>das Scribus-Logo aus dem Installationsverzeichnis von Scribus.
</li></ul>
<p>Die folgende Abbildung zeigt, wie das Endergebnis aussehen sollte:
<table width="100%"><tr><td align="center"><img src="images/Cover_en1-page1.png"/></td></tr></table> 
</p>


<p>Bevor Sie loslegen, sollten Sie die f&uuml;r das Projekt passende Farbpalette ausw&auml;hlen. Stellen Sie sicher, da&szlig; noch kein Dokument ge&ouml;ffnet ist, und w&auml;hlen Sie <i>Bearbeiten &gt; Farben... </i> Der folgende Dialog zeigt die Standardpalette &raquo;Scribus Basic&laquo;, die voreingestellt ist. F&uuml;r unsere Zwecke ben&ouml;tigen wir die mit &raquo;X11&laquo; bezeichnete Palette, die man im Dialog unter &raquo;Farbpaletten&laquo; ausw&auml;hlen kann.</p>

<table width="100%">
  <tbody>
    <tr><td align="center"><img src="images/qsg-col1.png"/></td>
<td></td>
<td></td>
      <td align="center"><img src="images/qsg-col2.png"/></td>
    </tr>
  </tbody>
</table>

<h3>Schritt Eins: Neues Dokument erzeugen und den Seitenhintergrund festlegen</h3>

<p>Wahrscheinlich sind Sie damit vertraut, wie eine Textverarbeitung verf&auml;hrt, wenn man eine neue Datei erstellt: Das Programm erzeugt eine neue Seite, und man kann sich gleich an die Arbeit machen. Dieses Verfahren, wonach einfach eine neue Seite erzeugt oder hinzugef&uuml;gt wird, sobald sie ben&ouml;tigt wird, funktioniert so bei Scribus nicht (und ebensowenig bei anderen DTP-Programmen). Um eine neue Seite zu erzeugen, mu&szlig; man dies im Programm explizit veranlassen. Denn ein DTP-Programm ist so ausgelegt, da&szlig; ein H&ouml;chstma&szlig; an Kontrolle &uuml;ber das Layout und den Inhalt des Dokuments m&ouml;glich ist. Daher w&auml;hlen wir also <i>Datei &gt; Neu</i>, wonach der folgende Dialog erscheint:</p>
<br>

<table width="100%"><tr><td align="center"><img src="images/Rembrandt1.png"/></td></tr></table> 


<p>F&uuml;r unsere Titelseite w&auml;hlen wir das Layout &raquo;Einzelne Seite&laquo;, und als &raquo;Gr&ouml;&szlig;e&laquo; legen wir &raquo;Benutzerdefiniert&laquo; fest (zu finden ganz am unteren Ende der entsprechenden Dropdown-Liste). Den vorgegebenen Wert f&uuml;r die &raquo;H&ouml;he&laquo; &auml;ndern wir auf 285&nbsp;mm. Da die Titelseite keine R&auml;nder aufweisen soll, setzen wir alle entsprechenden Werte auf 0&nbsp;mm. Die restlichen Voreinstellungen kann man unver&auml;ndert belassen.</p>

<p>Nach dem Klick auf &raquo;OK&laquo; erzeugt Scribus eine neue Seite:</p>
<br>

<table width="100%"><tr><td align="center"><img src="images/Rembrandt2.png"/></td></tr></table>



<p>Als n&auml;chstes ben&ouml;tigen wir f&uuml;r unsere Seite einen grauen Hintergrund. Klicken Sie dazu auf das wei&szlig;e (oder hellgraue) Viereck in der Symbolleiste, oder dr&uuml;cken Sie einfach auf die S-Taste. Tats&auml;chlich wird beim Dr&uuml;cken dieser Taste kein Buchstabe geschrieben, denn schreiben kann man nur innerhalb einer entsprechenden Umgebung, d.h. innerhalb eines Textrahmens. Da in unserem Fall eine Form (engl. <i>shape</i>) eingef&uuml;gt werden soll, hei&szlig;t das Tastenk&uuml;rzel &raquo;S&laquo;.</p>

<p>Als Mauszeiger wird nun ein kleines Rechteck angezeigt, mit einem Plus-Zeichen an der oberen linken Ecke. Wenn Sie jetzt die linke Maustauste gedr&uuml;ckt halten und dabei den Zeiger &uuml;ber die Seite ziehen, entsteht beim Loslassen die entsprechende Form. Deren Gr&ouml;&szlig;e, Position und Farbe sind f&uuml;rs erste unwichtig, denn diese werden mit dem n&auml;chsten Schritt festgelegt.</p>
<br>

<table width="100%"><tr><td align="center"><img src="images/Rembrandt3.png"/></td></tr></table>



<p>Solange Sie nicht irgendwo anders hinklicken, bleibt das neu erzeugte Rechteck ausgew&auml;hlt, d.h. es ist rot umrandet und verf&uuml;gt &uuml;ber sogenannte Griffpunkte oder Anfasser an den Ecken und in der Mitte jeder Seitenlinie. Sie k&ouml;nnen jetzt mit <i>Fenster &gt; Eigenschaften</i> oder durch Dr&uuml;cken von F2 die Eigenschaftenpalette aufrufen &ndash; bei Scribus eine Art Allzweckwerkzeug, auf dessen Verwendung wir sp&auml;ter noch zur&uuml;ckkommen. Im Moment bleiben wir bei der Standardansicht der Palette, also diejenige, die mit &raquo;X,&nbsp;Y,&nbsp;Z&laquo; bezeichnet wird. Da es sich vor allem bei komplexeren Dokumenten empfiehlt, f&uuml;r jedes Objekt einen eindeutigen Namen zu vergeben (dadurch kann man es sp&auml;ter leichter wiederauffinden und ausw&auml;hlen), vergeben wir hier zun&auml;chst den (naheliegenden) Namen &raquo;Hintergrund&laquo;.</p>


<p>Nun bringen wir das Rechteck auf die Gr&ouml;&szlig;e der Seite. Dazu erinnern wir uns an die Werte, die wir zuvor f&uuml;r die Seite festgelegt hatten, und f&uuml;gen sie hier ein. Dabei sollte man allerdings auf das Kettensymbol rechts neben den Eingabefeldern f&uuml;r Breite und H&ouml;he achten. Gibt man die Werte ein, ohne da&szlig; die Kette getrennt ist, dann bewirkt die &Auml;nderung eines Wert eine proportionale &Auml;nderung beim jeweils anderen, und man wird den Eindruck bekommen, da&szlig; man sich im Kreis dreht &ndash; heraus kommt man nur, wenn man die Kette trennt.</p>

<p>Nachdem nun das Rechteck genau der Seitengr&ouml;&szlig;e entspricht, m&uuml;ssen wir noch sicherstellen, da&szlig; es mit den Seitenr&auml;ndern &uuml;bereinstimmt, indem wir die X- und die Y-Position auf 0,000 setzen. Dazu kann man auch die vorhandenen Werte l&ouml;schen, durch eine einfache Null ersetzen und danach entweder die Tabulator- oder die Eingabetaste dr&uuml;cken. Scribus wird die Dezimalstellen dann automatisch erg&auml;nzen.</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt4.png"/></td></tr></table> 

<p><i><b>Tip:</b> Man kann die einzelnen Schritte wie beschrieben manuell ausf&uuml;hren, jedoch l&auml;&szlig;t sich dasselbe ab Version 1.4.0 auch auf k&uuml;rzerem Wege erreichen, n&auml;mlich indem man zuerst auf die S-Taste dr&uuml;ckt, um das kleine Rechteck zu aktivieren, und gleichzeitig die Umschalttaste gedr&uuml;ckt h&auml;lt und auf eine beliebige Stelle der Seite klickt: Damit wird unmittelbar ein Rahmen erzeugt, der sich bis zum Rand ausdehnt und in unserem Falle auch mit der Seite deckt, da die Seitenr&auml;nder auf 0 gesetzt werden.</i></p>


<p>Als F&uuml;llfarbe f&uuml;r derartige Formen wird bei Scribus standardm&auml;&szlig;ig &raquo;Keine&laquo; verwendet, was wir hier freilich &auml;ndern wollen. Solange das Element noch ausgew&auml;hlt ist, kann man hierzu sofort erneut die Eigenschaftenpalette aufrufen und dort zum Reiter &raquo;Farben&laquo; wechseln. Aus der Liste w&auml;hlen wir dann &raquo;Grey41&laquo; als F&uuml;llfarbe aus.</p>

<p>Bei Scribus verf&uuml;gen Formen und Rahmen immer &uuml;ber einen Rand. Bei Formen ist die Standardfarbe Schwarz; da wir aber keine gesonderte Farbe f&uuml;r den Rand w&uuml;nschen, m&uuml;ssen wir auf die Schaltfl&auml;che mit dem Pinsel klicken und dann &raquo;Keine&laquo; (immer ganz oben in der Liste) ausw&auml;hlen.</p>
<br>

<table width="100%"><tr><td align="center"><img src="images/Rembrandt5.png"/></td></tr></table> 



<p>Damit ist die Arbeit am Seitenhintergrund abgeschlossen. Um sich gegen unbeabsichtigte &Auml;nderungen abzusichern, kann man zur Ansicht &raquo;X,&nbsp;Y,&nbsp;Z&laquo; der Palette zur&uuml;ckkehren und dort auf die Schaltfl&auml;che mit dem Vorh&auml;ngeschlo&szlig; klicken. Damit ist der Hintergrund vor &Auml;nderungen gesch&uuml;tzt.</p>
<br>

<table width="100%"><tr><td align="center"><img src="images/Rembrandt6.png"/></td></tr></table> 


<h3>Schritt Zwei: Einf&uuml;gen des Titelbildes</h3>


<p>Nachdem man den Hintergrund erzeugt hat, kann man sich an die Plazierung des Titelbildes machen. Vielleicht sind Sie es von ihrem Textverarbeitungsprogramm her gewohnt, Grafiken direkt ins Dokument einzuf&uuml;gen, aber bei Scribus werden sie in einen sogenannten Container eingef&uuml;gt, d.h. in einen Rahmen. F&uuml;r Abbildungen &ndash; oder technisch gesprochen f&uuml;r Bitmap-Grafiken &ndash; erzeugt man einen Rahmen, indem man auf die Schaltfl&auml;che &raquo;Bildrahmen einf&uuml;gen&laquo; klickt oder die I-Taste dr&uuml;ckt. Der Bildrahmen wird dann ebenso eingerichtet wie zuvor das Rechteck, und zwar wiederum unter der Ansicht &raquo;X,&nbsp;Y,&nbsp;Z&laquo; der Palette &raquo;Eigenschaften&laquo;.</p>

<p>F&uuml;r diesen Bildrahmen vergeben wir den Namen &raquo;Rembrandt1&laquo;, und f&uuml;r die H&ouml;he und Breite geben wir die unten im Screenshot gezeigten Werte ein. Unser Bild soll genau in der unteren rechten Ecke plaziert werden. Dies l&auml;&szlig;t sich leichter erreichen, als es zun&auml;chst den Anschein hat: Die Werte f&uuml;r die Breite und H&ouml;he der Seite sind uns bereits bekannt, n&auml;mlich 210&nbsp;mm und 285&nbsp;mm. K&ouml;nnten diese also einfach unter &raquo;X-Position&laquo; und &raquo;Y-Position&laquo; eingetragen werden? Nicht ganz. Denn zuerst mu&szlig; man den &raquo;Ursprung&laquo; des Objekts &auml;ndern. Beim Festlegen der Nullwerte f&uuml;r den Hintergrund wurde die obere linke Ecke der Seite als Bezugspunkt angenommen. Da aber das Bild an den Seitenr&auml;ndern unten rechts ausgerichtet werden soll, mu&szlig; auch der Ursprung entsprechend abge&auml;ndert werden, bevor man die X- und Y-Werte eingibt. Danach aktivieren wir noch die Sperrung f&uuml;r die Gr&ouml;&szlig;e des Rahmens durch Klicken auf das &raquo;Sperren&laquo;-Symbol:</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt7.png"/></td></tr></table> 
</p>

<p>Um unser Design etwas eleganter zu gestalten, wollen wir die Abbildung ein wenig ab&auml;ndern. Was am Ende zu sehen sein wird, ist ein schmaler Streifen am linken Rand. Dazu w&auml;hlen wir aus dem Men&uuml; <i>Objekt &gt; Mehrfach duplizieren</i>, denn diese Funktion erlaubt es, das Ma&szlig; der horizontalen oder vertikalen Verschiebung genau festzulegen. Im Dialog geben wir an, da&szlig; wir eine Kopie ben&ouml;tigen, und unter &raquo;Horizontaler Abstand&laquo; geben wir einen Wert von -6&nbsp;mm ein, denn die Kopie soll links vom Original plaziert werden:</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt8.png"/></td></tr></table> 


<p>Da der neue Bildrahmen eine Kopie von &raquo;Rembrandt1&laquo; darstellt, m&uuml;ssen wir dessen Gr&ouml;&szlig;e nicht ver&auml;ndern, und ebenso wird die Plazierung durch den Kopiervorgang festgelegt. Jetzt mu&szlig; man nur noch den Namen &raquo;Rembrandt2&laquo; f&uuml;r den Bildrahmen vergeben. Allerdings besteht nunmehr das Problem, da&szlig; er sich &uuml;ber dem Rahmen der eigentlichen Titelabbildung befindet; wir m&uuml;ssen ihn also nach hinten verschieben. Bisher haben wir drei Objekte erzeugt, jedesmal &uuml;ber dem vorangegangenen. Daher verschieben wir den zweiten Bildrahmen einfach um eine Ebene nach unten, so da&szlig; er sich hinter &raquo;Rembrandt1&laquo; befindet:</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt9.png"/></td></tr></table> 

<p>Mit dem nun folgenden Importieren von externen Objekten geht es zur eigentlichen Sache: Um das Titelbild in den Rahmen &raquo;Rembrandt1&laquo; zu laden, klicken Sie mit der rechten Maustauste in diesen Bereich und w&auml;hlen dann
<i>Bild laden&hellip;</i>:</p> 
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt10.png"/></td></tr></table> 

<p>Damit wird ein Dialog zur Dateiauswahl ge&ouml;ffnet. Wie es bei Ausstellungen so zu sein pflegt, wird wahrscheinlich eine Unzahl von Abbildungen mit &auml;hnlich erscheinenden Namen im selben Verzeichnis aufgelistet. Dieses Problem ist jedoch schnell umschifft, denn zum Gl&uuml;ck bietet Scribus in diesem Dialog eine Vorschau auf die Abbildungen:</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt11.png"/></td></tr></table> 

<p>Nachdem die passende Datei gefunden ist, &ouml;ffnet man sie mit einem Doppelklick oder w&auml;hlt &raquo;OK&laquo;. Aber nun zeigt sich ein neues Problem:</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt12.png"/></td></tr></table> 

<p>Wie man sehen kann, deckt sich die Gr&ouml;&szlig;e des Bildes nicht mit der des Bildrahmens. Hier k&ouml;nnen wir erneut auf die Palette &raquo;Eigenschaften&laquo; zur&uuml;ckgreifen, um eine entsprechende Anpassung zu erzwingen. Dazu wechselt man in die Ansicht &raquo;Bild&laquo; und aktiviert dort &raquo;An Rahmen anpassen&laquo; sowie &raquo;Proportional&laquo;. Damit erh&auml;lt das Titelbild exakt die richtige Gr&ouml;&szlig;e:</p>

<table width="100%"><tr><td align="center"><img src="images/Rembrandt13.png"/></td></tr></table> 

<p>Als n&auml;chstes ben&ouml;tigen wir in &raquo;Rembrandt2&laquo; eine Kopie des Bildinhalts von &raquo;Rembrandt1&laquo;. Dazu klickt man mit der rechten Taste in den &raquo;Rembrandt1&laquo;-Rahmen und w&auml;hlt <i>Inhalt &gt; Kopieren</i>, und danach erneut mit der rechten Maustaste auf den sichtbaren Streifen in &raquo;Rembrandt2&laquo;, um dann <i>Inhalt &gt; Einf&uuml;gen</i> auszuw&auml;hlen. Das Ergebnis ist zun&auml;chst nicht gerade spektakul&auml;r, so da&szlig; wir auf &raquo;Rembrandt&laquo; noch einige Effekte anwenden wollen. Dazu rufen wir erneut das Kontextmen&uuml; auf, und w&auml;hlen dort <i>Bildeffekte</i>:</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt15.png"/></td></tr></table> 

<p>In diesem Dialog geht es nun einigerma&szlig;en zur Sache, denn insgesamt wollen wir das Bild mit vier verschiedenen Effekten bearbeiten: Invertieren, Verwischen (Radius: 7,0), Umwandlung in Graustufen, und Anpassung der Helligkeit auf den Wert -44:</p>

<table width="100%"><tr><td align="center"><img src="images/Rembrandt16.png"/></td></tr></table> 

<p>Das Endergebis kann sich schon eher sehen lassen:</p>

<table width="100%"><tr><td align="center"><img src="images/Rembrandt17.png"/></td></tr></table> 


<h3>Schritt Drei: Hinzuf&uuml;gen von Text</h3>

<p>Als n&auml;chstes wollen wir den K&uuml;nstler beim Namen nennen. Dazu erzeugen wir einen Textrahmen, entweder durch Klicken auf das entsprechende Symbol in der Leiste, oder durch Dr&uuml;cken der T-Taste (wie man sieht, &auml;hnelt das Verfahren dem weiter oben beschriebenen). Der Rahmen kann durch Ziehen erzeugt werden, ganz wie beim Einf&uuml;gen einer Form. Er sollte nat&uuml;rlich gro&szlig; genug sein, um den in der folgenden Abbildung gezeigten Text aufzunehmen. Nach einem Doppelklick in den neuen Rahmen kann man schlie&szlig;lich &raquo;REMBRANDT&laquo; eingeben. Danach klickt man auf einen anderen Bereich des Dokuments und sogleich erneut in den Textrahmen (jeweils nur einmal), um diesen wieder auszuw&auml;hlen.
</p>

<p>Wir &ouml;ffnen jetzt wieder die Palette &raquo;Eigenschaften&laquo; (Tastenk&uuml;rzel: F2) und dort den Reiter &raquo;Text&laquo;. Hier w&auml;hlen wir f&uuml;r Rembrandts Namen als Schriftfamilie &raquo;Gentium&laquo; aus und stellen die Gr&ouml;&szlig;e auf 97&nbsp;pt ein; als Schriftfarbe wird &raquo;White&laquo; festgelegt. Das Ergebnis sollte wie folgt aussehen:</p>

<table width="100%"><tr><td align="center"><img src="images/Rembrandt17b.png"/></td></tr></table> 

</p><p>Damit kommen wir der Sache schon recht nahe, obwohl das Ganze etwas eint&ouml;nig aussieht. Daher wollen wir die Seite mit einigen Extras geschmackvoller gestalten. Hier kommen uns die historischen Fakten zu Hilfe, vor allem die Tatsache, da&szlig; &raquo;Rembrandt&laquo; eigentlich der (ungew&ouml;hnliche) Vorname des Malers war; mit Nachnamen hie&szlig; er jedoch &raquo;van Rijn&laquo;. Wir f&uuml;gen also einen weiteren Textrahmen ein und schreiben nach dem Doppelklick &raquo;VAN RIJN&laquo; hinein. Schriftart und -gr&ouml;&szlig;e dieses Texts sollten identisch sein mit denen des ersten, aber statt &raquo;White&laquo; w&auml;hlen wir diesmal als Farbe &raquo;Pink2&laquo;. &raquo;Pink&laquo;? Ja genau, pink! Rembrandt wird sich deswegen kaum im Grabe umdrehen, denn er kann ja noch nicht wissen, was wir damit anstellen werden: Wir wechseln n&auml;mlich in die Ansicht &raquo;Farben&laquo; und verringern dort den &raquo;Tonwert&laquo; auf 50% und die &raquo;Deckkraft&laquo; auf 20%. Das Ergebnis kann sich sehen lassen &ndash; man meint fast, den Meister l&auml;cheln zu sehen&hellip;</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt18.png"/></td></tr></table> 
<br>
</p>Schlie&szlig;lich verschieben wir noch den Rahmen &raquo;Van Rijn&laquo; um eine Ebene nach unten, so da&szlig; er sich hinter dem &raquo;Rembrandt&laquo;-Rahmen befindet.</p>

<p>Nun ben&ouml;tigen wir noch drei weitere Textrahmen, in die wir als Text
&raquo;1606&laquo;, &raquo;2006&laquo; sowie &raquo;Painting the Dutch Golden Century&laquo; hineinschreiben. F&uuml;r alle drei sollte man die Schriftart Gentium verwenden. Dabei ben&ouml;tigen wir eine Schriftgr&ouml;&szlig;e von 53&nbsp;pt f&uuml;r die Zahlen und von 31&nbsp;pt f&uuml;r den Textteil. Die Farbauswahl sollte etwa der in der Abbildung entsprechen &ndash; die entsprechenden Einstellungen vorzunehmen, sollte Ihnen nun nicht mehr schwerfallen. Und achten Sie einmal darauf, da&szlig; das Design trotz der verschiedenen Gr&ouml;&szlig;en und Farben einen gef&auml;lligen Eindruck macht, weil wir f&uuml;r alle Textelemente dieselbe Schriftart verwendet haben. Dies kann man sich f&uuml;r k&uuml;nftige Projekte merken.</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt18b.png"/></td></tr></table> 
<br>
<p>Um die Gestaltung der Titelseite abzuschlie&szlig;en, zeichnen wir nun eine gerade Linie. Dazu klickt man auf die Schaltfl&auml;che &raquo;Linie einf&uuml;gen&laquo; in der Symbolleiste und zieht die Maus von links nach rechts &uuml;ber die Seite, w&auml;hrend man gleichzeitig die Strg-Taste gedr&uuml;ckt h&auml;lt, um die Linie exakt horizontal zu positionieren. Anschlie&szlig;end &ouml;ffnet man die Palette &raquo;Eigenschaften&laquo; und dort die Ansicht &raquo;Linien&laquo;. Hier kann man zun&auml;chst verschiedene Breiten ausprobieren, um dann zur Ansicht &raquo;Farben&laquo; zu wechseln und die Liste mit den Linienfarben anzuzeigen (Schaltfl&auml;che mit dem Pinsel). Hier w&auml;hlen wir schlie&szlig;lich &raquo;WhiteSmoke&laquo; als Farbe aus.</p>

<p>Danach plazieren wir diese Linie genau zwischen den Textrahmen &raquo;1606&laquo; und &raquo;2006&laquo;.</p>


<h3>Schritt Vier: Hinzuf&uuml;gen des &raquo;Verlags&laquo;</h3>

<!-- O.N. das mit der Tilde entspricht wohl nicht ganz den Konventionen -- oder macht man das so unter Windows/Mac? Unter Linux ist das doch das home directory. -->
<p>Als Abschlu&szlig; m&ouml;chten wir den Verleger angeben und sein Logo einf&uuml;gen. Unsere entsprechende Firma nennen wir in aller Bescheidenheit &raquo;Scribus Publishing&laquo;. F&uuml;r unseren Zweck bedeutet dies, da&szlig; wir uns nicht wegen eines Logos den Kopf zerbrechen m&uuml;ssen, sondern einfach das von Scribus verwenden. Es befindet sich im Verzeichnis <code>~/share/scribus/icons</code>, wobei die Tilde f&uuml;r das Installationsverzeichnis von Scribus steht. Der entsprechende Dateiname ist <code>scribus.png</code>.</p>

<p>F&uuml;gen Sie nun am unteren Rand der Seite einen kleinen Bildrahmen ein, zwischen dem Seitenrand und dem Rahmen f&uuml;r die Abbildungen. Dabei sollten Sie darauf achten, da&szlig; als F&uuml;llfarbe &raquo;Keine&laquo; verwendet wird, denn die importierte Grafik verf&uuml;gt &uuml;ber einen transparenten Hintergrund. Wie schon zuvor wird die Datei mit einem Klick der rechten Maustaste importiert, indem man im Kontextmen&uuml; <i>Bild laden&hellip;</i> ausw&auml;hlt. Um zu verhindern, da&szlig; die Farben mit denen unseres Layouts in Konflikt geraten, rufen Sie den Dialog f&uuml;r die Bildeffekte auf, so wie oben unter &raquo;Schritt Zwei&laquo; beschrieben. Indem wir die Grafik nun in Graustufen verwandeln und gleichzeitig den Kontrast erh&ouml;hen, k&ouml;nnen wir sicherstellen, da&szlig; das Logo nicht mit dem Hintergrund verschmilzt und auch farblich nicht mit dem Rest kollidiert.</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt20.png"/></td></tr></table> 

<p>Um den Verlagsnamen hinzuf&uuml;gen, erzeugen Sie zun&auml;chst an einer beliebigen Stelle einen Textrahmen und vergeben hierf&uuml;r im Reiter &raquo;X,&nbsp;Y,&nbsp;Z&laquo; in der Palette &raquo;Eigenschaften&laquo; den Namen &raquo;ScribusPublishing&laquo;. Als Text geben Sie dann &raquo;Scribus Publishing&laquo; ein, und als Schriftart w&auml;hlen Sie &raquo;Bitstream Vera Sans&laquo;, mit der Gr&ouml;&szlig;e 13&nbsp;pt und in der Farbe &raquo;Grey97&laquo;.</p>

<p>Zum Schlu&szlig; mu&szlig; man den Text nur noch um 90 Grad drehen. Dies kann man wiederum im Reiter &raquo;X,&nbsp;Y,&nbsp;Z&laquo; der genannten Palette erledigen. Geben Sie dazu einfach unter &raquo;Drehung&laquo; den Wert &raquo;90&deg;&laquo; ein:</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Rembrandt21.png"/></td></tr></table> 

<p>Nun kann man den Textrahmen mit der Maus an eine Position oberhalb des Scribus-Logos verschieben. W&auml;hlen Sie zum Abschlu&szlig; <i>Datei &gt Speichern</i>, und vergeben Sie einen passenden Dateinamen. Sobald Sie auf &raquo;OK&laquo; geklickt haben, ist Ihr erstes Scribus-Dokument fertiggestellt! Wie man sieht, ist es nicht wirklich schwierig.</p>
<br>
<table width="100%"><tr><td align="center"><img src="images/Cover_en1-page1.png"/></td></tr></table>

<br>
<br>
</body>
</html>