<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Dokumenteinstellungen und Allgemeine Einstellungen</title>
</head>
<body>
<h2>Dokumenteinstellungen und Allgemeine Einstellungen</h2>
<p>Im <em>Datei</em>-Men&uuml; finden Sie zwei &auml;hnliche Eintr&auml;ge, n&auml;mlich <strong>Dokumenteinstellungen</strong> und <strong>Allgemeine Einstellungen</strong>. Jeder der beiden startet einen Dialog zum &Auml;ndern verschiedener Einstellungen und des Verhaltens von Scribus:</p>
<ul>
<li><strong>Dokumenteinstellungen</strong> bezieht sich auf das aktuelle Dokument. Alle &Auml;nderungen, die Sie hier vornehmen, werden in diesem Dokument gespeichert und angewandt, wenn Sie das Dokument &ouml;ffnen. Wenn kein Dokument ge&ouml;ffnet ist, k&ouml;nnen Sie diesen Men&uuml;punkt nicht anw&auml;hlen.</li>
<li><strong>Allgemeine Einstellungen</strong> bezieht sich in erster Linie auf Dokumente, die Sie zuk&uuml;nftig erstellen. Dar&uuml;ber hinaus k&ouml;nnen Sie hier auch Einstellungen vornehmen, die sich auf alle Dokumente auswirken, etwa die Sprache der Benutzeroberfl&auml;che. Der Dialog l&auml;&szlig;t sich auch dann aufrufen, wenn Sie kein Dokument ge&ouml;ffnet haben. Die folgende Beschreibung bezieht sich in erster Linie die Allgemeinen Einstellungen, aber wir werden auf die Unterschiede zu den Dokumenteinstellungen ber&uuml;cksichtigen.</li>
</ul>
<br>
<br>
<table cellpadding="5">
<tr><td width="200" valign="top"><ul>
<li><a href="#1"><strong>Allgemein</strong></a></li>
<li><a href="#2"><strong>Dokument</strong></a></li>
<li><a href="#3"><strong>Hilfslinien</strong></a></li>
<li><a href="#4"><strong>Typographie</strong></a></li>
<li><a href="#5"><strong>Werkzeuge</strong></a></li>
<li><a href="#6"><strong>Silbentrennung</strong></a></li>
<li><a href="#7"><strong>Schriften</strong></a></li>
<li><a href="#8"><strong>Druckvorstufen&uuml;berpr&uuml;fung</strong></a></li>
</ul></td>
<td width="300" valign="top"><ul>
</li>
<li><a href="#9"><strong>Farbmanagement</strong></a></li>
<li><a href="#10"><strong>PDF-Export</strong></a></li>
<li><a href="#11"><strong>Eigenschaften des Dokumentobjektes</strong></a></li>
<li><a href="#11"><strong>Inhaltsverzeichnisse und Indizes</strong></a></li>
<li><a href="#12"><strong>Tastenk&uuml;rzel</strong></a></li>
<li><a href="#13"><strong>Bibliothek</strong></a></li>
</ul></td>
<td valign="top"><ul>
<li><a href="#14"><strong>Anzeige</strong></a></li>
<li><a href="#15"><strong>Externe Tools</strong></a></li>
<li><a href="#16"><strong>Verschiedenes</strong></a></li>
<li><a href="#17"><strong>Plug-Ins</strong></a></li>
<li><a href="#18"><strong>Umbruchkontrolle</strong></a></li>
<li><a href="#19"><strong>Scripter</strong></a></li>
<li><a href="#20"><strong>Dokumentinformation</strong></a></li>
</ul></td></tr>
</table>
<h3><a name="1"></a>Allgemein (nicht verf&uuml;gbar in den Dokumenteinstellungen)</h3>
<p>Die <strong>Sprache</strong>, in der Scribus startet, ist normalerweise die des Betriebssystems bzw. der Desktop-Umgebung. Wenn f&uuml;r diese keine Scribus-&Uuml;bersetzung zur Verf&uuml;gung steht, startet Scribus in amerikanischem Englisch. F&uuml;r Deutsch gibt es drei Sprachvarianten: reformierte, herk&ouml;mmliche und Schweizer Orthographie. Die Sprache der Benutzeroberfl&auml;che wirkt sich auch auf andere Bereiche aus, so auf die Sprachversion dieser Online-Hilfe, der Silbentrennung, der Rechtschreibpr&uuml;fung, des Beispieltextes u.v.m. Der Wechsel der Sprachversion erfordert keinen Neustart von Scribus, sondern wird sofort wirksam.</p>
<p>Das <strong>Thema</strong> ist zun&auml;chst das Ihres Betriebssystems bzw. Ihrer Desktop-Umgebung, aber hier k&ouml;nnen Sie auch ein anderes f&uuml;r Scribus ausw&auml;hlen. Dabei ist die Auswahl je nach Betriebssystem verschieden. Sie k&ouml;nnen auch die Schriftgr&ouml;&szlig;e in Men&uuml;s und Dialogen &auml;ndern, und die &uuml;brigen Einstellungen im oberen Teil des Reiters sollten selbsterkl&auml;rend sein.</p>
<p>Die verschiedenen &raquo;Pfade&laquo; bezeichnen einige Standardverzeichnisse, die Scribus zus&auml;tzlich zu den voreingestellten oder statt dieser verwendet. Der Pfad zu Scripts legt das Verzeichnis fest, in dem Scribus standardm&auml;&szlig;ig nach Python-Programmen sucht, wenn Sie <i>Script&nbsp;&gt; Script ausf&uuml;hren</i> in der Men&uuml;leiste w&auml;hlen.</p><br>
<table width="90%"><tr><td align="center"><img src="images/prefs_general.png" align="center" alt="Allgemeine Einstellungen" title="Allgemeine Einstellungen" width="680"/></td></tr></table>
<h3><a name="2"></a>Dokument</h3>
<p>In den Allgemeinen Einstellungen legen Sie im &raquo;Dokument&laquo;-Reiter fest, welche Werte f&uuml;r Dokumente gelten sollen, wenn Sie <i>Datei&nbsp;&gt; Neu</i> klicken. In den Dokumenteinstellungen tun Sie dasselbe f&uuml;r das aktuelle Dokument. Die Einstellungen unter &raquo;Seitenformat&laquo; sollten selbsterkl&auml;rend sein. Zus&auml;tzlich zur (von den Spracheinstellungen abh&auml;ngigen) Standardgr&ouml;&szlig;e und benutzerdefinierten Abmessungen bietet Scribus eine gro&szlig;e Zahl an standardisierten Papierformaten. Die Optionen for das &raquo;Dokumentlayout&laquo; haben bei manchen Anwendern f&uuml;r Irritationen gesorgt. Hier legen Sie fest, wieviele Seiten nebeneinander angelegt werden, was auch f&uuml;r die PDF-Ausgabe wichtig ist. Sie legen <b>nicht fest</b>, wie eine einzelne Seite aufgeteilt wird, d.h. wenn Ihr Seitenformat A4 ist und Sie &raquo;4fach gefaltet&laquo; w&auml;hlen, werden immer vier A4-Seiten nebeneinander angeordnet und nicht eine A4-Seite in vier Bereiche unterteilt. &raquo;Doppelseite&laquo; ist das typische Layout f&uuml;r ein Buch oder eine Zeitschrift, weshalb hier die Voreinstellung f&uuml;r die erste Seite &raquo;Rechte Seite&laquo; lautet (denn die erste Seite ist so gut wie immer eine rechte Seite).</p>
<table width="90%"><tr><td align="center"><img src="images/prefs_document.png" align="center" alt="Standard-Dokumenteinstellungen" title="Standard-Dokumenteinstellungen"  width="680" /></td><td width="275"><img src="images/prefs_document1.png" width="250"><p>Hier sehen Sie ein Beispiel f&uuml;r ein doppelseitiges Dokumentlayout mit einer ersten rechten Seite. Wenn Sie diese Datei auf einem B&uuml;rodrucker ausdrucken, wird jede Seite einzeln gedruckt.</td></tr></table>
<p>Um Unterreiter &raquo;R&auml;nder&laquo; finden Sie sogenannte Standard-Layouts, die allerdings nicht f&uuml;r ein Einzelblatt-Dokumentlayout zur Verf&uuml;gung stehen, weil sie in diesem Fall sinnlos w&auml;ren. Es handelt sich dabei um mit mathematischen Methoden berechnete Seitenr&auml;nder, die sich im Laufe der Jahrhunderte vor allem im Buchdruck bew&auml;hrt haben. Nachfolgend sehen Sie die Unterschiede zwischen den verschiedenen Modellen, demonstriert an der rechten Seite eines doppelseitigen Dokumentes:</p>
<p><table cellpadding="3"><tr>
<td align="center"><img src="images/prefs_gutenberg.png"><p>Gutenberg</td><td align="center"><img src="images/prefs_magazine.png"><p>Zeitschrift</td><td align="center"><img src="images/prefs_fibonacci.png"><p>Fibonacci</td><td align="center"><img src="images/prefs_goldenmean.png"><p>Goldener Schnitt</td><td align="center"><img src="images/prefs_9parts.png"><p>Neunerteilung</td>
</tr></table>
<p><i>Bitte beachten Sie, da&szlig; &Auml;nderungen des Seitenformates und des Standardlayouts in einem existierenden Dokument nur auf neue Seiten angewandt werden. Um diese Einstellung f&uuml;r bereits vorhandene Seiten zu &auml;ndern, m&uuml;ssen Sie jede Seite einzeln markieren und dann den Men&uuml;punkt</i> Seite&nbsp;&gt; Eigenschaften der Seite bearbeiten <i>aufrufen</i>.</p>
<p>Im Reiter &raquo;Anschnitt&laquo; legen Sie die Beschnittzugabe nach den Vorgaben Ihrer Druckerei fest.</p>
<h3><a name="3"></a>Hilfslinien</h3>
<p>In diesem Bereich k&ouml;nnen Sie weit mehr als nur Hilfslinieneinstellungen treffen. Hilfslinien k&ouml;nnen entweder &uuml;ber oder unter Dokumentinhalten liegen. Unter &raquo;Einrasten&laquo; legen Sie fest, ab welcher Entfernung Objekte von Hilfslinien &raquo;eingefangen&laquo; werden, wenn die entsprechende Funktion aktiviert wurde, und wie weit der Mauszeiger von Objektanfassern entfernt sein darf, um sie zu bewegen. Damit &Auml;nderungen unter &raquo;Einrasten&laquo; wirksam werden, m&uuml;ssen Sie Scribus neu starten.</p>
<p>Weiterhin legen Sie hier die Farben von Hilfslinien, Seitenrandlinien, des Seitenrasters und des Grundlinienrasters fest, au&szlig;erdem die Werte f&uuml;r das Grundlinienraster:</p>

<table width="90%"><tr><td align="center"><img src="images/prefs_guides.png" alt="Einstellungen für Hilfslinien und das Seitenraster" align="middle" title="Einstellungen für Hilfslinien und das Seitenraster" /></td></tr></table>
<table width="80%"><tr><td valign="top"><p>Standardm&auml;&szlig;ig werden Hilfslinien und Seitenrandlinien angezeigt, aber dies k&ouml;nnen Sie hier &auml;ndern. Die beiden Seitenraster (Gitter) werden in der Voreinstellung nicht angezeigt &ndash; in der Abbildung rechts wurden die Standardfarben ge&auml;ndert, so da&szlig; Sie die Unterschiede zu den Standardeinstellungen sehen k&ouml;nnen: Seitenr&auml;nder in rot, Seitenrandlinien in blau, das gro&szlig;e Seitenraster in gr&uuml;n und das kleine in magenta.</p> 
<p>Im unteren Bereich des Dialogs legen Sie die Einstellungen f&uuml;r das Grundlinienraster fest. &Uuml;ber letzteres erfahren Sie mehr im Kapitel &uuml;ber <a href="WwText.html#10">Textrahmen</a>.</td>
<td><img src="images/prefs_guides1.png"></td>
</tr>
</table>

<h3><a name="4"></a>Typographie</h3>
<p>Hier finden Sie die Standardeinstellungen f&uuml;r verschiedene typographische Funktionen, n&auml;mlich die Werte f&uuml;r hochgestellte und tiefgestellte Zeichen, Unter- und Durchstreichungen, k&uuml;nstliche Kapit&auml;lchen und den automatischen Zeilenabstand. Diese Angaben sind alle in Prozent, da Sie sich auf die jeweilige Schriftgr&ouml;&szlig;e beziehen.</p>
<p><em>Beachten Sie, da&szlig; der Prozentwert unter &raquo;Automatischer Zeilenabstand&laquo; den Wert zus&auml;tzlich zur Schriftgr&ouml;&szlig;e bezeichnet, 20% also eigentlich 120% bedeutet.</em></p>
<p><table width="90%"><tr><td align="center"><img src="images/prefs_typog.png" align="center" alt="Der Typographie-Reiter"/></td></tr></table>

<h3><a name="5"></a>Werkzeuge</h3>
<p>Im Reiter &raquo;Werkzeuge&laquo; k&ouml;nnen Sie die Standardeinstellungen f&uuml;r die verschiedenen Rahmentypen &auml;ndern. Was sie im einzelnen bedeuten, wird deutlich, wenn Sie die Abschnitte zu den Rahmentypen gelesen haben. Dar&uuml;ber hinaus finden Sie hier Einstellungen zu Vergr&ouml;&szlig;erungsstufen und zu diversen objektbezogenen Aktionen.</p>

<table width="100%">
<tr><td align="center"><img src="images/prefs_tools.png" alt="Werkzeug-Reiter"/></td>
<td><img src="images/prefs_tools1.png"/></tr>
<tr><td align="center"><img src="images/prefs_tools2.png" alt="Werkzeug-Reiter"/></td>
<td><img src="images/prefs_tools3.png"></tr>
<tr><td align="center" colspan="2"><img src="images/prefs_tools4.png" alt="Werkzeug-Reiter"/></td></tr>
<tr><td align="center"><img src="images/prefs_tools5.png">
<td align="center"><img src="images/prefs_tools6.png" alt="Werkzeug-Reiter"/></td></tr>
</table>

<h3><a name="6"></a>Silbentrennung</h3>
<p>Siehe dazu den Abschnitt <a href="hyphenator.html">Silbentrennung</a>.</p>

<h3><a name="7"></a>Schriften</h3>
<p>Siehe dazu die <a href="fonts1.html">Dokumentation zur Schriftenverwaltung</a>. Diese sollten Sie unbedingt lesen, um Probleme in Druckerei zu vermeiden.</p>

<h3><a name="8"></a>Druckvorstufen&uuml;berpr&uuml;fung</h3>
<p>Siehe dazu die Abschnitte &uuml;ber die <a href="print2.html">Druckwerkzeuge</a>.</p>

<h3><a name="9"></a>Farbmanagement</h3>
<p>Siehe dazu die <a href="cms.html">Dokumentation zum Farbmanagement</a>.

<h3><a name="10"></a>PDF-Export</h3>
<p>Siehe dazu die <a href="pdfexport1.html">PDF-Dokumentation</a>.</p>

<h3><a name="11"></a>Eigenschaften des Dokumentobjektes</h3>
<p>Au&szlig;er zum Speichern zus&auml;tzlicher Informationen &uuml;ber ein Objekt ist dieser Teil des Dialogs v.a. im Zusammenhang mit dem Erstellen eines Inhaltsverzeichnisses von Nutzen.</p>
<h3>Inhaltsverzeichnisse und Indizes</h3>
<p>Diese beiden Unterdialoge sind aufeinander bezogen, und eine der beiden Funktionen finden Sie <a href="http://wiki.scribus.net/index.php/Creating_a_Table_of_Contents">hier</a> beschrieben.</p>

<h3><a name="12"></a>Tastenk&uuml;rzel</h3>

<table width="90%"><tr><td align="center"><img src="images/prefs_keyboard.png" alt="Tastenk&uuml;rzel festlegen" title="Tastenk&uuml;rzel festlegen"/></td></tr></table>

<p>Hier sehen Sie die zugeordneten Tastaturk&uuml;rzel, die sich jederzeit &auml;ndern lassen. Au&szlig;erdem k&ouml;nnen Sie auch neue K&uuml;rzel eingeben. Neu festgelegte K&uuml;rzel k&ouml;nnen Sie in eine XML-Datei exportieren, die sich auf einem anderen Computer benutzen l&auml;&szlig;t. Die Dateiendung einer solchen Datei lautet *.ksxml. Es handelt sich dabei um eine Unicode-Datei, die plattform&uuml;bergreifend funktionieren sollte, abgesehen davon, da&szlig; Macs eine Options- und eine Metataste besitzen, w&auml;hrend Linux, UNIX, OS/2, eComStation und Windows alle dieselben PC-Tastaturen verwenden.</p>

<h3><a name="13"></a>Bibliothek</h3>
<p>In Bibliotheken speichern Sie Objekte aller Art, die Sie h&auml;ufiger ben&ouml;tigen. Bibliotheken k&ouml;nnen entweder mit einem Dokument oder als separate Dateien gespeichert werden, die von anderen Dokumenten oder Anwendern genutzt werden. Die Endung einer solchen Datei ist *.scs. Hier k&ouml;nnen Sie festlegen, ob Objekte aus der Zwischenablage automatisch in die Standardbibliothek kopiert werden, ob diese auch nach einem Neustart zur Verf&uuml;gung stehen sollen und wieviele Objekte eine einzelne Bibliothek enthalten darf.</p>
<h3><a name="14"></a>Anzeige (nicht alle Optionen verf&uuml;gbar in den Dokumenteinstellungen)</h3>
<p>Die meisten Eintr&auml;ge in hier d&uuml;rften selbsterkl&auml;rend sein. Je nachdem wie gro&szlig; Ihr Monitor ist, k&ouml;nnen Sie hier Ihre Arbeitsfl&auml;che anpassen. Wenn Sie beispielsweise mit einem sehr gro&szlig;en Monitor arbeiten, k&ouml;nnen Sie Scribus ein Dokument in Originalgr&ouml;&szlig;e anzeigen lassen. Den Vergr&ouml;&szlig;erungsfaktor k&ouml;nnen Sie unter <em>Werkzeuge > Vergr&ouml;&szlig;erung</em> einstellen.</p>

<table width="90%"><tr><td align="center"><img src="images/prefs_display.png" alt="Einstellungen f&uuml; die Anzeige" title="Einstellungen f&uuml; die Anzeige" /></td></tr></table>

<p>Im Reiter &raquo;Farben&laquo; k&ouml;nnen Sie die Farben f&uuml;r bestimmte Bildschirmfeatures wie Seitenrandlinien, oder Steuerzeichen festlegen. In den Dokumenteinstellungen k&ouml;nnen Sie hier nur die &raquo;F&uuml;llfarbe&laquo; einer Seite, d.h. die Bildschirmfarbe einer Seite ausw&auml;hlen. Diese Farbe wird nicht gedruckt und dient dazu, den Druck auf farbigem Papier zu simulieren.</p>
<h3><a name="15"></a>Externe Tools</h3>
<p>Hier stellen Sie den Speicherort f&uuml;r Ghostscript und andere externe Programme ein. Wenn Sie Ghostscript vor Scribus installiert haben, findet Scribus das Programm normalerweise automatisch. Falls Sie eine Fehlermeldung erhalten, die besagt, da&szlig; EPS-Dateien nicht importiert werden k&ouml;nnen, obwohl Sie Ghostscript installiert haben, k&ouml;nnen Sie hier das richtige Verzeichnis eingeben.</p>
<h4>Ghostscript</h4>
<p><strong>Linux, UNIX, OS/2, eComStation, Haiku und Windows:</strong></p>
<table width="90%"><tr><td align="center"><img src="images/prefs_exttools.png" alt="Einstellungen f&uuml;r externe Tools" title="Einstellungen f&uuml;r externe Tools" width="680" /></td></tr></table>
<p>Der Bildschirmschnappschu&szlig; wurde unter Linux erstellt und gilt prinzipiell auch f&uuml;r andere UNIX-Systeme. Siehe auch die Informationen zu <a href="readme-win32.html">Windows</a>, <a href="readme-haiku.html">Haiku</a> sowie <a href="readme-os2.html">OS/2 und eComStation</a>. Zus&auml;tzliche Informationen zu Ghostscript finden Sie <a href="toolbox7.html">hier</a>.</p>
<p><strong>Mac OS X</strong></p>
<table width="100%"><tr><td align="center"><img src="images/prefs-mac-1.png" alt="Einstellungen f&uuml;r externe Tools" title="Einstellungen f&uuml;r externe Tools" /></td></tr></table>
<p>Hier sehen Sie die empfohlenen Einstellungen f&uuml;r Mac OS X, vorausgesetzt, Sie haben das Ghostscript-Framework korrekt <a href="readme-macosx.html">installiert</a>.</p>
<h4>Andere externe Tools</h4>
<p><strong>Bildbearbeitungsprogramm</strong></p>
<p>Sie sind nicht auf GIMP beschr&auml;nkt, sondern k&ouml;nnen jedes andere Bildbearbeitungsprogramm wie Krita oder Photoshop aus Scribus heraus starten. Weil GIMP jedoch das popul&auml;rste Open-Source-Bildbearbeitungsprogramm ist, finden Sie es voreingestellt.</p>
<p><strong>Webbrowser</strong></p>
<p>Hier legen Sie fest, welchen Browser Sie verwenden m&ouml;chten, wenn Sie einen externen Link in dieser Dokumentation anklicken oder auf externe Ressourcen aus dem <i>Hilfe</i>-Men&uuml; zugreifen.</p>
<p><strong>Render Frames</strong></p>
<p>Siehe dazu den Abschnitt &uuml;ber <a href="WwRenderframes.html">Renderrahmen</a>.</p>


<h3><a name="16"></a>Verschiedenes</h3>
<table width="80%"><tr><td align="center"><img src="images/prefs_misc.png" title="Verschiedenes"></td></tr></table>
<p>Hier finden Sie verschiedene textbezogene Einstellungen, die selbsterkl&auml;rend sind.</p>
<h3><a name="17"></a>Plug-Ins</h3>
<p>Dieser Bereich dient nur zu Ihrer Information. Sie k&ouml;nnen hier u.a. feststellen, ob sich alle Plug-ins aktivieren lie&szlig;en. Wenn letzteres nicht der Fall ist, kann dies an einer fehlenden Programmbibliothek liegen.</p>

<h3><a name="18"></a>Umbruchkontrolle</h3>
<p>Siehe dazu die <a href="short-words.html">Dokumentation zur Umbruchkontrolle</a>. </p>

<h3><a name="19"></a>Scripter</h3>
<p>Siehe dazu die <a href="scripter1.html">Scripter-Dokumentation</a>.</p>

<h3><a name="20"></a>Dokumentinformation (Verf&uuml;gbar in den Dokumenteinstellungen, aber nicht in den Allgemeinen Einstellungen)</h3>
<p>Siehe dazu den Abschnitt &uuml;ber die <a href="docinfo.html">Dokumentinformation</a>.</p>

<h3>Wo befinden sich die Konfigurationsdateien?</h3>
<p>Die Konfigurationsdateien von Scribus sind in einem versteckten Verzeichnis namens <code>.scribus</code> gespeichert. Dieses befindet sich je nach Betriebssystem an einem anderen Ort:</p>
<ul>
<li><strong>Linux/UNIX:</strong> <code>/home/username/.scribus</code></li>
<li><strong>Mac OS X:</strong> <code>User/username/.scribus</code></li>
<li><strong>OS/2 und eComStation</strong>: <code>X:\SCRIBUS-1.4.x-OS2-date\scribus\.scribus</code></li>
<li><strong>Haiku</strong>: <code>/boot/home/config/settings/Qt/.scribus</code></li>
<li><strong>Windows:</strong> <code>C:\Dokumente und Einstellungen/username/.scribus</code></li>
</ul>
<p>Innerhalb dieses Verzeichnisses gibt es u.a. die Dateien <code>scribus140.rc</code>, <code>checkfonts.xml</code> (in der die Einstellungen f&uuml;r Schriften gespeichert sind) sowie <code>prefs140.xml</code>. Alle diese Dateien sind XML-Dateien, so da&szlig; Sie deren Inhalt mit einem Texteditor betrachten und bearbeiten k&ouml;nnen. Wenn Sie Python installiert haben, finden Sie dort auch eine Datei mit dem Namen <code>scripter.rc</code>, in der die zuletzt verwendeten Scripts gespeichert werden. Dar&uuml;ber hinaus gibt es zus&auml;tzliche Unterverzeichnisse, die weitere Scribus-Daten enthalten. Wenn sich Scribus pl&ouml;tzlich unerwartet oder fehlerhaft verh&auml;lt, kann es hilfreich sein, das Verzeichnis <code>.scribus</code> <b>umzubenennen</b>, aber es nicht zu l&ouml;schen. Siehe dazu die Informationen zur <a href="fileproblems.html">Problembehebung</a>.</p>

<hr>
<p>Siehe auch</p>
<ul>
<li><a href="fonts1.html">Font Setup</a></li>
<li><a href="hyphenator.html">Hyphenation</a></li>
<li><a href="docinfo.html">Document Information</a></li>
<li><a href="short-words.html">Short Words Plug-in</a></li>
<li><a href="color2.html">Managing Colors</a></li>
<li><a href="WwRenderframes.html">Working with Render Frames</a></li>
</ul>
</body>
</html>
