<qt>
<title>Scribus-Spezifikationen</title>
<h2>Scribus-Spezifikationen</h2>
<h3>&Uuml;berblick</h3>
<p>Scribus ist ein quelloffenes, plattform&uuml;bergreifendes Seitengestaltungprogramm (DTP). Urspr&uuml;nglich f&uuml;r Linux entwickelt, ist Scribus ebenfalls unter Mac&nbsp;OS&nbsp;X, Windows 2000/XP sowie OS/2 bzw. ecomStation installierbar und lauff&auml;hig. Ziel des Scribus-Teams ist es, professionelles Seitenlayout auch f&uuml;r Anf&auml;nger zug&auml;nglich zu machen, ohne da&szlig; der Support f&uuml;r professionelle DTP-Funktionen wie Schmuckfarben, CMYK-Farben, hochwertige PDF-Erzeugung, Import/Export von EPS und das Erstellen von Farbausz&uuml;gen eingeschr&auml;nkt ist.</p>
<h3>Eigenschaften von Dokumenten:</h3>
<!--goals goal-->
<ul>
 <li>Scribus kann viele verbreitete Textformate importieren, einschlie&szlig;lich OASIS (Open Document) und dem DOC-Format von MS Word (mit Hilfe von Antiword).</li>
 <li>Unterst&uuml;tzt werden Unicode-Text und -Schriftarten, einschlie&szlig;lich Text mit gegenl&auml;ufiger Schreibrichtung f&uuml;r Arabisch und Hebr&auml;isch mittels FreeType2.</li>
 <li>Rahmen, sichtbar und verborgen; Unterst&uuml;tzung abgerundeter Kanten und Ecken f&uuml;r Text und Objekte, dreh- und skalierbar.</li>
 <li>Seitenvorlagen &ndash; Seitenpaletten erm&ouml;glichen ein leichtes Seiten-Management.</li>
 <li>F&uuml;r das ganze Dokument g&uuml;ltige Ebenen &ndash; editierbar, mit verschiebbaren Elementen.</li>
 <li>Absatzvorlagen mit zahlreichen Optionen f&uuml;r Text- und Absatzstil (Ausrichtung, Schriftarten)</li>
 <li>Manuelles Unterschneiden von Zeichens&auml;tzen und bei eingebetteten Schriftarten in allen Dokumenten (einschlie&szlig;lich PDF-Dateien) m&ouml;glich.</li>
 <li>Verlinken, Gruppieren, Verschieben, Sperren und Gr&ouml;&szlig;en&auml;nderung von Objekten sowie Umwandeln in andere Objektarten.</li>
 <li>R&auml;nder, Hilfslinien und Einrastfunktion; benutzerdefinierbar, sowohl verborgen als auch sichtbar.</li>
<li>Ausgereifte Schriftsatzfunktionen, darunter manuelles Unterschneiden, optischer Randausgleich, sowie Optionen zur Veränderung der Zeichen- und Wortabstände.</li>
<li>Die neue Version 1.3.5 wird LaTeX-Rahmen enthalten, so daß Sie LaTeX-Formeln und andere Inhalte direkt in Rahmen importieren können.</li>
</ul>

<h3>Professionelle DTP-Funktionen:</h3>
<ul>
 <li>CMYK-Farbmodell einschlie&szlig;lich Bildvorschau mittels ICC-Farbmanagement sowie Einbettung von ICC-Profilen in PDF-Dokumenten, damit die Bildschirmfarben exakt dem Druckergebnis entsprechen. Scribus unterst&uuml;tzt die vorgeschlagene openICC-Spezifikation f&uuml;r Profile.</li>
 <li>Erzeugung von CMYK- und RGB-Halbtonvorlagen f&uuml;r PostScript.</li>
 <li>Erstellung anspruchsvoller PDF-Dokumente, einschlie&szlig;lich interaktiver PDF-Formulare. Es werden nahezu alle PDF-Feldtypen und JavaScript-Aktionen unterst&uuml;tzt.</li>
 <li>Die F&auml;higkeit zur Ausgabe auf professionelle Belichtern, einschlie&szlig;lich fortschrittlicher Postscript-Ger&auml;te (Level 3/PDF 1.4).</li>
 <li>Import von Encapsulated PostScript mit Vorschau auf der Seitenarbeitsfl&auml;che / EPS-Export.</li>
 <li>Uneingeschr&auml;nkte Unterst&uuml;tzung der Level 2 PostScript-Ausgabe, einer Untermenge von Level 3 sowie der Funktionen und M&ouml;glichkeiten von PDF 1.4, wie Transparenz, Farbverl&auml;ufen und 128-Bit-Verschl&uuml;sselungssicherheit.</li>
 <li>Volle Einhaltung der PDF/X-3-Spezifikation, einem ISO-Standard zum Erzeugen &quot;druckfertiger&quot; PDF-Dateien &ndash; eine Priori&auml;t f&uuml;r jedes DTP-Programm.</li>
 <li>Unterst&uuml;tzt werden das Einbetten von Schriftarten oder Schriftart-Untermengen sowohl in Postscript als auch beim PDF-Export.</li>
 <li>Scribus kann alle unterst&uuml;tzten Zeichen in PostScript-Umri&szlig;linien umwandeln und sp&auml;ter selbst bearbeiten.</li>
</ul>

<h3>Benutzerfreundliche Funktionalit&auml;t:</h3>
<ul>
 <li>Drag &amp; Drop mit KDE 3, einschlie&szlig;lich einer Drag-&amp;-Drop-Bibliothek f&uuml;r h&auml;ufig benutzte Elemente wie Textbl&ouml;cke, Bilderlogos, Hintergr&uuml;nde etc.</li>
 <li>Onlinehilfe-Browser mit ausf&uuml;hrlicher und st&auml;ndig aktualisierter Dokumentation (in Englisch, Deutsch und Französisch) und fertigen Beispieldateien.</li>
 <li>Benutzerfreundliche Werkzeuge und Paletten f&uuml;r Ma&szlig;e, Rotation und andere Objekteigenschaften</li>
 <li>Es werden sowohl TrueType, Type 1-PostScript als auch OpenType-Schriftarten vollst&auml;ndig unterst&uuml;tzt.</li>
 <li>Benutzerdefinierbare Tastaturk&uuml;rzel</li>
 <li>Auswahl zwischen 27 verschiedenen Sprachen, ohne da&szlig; neu kompiliert werden mu&szlig;.</li>
 <li>Anspruchsvolle automatische Silbentrennung in verschiedenen Sprachen.</li>
 <li>Benutzerfreundliche Zeichenwerkzeuge f&uuml;r gebr&auml;uchliche Formen wie Freihandlinien, Linien, Kurven, Ellipsen, Bézierkurven, Polygone etc.</li>
 <li>Ausf&uuml;hrliche und konfigurierbare Benutzer-Voreinstellungen f&uuml;r das jeweilige Dokument und die Applikation selbst.</li>
</ul>

<h3>Dateiformate:</h3>
<ul>
 <li>Das Scribus 1.2.x eigene Dateiformat ist vollst&auml;ndig dokumentiert und basiert auf XML. Das aktuelle Format 1.3.x ist ein tempor&auml;res Format, das rechtzeitig zum Erscheinen der n&auml;chsten stabilen Version eine vollständige DTD (Document Type Definition) haben wird. </li>
 <li>EPS (Encapsulated PostScript), JPEG (Joint Photographic Experts Group), PNG (Portable Network Graphics), TIFF (Tag Image File Format) und XPM (XpixMap). Die Unterst&uuml;tzung von PSD schlie&szlig;t duplex/triplex/quadruplex, Ebenen und Beschneidungspfade ein. Ddie Unterst&uuml;tzung von 16-Bit-TIFF und PSD-Dateien befindet sich in der Erprobungsphase.</li>
 <li>Scribus ist auch in der Lage, wohlgeformtes SVG 1.0 (Scalable Vector Graphics) zu im- und exportieren, einschlie&szlig;lich Text mit Pfadausrichtung, Bildern und Text. Scribus kann s&auml;mtliche Funktionen und Eigenschaften eines Scribus-Dokuments nach SVG exportieren. Bei diesem Vorgang werden vorhandene Bilder nach PNG exportiert.</li>
 <li>Scribus kann Text mit vielen verschiedenen Kodierungen, darunter Unicode, importieren. Hinzu kommen OpenOffice.org 1.x, OASIS Open Document Writer und Draw-Dateien. Stile und Formatierungen bleiben beim Import erhalten. </li>
<!--removed support for -->
</ul>

<h3>Architektur</h3>
<ul>
 <li>Entwickelt mit GPL QT 3 f&uuml;r Linux und &quot;Unix-&auml;hnliche&quot; Betriebssysteme. Scribus läuft außerdem  nativ unter Mac&nbsp;OS&nbsp;X, OS/2 und Windows 2000 oder neueren Versionen (Win9x und WinME werden nicht unterstützt).</li>
 <li>Plug-in-Unterst&uuml;tzung und Programmierschnittstelle (API) mit Im- und Export-Plugins. </li>
 <li>Leistungsf&auml;higes Python-Skript-Plug-in zur Erweiterung der Scribus-Funktionen, zur Automatisierung von Aufgaben und zum Aufrufen externer Programme aus Scribus heraus.</li>
</ul>
<h3>Einsatzbereiche:</h3>
<ul>
 <li>Entw&uuml;rfe f&uuml;r Newsletter, Firmenbriefpapier, Poster, Schulungsunterlagen, technische Dokumentationen, Visitenkarten und andere Dokumente, die nicht nur eine flexible Aufmachung bzw. anspruchsvolle Bildbehandlung erfordern, sondern auch eine exakte Drucksteuerung und eine Bildskalierung, mit der g&auml;ngige Textverarbeitungen nicht aufwarten k&ouml;nnen.</li>
 <li>Anwender, die die F&auml;higkeit zur Ausgabe auf professionelle Plattenbelichter ben&ouml;tigen, und zur Wiederverwendung f&uuml;r interne Druckzwecke bzw. über das Internet verbreitete PDF-Dokumente oder Pr&auml;sentationen.</li>
 <li>Anwender, die interaktive PDF-Formulare f&uuml;r Pr&auml;sentationen und CGI-Skript-Formulareingaben via PDF ben&ouml;tigen.</li>
</ul>
</qt>