<qt>
<title>Andere PDF-Betrachter</title>
<h2>Andere PDF-Betrachter</h2>
<p>Ein weiterer n&uuml;tzlicher PDF-Betrachter, der sich f&uuml;r Scribus eignet, ist GSview - eigentlich ein grafischer Betrachter-Aufsatz f&uuml;r GhostScript. Die j&uuml;ngste Version (4.7) mit GhostScript ab Version 8.15 kooperiert sehr ordentlich und kann nicht nur PS nach PDF umwandeln, sondern auch EPS, PS und PDF-Dateien anzeigen und konvertieren - neben anderen Funktionen. Die Version 4.3 ist die erste, die wirklich gut unter Linux funktioniert (urspr&uuml;nglich war sie f&uuml;r ein anderes Betriebssystem entwickelt). Weitere Einzelheiten finden sich unter <a href="gsview.html">GSview und Scribus</a>.</p>
<p><strong>Kpdf 3.4.3 / Xpdf </strong> Die k&uuml;rzlich in KDE 3.4 erschienene KPDF-Version zeigt mir, da&szlig; es die Entwickler &quot;schaffen&quot;. Auf XPDF 3.x basierend, zeigt sie viele h&uuml;bsche Ans&auml;tze und ist offenbar recht flott in der Darstellungsumsetzung. Dies sage ich nicht als ein KDE-J&uuml;nger, sondern nach kurzem Einsatz im Vergleich zu den gr&ouml;&szlig;eren Adobe Readers. Hier noch der Hinweis, da&szlig; Sie in den &quot;Einstellungen&quot; nachschauen und die Leistungsoptionen aktivieren sollten, falls Sie &uuml;ber den erforderlichen Speicher verf&uuml;gen, denn das bewirkt einen deutlichen Unterschied. Vielleicht m&ouml;gen Sie auch Xpdf 3.01 (nicht Version 3.00 ) von FooLabs, denn es enth&auml;lt Befehlszeilen-Tools zur Umwandlung von PDF nach PS. Um daf&uuml;r zu sorgen, da&szlig; Textdokumente in Xpdf korrekt dargestellt werden, sollten Sie in den Xpdf-Handbuchseiten (man pages) nachlesen, wie man die Font-Pfade mittels .xpdfrc-Datei richtig einstellt. Andernfalls werden eingebettete Schriftarten u.U. nicht richtig angezeigt. Eine bekannte Einschr&auml;nkung ist das Unverm&ouml;gen, Transparenz in von Scribus erzeugten PDF-Dokumenten anzuzeigen. Die Version 3.01 kann in einigen F&auml;llen PDF-Dateien richtig anzeigen, die Transparenz enthalten und aus Scribus exportiert sind.</p>
<p>Um einen Eindruck davon zu bekommen, was Scribus an tollen PDF-Tricks zu bieten hat, sollten Sie auf jeden Fall die Beispiel-Dokumente im Unterverzeichnis &quot;samples&quot; Ihrer aktuellen Scribus-Installation durchlesen. Maximieren Sie nun den Acrobat Reader, &ouml;ffnen Sie die Datei und folgen Sie den Anweisungen. Was nun geschieht, k&ouml;nnen Sie als das erste &quot;Easter Egg&quot; in Scribus betrachten.;)</p>
</qt>
