<qt>
<title>Ein Gl&auml;schen WINE mit Scribus</title>
<h2>Ein Gl&auml;schen WINE mit Scribus</h2>
<h3>&Uuml;bersicht</h3>
<p>Es ist einfach eine Tatsache, da&szlig; man in der Welt des Desktop Publishing manchmal plattform&uuml;bergreifend arbeiten mu&szlig;. Gl&uuml;cklicherweise &ndash; vor allem f&uuml;r Linux-Anwender &ndash; haben das WINE-Projekt und die Firma Codeweavers gro&szlig;e Fortschritte dabei gemacht, viele Windows-Programme unter Linux zum Laufen zu bringen.</p>
<p>Mein Hauptinteresse und der Schwerpunkt dieser Bemerkungen ist es, die jeweils neuesten Versionen des Adobe Reader und der Acrobat-Vollversion zu verwenden, um PDF-Dateien zu testen, die mit Scribus erzeugt wurden. Au&szlig;erdem verwende ich ab und zu das eine oder andere DOS- oder Windows-Dienstprogramm.</p>
<p>Seit ich meinen Arbeitsrechner auf Linux als Standardplattform umgestellt habe, habe ich es mit verschiedenen Windows-Anwendungen versucht, und ich beobachte das Projekt aus verschiedenen Gr&uuml;nden:</p>
<ol><li>Ich brauchte ein Buchhaltungsprogramm f&uuml;r Windows f&uuml;r meine eigene Firma, bis entsprechende Erweiterungen in GNUcash verf&uuml;gbar waren.</li>
<li>Ich mu&szlig; beruflich &Uuml;bungsmaterial f&uuml;r eine Reihe von Windows-Anwendungen testen und schreiben und versuche es zu vermeiden, deswegen Windows zu starten</li>
<li>Ich habe in der Vergangenheit VMware verwendet, und es ist hervorragend, aber leider manchmal auch sehr ressourcenhungrig.</li>
<li>Leider setzen viele Multimedia-Angebote im Internet eine Windows-Anwendung voraus.</li></ol>
<h3>Hinwiese und meine Erfahrungen</h3>
<p>Meiner Erfahrung nach funktionieren WINE-Pakete selten gut. Eine Ausnahme sind die Vorschauversionen von Codeweavers. Ich kompiliere WINE immer aus den Quelltexten. Normalerweise ver&ouml;ffentlicht das WINE-Projekt jeden Monat einen Schnappschu&szlig;. Das Kompilieren von WINE verl&auml;uft etwas anders als das gewohnte</p>
<code>./configure &amp;&amp; make &amp;&amp; make install</code>
<p>Obwohl es nicht offensichtlich ist, kann man die WINE-Installationsscripte so verwenden, da&szlig; die Installation weit weniger schwierig ist. Wenn Sie das Tar-Archiv entpackt haben, wechseln Sie in das entsprechende Verzeichnis und f&uuml;hren Sie den Befehl <code>./tools/wineinstall</code> aus. Folgen Sie anschlie&szlig;end den Anweisungen. Das Kompilieren des Quellcodes dauert einige Zeit, und Sie tun es am besten, wenn Ihr Computer sonst nichts zu tun hat. Der Vorteil dieser Vorgehensweise ist, da&szlig; Ihre WINE-Installation Ihrer Soft- und Hardwareausstattung "auf den Leib geschneidert" ist. Meiner Meinung nach funktioniert WINE auf diese Weise zuverl&auml;ssiger.</p>
<p>Falls Sie partout nicht aus den Quellen kompilieren wollen, verwenden Sie RPM- oder DEB-Pakete von Codeweavers. Deren Version enth&auml;lt auch ein nettes grafisches Konfigurationswerkzeug zum Erstellen der Datei wine.conf, die den Schl&uuml;ssel zum guten Funktionieren von WINE darstellt.</p>
<p>Nach der installation ben&ouml;tigen Sie eine Datei namens wine.conf. Diese liegt im versteckten Verzeichnis .wine in Ihrem Home-Verzeichnis. &Ouml;ffnen Sie sie mit einem Texteditor und untersuchen Sie sie genau: kleine &Auml;nderungen, die Sie hier vornehmen, k&ouml;nnen erhebliche Auswirkungen auf Performance und Verl&auml;&szlig;lichkeit haben. All dies ist in er WINE-Dokumentation sorgf&auml;ltig kommentiert und dokumentiert.</p>
<p>Manchmal kann es passieren, da&szlig; eine neue Version Regressionen aufweist. Daher behalte ich normalerweise den alten Schnappschu&szlig;, bis ich mir sicher bin, da&szlig; der neue genausogut funktioniert. In den letzten Jahren bin ich ein- oder zweimal auf eine &auml;ltere Version umgestiegen, weil etwas nicht mehr funktioniert hat.</p>
<p>Nachteile: Die Druckfunktionen sind schlecht. Sie k&ouml;nnen Postscript erzeugen, das sp&auml;ter mit Hilfe von Ghostscript oder dem Distiller umgewandelt werden kann. WINE unterst&uuml;tzt CUPS, wenn Sie die richtigen Bibliotheken installiert haben, aber im allgemeinen ist dieser Teil des Codes ziemlich unausgereift.</p>
<p>Die gute Nachricht: Mit den WINE-Schnappsch&uuml;ssen der letzten Monate l&auml;uft Adobe Acrobat. Entfernen Sie nach der Installation das Verzeichnis mit dem Intertrust-Plug-in, bevor Sie Acrobat starten. Es handelt sich dabei um ein ziemlich fehlerhaftes Plug-in, mit dem man PDFs online kaufen kann. Wenn ich Acrobat f&uuml;r Firmen installiere, achte ich darauf, da&szlig; es nicht mitinstalliert wird, weil es die Ursache f&uuml;r viele Probleme ist. Der Distiller der Versionen 3 bis 5 l&auml;&szlig;t sich problemlos installieren und funktioniert einwandfrei, solange alle Pfade zu den Schriften gefunden werden. Ich habe hochaufl&ouml;sende CMYK-PDF-Dateien von 35 MB Gr&ouml;&szlig;e f&uuml;r den Druck ohne Probleme erzeugen k&ouml;nnen. Ich habe mir auch das kostenlose PDF-Inspektor-Plug-in von Callas-Software heruntergeladen. Ich verwende es, um zu testen, ob PDF/X-3-Dateien aus Scribus der Spezifikation entsprechen (sie taten das von Anfang an ;) )</p>
<p>Das Installieren von Anwendungen ist in letzter Zeit wesentlich zuverl&auml;ssiger geworden. Allerdings hat WINE manchmal Probleme mit benutzergesteuerten Installationen. Zuweilen m&uuml;ssen Sie die Standardeinstellungen verwenden, damit ein Programm richtig installiert wird.</p>
<h2>Die Alternativen</h2>
<h3>Crossover Office von <a href="http://www.codeweavers.com">Codeweavers</a></h3>
<p>Unter Versionen ab 3.0+ laufen zahlreiche Anwendungen ausgesprochen gut, darunter Photoshop 5,6,7, Illustrator 10 und Indesign 2.0.2. Die beiden letztgenannten sind auch unter Windows ziemlich ressourcenhungrig. Meiner Meinung nach bietet die Demoversion ein ausgefeiltes und leicht zu bedienendes Installationsprogramm, das die Konfiguration zum Kinderspiel macht.<a href="http://www.codeweavers.com">Codeweavers</a> hat bislang sehr viel zum Erfolg des WINE-Projektes beigetragen. Sie erhalten Crossover Office auch mit einigen Versionen der SUSE- und Xandros-Distributionen.</p>
<h3>Win4Lin von <a href="http://win4lin.net/content/">Netraverse</a></h3>
<p><em>Haftungsausschlu&szlig;: <a href="http://win4lin.net/content/">Netraverse</a> hat das Scribus-Team mit Sachleistungen gesponsert.</em> </p>
<p>Win4Lin erm&ouml;glicht es Ihnen, Windows 2000 oder XP unter Linux laufen zu lassen, indem es eine Abstraktionsebene verwendet, die eine fast native Geschwindigkeit bietet und nur wenige Beschr&auml;nkungen aufweist. Sie ben&ouml;tigen au&szlig;erdem eine lizenzierte Version von Windows 9x und starten das Installationsprogramm. Es funktioniert gut, und die meisten Win32-Anwendungen lassen sich damit ausf&uuml;hren.</p>

<p>Ich m&ouml;chte Sie nicht davon abhalten, beide Programme zu kaufen. Beide Firmen haben sich als anst&auml;ndige Mitglieder der Open-Source-Gemeinschaft erwiesen.</p>

<h3>Erfolg</h3>
<table width="100%"><tr><td align="center"><img src="images/acroreader5.1.png" alt="Acrobat Reader 5.1 under WINE" /></td></tr></table>

<p>Auch wenn Acrobat 5.0.5 von Codeweavers offiziell nicht unterst&uuml;tzt wird, l&auml;&szlig;t er sich sehr gut installieren und anwenden. Solange Linux von Softwareherstellern noch nicht so gut unterst&uuml;tzt wird wie andere Plattformen, ist WINE eine gute &Uuml;bergangsl&ouml;sung. Diese Bemerkungen waren hoffentlich n&uuml;tzlich f&uuml;r Ihre Arbeit mit Scribus.</p>
</qt>
