<qt>
<title>Inkscape</title>
<h2>Inkscape</h2>
<p><em>Haftungsausschlu&szlig;: Technisch betrachtet geh&ouml;re ich zum Inkscape-Team, wenn auch &uuml;berwiegend in Kooperationsangelegenheiten und als RPM-Paketbauer. Das w&auml;re an sich bedeutungslos, wenn Inkscape nicht so eine gro&szlig;artige Anwendung w&auml;re. Au&szlig;erdem ist das Inkscape-Team eine Truppe, mit der sich hervorragend zusammenarbeiten l&auml;&szlig;t. Die Inkscape-Entwicklung ist ein hervorragendes Beispiel f&uuml;r andere Open-Source-Projekte.</em></p>

<p>Nichtsdestoweniger wird Inkscape mehr und mehr zum f&uuml;hrenden freien Vektor- oder Illustrationsprgramm f&uuml;r SVG-Dateien. Das Inkscape-Team hat sehr viel M&uuml;he aufgewendet, damit die von Inkscape erzeugten Dateien den W3C-Spezifikationen entsprechen. Die j&uuml;ngste Version ist sehr weit fortgeschritten und enth&auml;lt neue Import-/Exportfunktionen, wobei einige noch etwas experimenteller sind als andere.</p>

<p>Zu seinen Gunsten mu&szlig; man sagen, da&szlig; es eine sehr anwenderfreundliche Benutzeroberfl&auml;che mit ausf&uuml;hrlichen Tooltips und ein paar wirklich gut gemachten Tutorien bietet. Fast jede Funktion ist &uuml;ber ein Tastaturk&uuml;rzel errreichbar (die Liste der K&uuml;rzel ist fast 10 Seiten lang). Genau wie bei Scribus werden Fehler schnell behoben, und die Entwickler stehen Anregungen f&uuml;r neue Funktionen und Erweiterungen sehr offen gegen&uuml;ber.</p>

<p>Das Beste an Inkscape ist jedoch seine Genauigkeit beim Umsetzen der SVG-Spezifikationen. Nein, es ist noch nicht perfekt, kein Programm ist das. Inkscape-SVGs scheinen sehr gut in anderen SVG-Anwendungen zu funktionieren, besser als diejenigen aus vielen anderen, auch teuren kommerziellen Programmen.</p>

<p>Inkscape-Zeichnungen lassen sich meist problemlos in Scribus importieren. Es gibt einige SVG-Features, die von Scribus noch nicht unterst&uuml;tzt werden (F&uuml;llmuster, Gau&szlig;scher Weichzeichner), aber in 99% Prozent der F&auml;lle, funktioniert es einfach. Wenn sich eine Datei nicht importieren l&auml;&szlig;t, versuchen Sie diese in Inkscape als "Normales SVG" zu speichern. Ein anderer Hinweis: Das SVG-Textmodell unterscheidet sich sehr vom PDF-/Postscript-Modell (meiner Ansicht nach eine der wenigen Schw&auml;chen der Spezifikation). Sparen Sie sich Texteingabe und Texteffekte f&uuml;r Scribus auf. Scribus bietet viele hervorragende Texteffekte und wird diese verl&auml;&szlig;lich ausgeben. Scribus verwendet die freetype2-Bibliothek, wodurch zahlreiche Effekte m&ouml;glich sind.</p>

<p>Obengesagtes bedeutet nicht, da&szlig; Inkscape etwas falsch macht, sondern nur, da&szlig; SVG und Postscript einige sehr verschiedene Herangehensweisen verwenden, die sich nicht so leicht vom einen ins andere Modell &uuml;bertragen lassen. Tats&auml;chlich ist die Unterst&uuml;tzung f&uuml;r SVG-Fontfunktionen, etwa beim Kerning und anderer fortgeschrittener Funktionen, in Inkscape hervorragend.</p>
</qt>
