brew 'cmake'
brew 'zlib'
brew 'icu4c'
brew 'xz'
brew 'cairo'
brew 'qt5'
brew 'little-cms2'
brew 'poppler' 
brew 'python'
brew 'python@2', link: false
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'fontconfig'
brew 'pkg-config'
brew 'boost'
brew 'freetype'
brew 'openssl'
# open-scene-graph
brew 'hunspell'
brew 'podofo'
brew 'ghostscript'
brew 'graphicsmagick'
brew 'harfbuzz'
brew 'librevenge'
brew 'libwpg'
brew 'libvisio'
brew 'libmspub'
brew 'libcdr'
brew 'libpagemaker'
brew 'libfreehand'
