<qt>
<title>Farbmanagement mit Scribus. Eine Einf&uuml;hrung</title>
<h2>Farbmanagement mit Scribus. Eine Einf&uuml;hrung</h2>

<h4>Das Farbmanagement aktivieren</h4>
<p>Damit das Farbmanagement richtig funktioniert, m&uuml;ssen die folgenden Programme verf&uuml;gbar sein:</p>
<ul><li>Die littlecms-Bibliotheken m&uuml;ssen vorhanden sein, und Scribus mu&szlig; mit lcms-Unterst&uuml;tzung kompiliert worden sein. Sie k&ouml;nnen dies kontrollieren, indem Sie <strong>Hilfe > &Uuml;ber Scribus</strong> aufrufen. Dort sollte C-C-T ... stehen. Das erste C bedeutet, da&szlig; Scribus mit littlecms-Unterst&uuml;tzung kompiliert worden ist. Unter Windows und MacOS&nbsp;X ist dies standardm&auml;&szlig;ig der Fall.</li>
<li>Sie ben&ouml;tigen <strong>mindestens</strong>  ein RGB- und ein CMYK-Profil. Scribus wird mit zwei Standardprofilen ausgeliefert, damit das Farbmanagement nach der Installation gleich funktioniert. In der Praxis ben&ouml;tigen Sie jedoch noch mehr, n&auml;mlich ein sRGB-Profil f&uuml;r die meisten Farben und eines pro Farb-Ein-/Ausgabeger&auml;t. Ein Monitorprofil erstellen Sie mit den entsprechenden Kalibrierungswerkzeugen. Au&szlig;erdem werden Sie einige CMYK-Profile f&uuml;r den kommerziellen Druck brauchen. Einige CMYK-Profile sind als "Druckstandards" bekannt, weil Sie allgemein verbreitete Grundeinstellungen f&uuml;r den kommerziellen Druck in Nordamerika und Europa enthalten. Am besten ist es, wenn Sie die Windows-Version des ICC-Profilpaketes von Adobe herunterladen und dessen Inhalt in das Verzeichnis $home/.colors/icc entpacken. Linux-Anwender k&ouml;nnen sich auch einige frei verwendbare Profile von der <a href="http://www.scribus.net/modules.php?op=modload&name=Downloads&file=index&req=viewdownload&cid=16">Scribus-Website</a> herunterladen</li>
<li>Scribus sucht Profile unter Linux standardm&auml;&szlig;ig in:
 <pre>$home/.color/icc</pre> and <pre>/usr/share/color/icc/ ,</pre>
es akzeptiert also eigene Profile ebenso wie systemweit vorhandende. Unter Windows oder MacOSX sucht Scribus in den daf&uuml;r vorgesehenen Systemordnern. In &auml;lteren Scribus-Versionen mu&szlig; man das entsprechende Verzeichnis manuell eingeben.</li>
<li>Wenn Farbmanagement f&uuml;r Sie etwas Neues ist, lesen Sie bitte die Dokumente <A href="http://www.scribus.net/index.php?name=Web_Links&req=viewlink&cid=4" id="links and documentation" onclick="links and documentation">hier</A>.</li></ul>
<h4>&Uuml;bersicht</h4>
<p>Das Ziel des Farbmanagements ist es, die Unterschiede zwischen Bildschirmfarben und gedruckten Farben zu verringern und au&szlig;erdem anzuzeigen, welche Farben au&szlig;erhalb des Gamuts liegen, d.h. in dem gew&auml;hlten Druckverfahren nicht wiedergegeben werden k&ouml;nnen. Dazu m&uuml;ssen Sie jedoch &uuml;ber ein Profil Ihres Druckers und Ihres Monitors verf&uuml;gen, das einigerma&szlig;en genau ist. F&uuml;r Neulinge und diejenigen, die mit anderen Anwendungen vertraut sind, k&ouml;nnen die Grundeinstellungen und deren Beschreibung ziemlich verwirrend sein. Wenn man die entsprechende Terminologie nicht kennt, ist es <strong>sehr</strong> leicht, die falschen Einstellunge auszuw&auml;hlen. Bilder sehen dann entweder auf dem Bildschirm oder im Druck schlecht aus. Viele Neulinge schalten dann das Farbmanagement einfach ab.</p>

<p>Um es kurz zu machen: <strong>Tun Sie das nicht!</strong> Wenn Sie die grundlegenden Konzepte einmal verstanden haben und Ihr Ausgabeziel kennen, werden Sie in der Lage sein, vorherzusagen und zu kontrollieren, wie Ihr Dokument aussieht, wenn es gedruckt wird. Das ist besonders dann hilfreich, wenn sp&auml;ter Im Offsetverfahren gedruckt wird oder wenn Sie hochaufl&ouml;sende PDF verschicken wollen. Soviel ich wei&szlig;, ist Scribus das erste Open-Source-Programm, das ein solches Farbmanagement anbietet. Die letzten CUPS-Versionen (seit 1.1.15) unterst&uuml;tzen jetzt nativen CMYK-Druck. Littlecms enth&auml;lt seit Version 1.15 viele neue Funktionen, die die F&auml;higkeiten von Scribus, Farbe korrekt wiederzugeben, erweitern und au&szlig;erdem eine bessere Performance erm&ouml;glichen.</p>

<p>Die notwendigen Schritte, um verl&auml;&szlig;liches Farbmanagement zu erm&ouml;glichen (Was Sie am Bildschirm sehen, ist das, was gedruckt wird):</p>

<ol>
	<li>Eignen Sie sich Grundwissen &uuml;ber Farbmanagementkonzepte und die zugeh&ouml;rige Terminologie. </li>
	<li>Legen Sie die Profile richtig an. Weiter unten finden Sie eine Liste der Farbwerkzeuge, die es f&uuml;r Linux gibt. Am wichtigsten ist es, ein genaues Monitorprofil zu erhalten. Die professionellen Profiler leisten hier exzellente Arbeit. <a href="moncal.html">Hier</a> finden Sie ein Howto zum Erstellen von ICC-Profilen mit LProf. <strong>Ohne richtiges Monitorprofil werden die Druckergebnisse und deren Vorschau am Bildschirm nicht genau genug sein.</strong> </li>
	<li>Wenn Ihre Bildbearbeitung es erlaubt, betten Sie Bildprofile in Ihre Bilddateien ein.</li>

</ol>

<p>Das Farbmanagementsystem in Scribus dient vor allem dazu, sogenannte "Softproofs" der Bilder in einem Dokument zu erm&ouml;glichen. Scribus zeigt auch Farben an, die au&szlig;erhalb des Gamuts liegen und nicht gedruckt werden k&ouml;nnen (die meisten Drucker k&ouml;nnen wesentlich weniger Farben ausgeben als ein Monitor). Scribus &auml;ndert die in Bilder eingebetteten Profile nicht. Einige Bildformate, darunter gl&uuml;cklicherweise auch PNG und TIFF, erlauben es, ICM- oder ICC-Profile einzubetten &ndash; die Fachbezeichnung lautet <strong><em>Tagged</em></strong>. Sp&auml;ter werden wir sehen, wann es angemessen ist, einen <strong>Tag</strong> oder ein Profil mit Hilfe von littlecms oder Photopaint einzubetten. Wenn eine Datei einen <strong>Tag</strong> enth&auml;lt, wird Scribus dank littlecms dieses Profil einlesen und es dazu verwenden, es korrekter darzustellen. Falls ein Bild kein Profil enth&auml;lt, Sie aber das zugeh&ouml;rige Ger&auml;teprofil kennen, k&ouml;nnen Sie die Farbmanagement-Einstellungen dazu verwenden, dieses Bild korrekt darzustellen, indem Sie ihm im Dokument vor&uuml;bergehend dieses Profil zuweisen. Geben Sie jedoch acht, da&szlig; Sie nicht irrt&uuml;mlich ein falsches Profil verwenden, und tun Sie es nur, wenn Sie sich absolut sicher sind, da&szlig; Sie die Quelle des Bildes kennen.</p>

<p>Das <strong>littlecms</strong>-Paket ist mittlerweile eine stabile und ausgereifte Bibliothek. Unabh&auml;ngige Tests haben seine Genauigkeit best&auml;tigt, und es wird in Drucker-Firmware einiger der exotischsten High-End-Drucker verwendet. Wenn man bedenkt, da&szlig; littlecms nur von einer kleinen Entwicklergruppe programmiert wurde, ist das Ergebnis erstaunlich, wenn man den Umfang entsprechender Projekte bei Firmen wie Kodak, Adobe, Agfa und anderen betrachtet. </p>

<p><strong>Was sind Farb- oder Ger&auml;teprofile?</strong></p>

<p><strong>ICC-</strong> oder <strong>ICM-</strong> Profile sind besondere Dateien, die die Farbcharakteristika eines Ger&auml;tes (Scanner, Bildschirm, Drucker) beschreiben. Es gibt sie f&uuml;r praktisch jedes Ger&auml;t, das die Farbe eines digitalen Bildes erzeugen, darstellen oder ver&auml;ndern kann. Daneben gibt es noch sogenannte <strong>ger&auml;teunabh&auml;ngige</strong> oder <strong>Arbeitsfarbraumprofile</strong>. Man kann sich diese Profile als &Uuml;bersetzer vorstellen, die dazu eingesetzt werden, Daten zwischen den verschiedenen Ger&auml;teprofilen zu konvertieren. Eine ICC- oder ICM-Datei enth&auml;lt Tabellen, die die mathematischen Werte enthalten, mit denen Ger&auml;te Farben messen und beschreiben. Gl&uuml;cklicherweise gelten daf&uuml;r internationale Standards, und sie funktionieren in allen Betriebssystemen gleich.</p>

<p><strong>Ger&auml;teprofile</strong> sind Dateien, die beschreiben, wie ein Ger&auml;t eine Farbe erzeugt (Scanner, Digitalkamera), wiedergibt (Monitor) oder ausgibt (Drucker). Photoshop-Anwender d&uuml;rften die Option  <strong>Arbeitsprofil</strong> oder <strong>Arbeitsfarbraum</strong> kennen. Diese Profile sind nicht an ein bestimmtes Ger&auml;t gebunden, sondern helfen bei der Umwandlung von einem ger&auml;t zum andern. Bekannte RGB-Arbeitsfarbr&auml;ume sind etwa sRGB, Adobe&#174; RGB 1998, Colormatch, Bruce RGB oder CIERGB. Photoshop-Anwender werden sich fragen, ob dies ein fehlendes Feature ist, aber littlecms verwendet eine eigene interne Methode zur Konvertierung zwischen den Farbr&auml;umen. Womit wir eine Sorge weniger h&auml;tten!</p>

<table width="100%"><tr><td align="center"><img src="images/cmsmodify1.png" align="center" title="Die Einstellungen f&uuml;r das Farbmanagement" alt="Die Einstellungen f&uuml;r das Farbmanagement"/></td></tr></table>

<table width="100%"><tr><td align="center"></td></tr></table>
<p>Wozu "Softproofing"? Mit den richtig angelegten Ger&auml;teprofilen ist Scribus in der Lage, die Farben auf dem Monitor so anzupassen, da&szlig; sie den sp&auml;ter gedruckten entsprechen. Dies ist erst recht hilfreich, wenn Sie Ihre PDF-Datei an eine Druckerei oder ein Service-B&uuml;ro schicken. Au&szlig;erdem kann jedem Bild in Scribus ein eigenes Profil zugewiesen werden, so da&szlig; es auch wirklich vom Farbmanagement richtig behandelt wird, etwa wenn ein Film, eine PDF/X-3-Datei oder eine Druckplatte hergestellt werden sollen. Dadurch wird die Bilddatei selbst jedoch nicht ver&auml;ndert, denn die Vorschauprofile werden nur im Scribus-Dokument und in der ausgegebenen PDF-Datei verwendet.  Es gibt auch zwei Werkzeuge f&uuml;r die Kommandozeile, n&auml;mlich <strong>tifficc</strong> und <strong>jpegicc</strong>. Mehr Informationen finden Sie in der Lprof-Dokumentation. Sie k&ouml;nnen auch Cinepaint, ImageMagick, Krita, GIMP ab Version 2.4 oder Photoshop zum Einbetten von ICC-Profilen verwenden.</p>
<br />
</qt>