<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Hinweise zur Benutzung</title>
</head>
<body>
<h2>Hinweise zur Benutzung</h2>
<h3>Allgemeines</h3>
<p>Bei der Scribus-Online-Hilfe handelt es sich nicht um eine vollst&auml;ndige Beschreibung aller Scribus-Funktionen, sondern um eine Einf&uuml;hrung, die Ihnen die erfolgreiche Benutzung des Programms erm&ouml;glichen soll. Dar&uuml;ber hinaus m&ouml;chten die Autoren diejenigen, die mit dem, was gemeinhin als &raquo;Desktop Publishing&laquo; bezeichnet wird, nicht oder nur oberfl&auml;chlich vertraut sind, mit den dieser Software-Gattung eigenen Konzepten vertraut machen. Dies beinhaltet auch Warnungen vor Fallen und Fehlerquellen, die auf dem Weg von der Erstellung von Dokumenten zur professionellen Druckausgabe lauern.</p>
<p>Diese Dokumentation wird mit jeder neuen Scribus-Version erweitert und somit immer &raquo;vollst&auml;ndiger&laquo; werden. Das Scribus-Team arbeitet dar&uuml;ber hinaus an einer neuen Auflage des gedruckten Scribus-Handbuches, f&uuml;r das weitgehende Vollst&auml;ndigkeit angestrebt wird.</p>
<h3>Zur Textgestalt</h3>
<p>Die deutschsprachige Version der Online-Hilfe verwendet trotz des Drucks, der von Schulen, Beh&ouml;rden und anpassungsbereiten Medien ausgeht, die unreformierte deutsche Orthographie. Die Entscheidung f&uuml;r diese Wahl fiel insofern nicht schwer, als die sogenannte &raquo;neue Rechtschreibung&laquo; in diametralem Gegensatz zu den Idealen Freier Software steht:
<ol>
<li>Freie Software ist international, w&auml;hrend die amtliche &raquo;Orthografie&laquo; (geplant war urspr&uuml;nglich &raquo;ortografi&laquo;) nur als hinterw&auml;lderisch und provinziell bezeichnet werden kann (&raquo;platzieren&laquo;, &raquo;Krepp Suzette&laquo;, &raquo;Desktoppublishing&laquo; usw.) und ihre Pr&auml;missen teilweise in bedenklicher N&auml;he zur nationalsozialistischen Sprachideologie und der damit verbundenen Deutscht&uuml;melei stehen.</li>
<li>Die f&uuml;r die reformierte Orthographie zust&auml;ndigen &raquo;Experten&laquo; waren und sind Verfechter eines autorit&auml;ren Denkmodells, das auf staatliche &raquo;Sprachlenkung&laquo; und &raquo;Umerziehung&laquo; setzt. Das Ideal Freier Software ist hingegen das der Aufkl&auml;rung, d.h. der Gedankenfreiheit und des freien Wettbewerbs um die besten L&ouml;sungen. Im freien Wettbewerb hatte sich beispielsweise die herk&ouml;mmliche Verteilung von ss und &szlig; durchgesetzt, nicht die gegenw&auml;rtige &raquo;amtliche&laquo; Version.</li>
<li>Die &raquo;Rechtschreibreform&laquo; f&uuml;hrte zur Liquidierung Hunderter oder gar Tausender W&ouml;rter aus dem deutschen Wortschatz (sogenannt, jedesmal, Handvoll u.v.m.). Auch in der aktuellen Version des &raquo;amtlichen&laquo; Rechtschreibregelwerkes gibt es diese W&ouml;rter nicht mehr, sondern nur entsprechende &raquo;Schreibvarianten&laquo;. Staatlicher Sprachdirigismus, der sich anma&szlig;t, &uuml;ber die Existenz von W&ouml;rtern zu entscheiden, ist ein Kennzeichen totalit&auml;rer Regime (literarisch scharfsinnig und einsichtsvoll kondensiert von George Orwell in &raquo;1984&laquo;) und mit den Idealen Freier Software nicht vereinbar. </li>
<li>Vieles in der &raquo;neuen&laquo; Rechtschreibung ist schlicht und ergreifend falsch, und es als &raquo;richtig&laquo; zu akzeptieren, w&uuml;rde bedeuten, dem Staat auch die Herrschaft über die Sprache insgesamt (Grammatik, Wortbildung, Aussprache, in die die sogenannte &raquo;Rechtschreibreform&laquo; ebenfalls eingreift) zuzugestehen. Zwar sind in vielen (aber nicht allen) F&auml;llen die grammatisch korrekten Formen inzwischen wiederhergestellt worden, meist aber nur als &raquo;Schreibvariante&laquo; zum offensichtlich Falschen.</li>
<li>Wo die &raquo;neue Rechtschreibung&laquo; nicht einfach falsch ist, handelt es sich um eine R&uuml;ckkehr zu Schreibweisen, die in fr&uuml;heren Jahrhunderten zeitweise anzutreffen waren. Wer die urspr&uuml;nglichen Pl&auml;ne der Verantwortlichen kennt, wird davon nicht &uuml;berrascht sein, denn vorgesehen war ja eigentlich eine Wiedereinf&uuml;hrung mittelalterlicher Schreibungen. Da&szlig; die &raquo;Reform&laquo; vielfach aus der Wiederkehr von l&auml;ngst überholten Wortschreibungen und -trennungen aus dem 17., 18. und 19. Jahrhundert besteht (auch die &raquo;neue&laquo; ss/&szlig;-Schreibung geh&ouml;rt in diese Kategorie!), mu&szlig;, wenn man in der Lage ist, gen&uuml;gend Zynismus aufzubringen, vor diesem Hintergrund beinahe schon als Fortschritt bezeichnet werden.</li>
<li>Im Gegensatz zur staatlichen Propaganda ist die reformierte Orthographie keineswegs einfacher geworden, sondern es wurden fast ausschlie&szlig;lich zus&auml;tzliche Schikanen eingef&uuml;hrt: <i>8-j&auml;hrig, 8-J&auml;hrige, 8er, 8-fach/8fach, 8-mal</i> statt herk&ouml;mmlich <i>8j&auml;hrig, 8j&auml;hrige, 8er, 8fach, 8mal</i>; <i>gestern Morgen, gestern fr&uuml;h, Dienstagmorgen, Dienstag fr&uuml;h</i> statt herk&ouml;mmlich <i>gestern morgen, gestern fr&uuml;h, Dienstag morgen, Dienstag fr&uuml;h</i>; <i>Commedia dell&rsquo;Arte, Modus Vivendi, a capella</i> statt herk&ouml;mmlich <i>Commedia dell&rsquo;arte, Modus vivendi, a capella</i>; <i>Nasi-goreng, Chop-Suey</i> statt herk&ouml;mmlich <i>Nasi-goreng, Chop-suey</i>; <i>die ersten drei, die drei Ersten</i> statt herk&ouml;mmlich <i>die ersten drei, die drei ersten</i>. <br>Herk&ouml;mmliches <i>gut tun, leid tun, not tun, leid sein, not sein, weh tun, recht haben, recht sein, recht tun</i> wurde 1996 zu: <i>gut tun, Leid tun, Not tun, leid sein, Not sein, wehtun, Recht haben, recht tun, recht sein</i>. In der letzten und damit aktuellen Revision wurde daraus &raquo;amtlich&laquo; <i>gut tun, leidtun, nottun, leid sein, not sein, wehtun, recht/Recht haben, recht tun, recht sein</i>.
<br><br>Wer all dies f&uuml;r eine Erleichterung oder gar f&uuml;r fortschrittlich h&auml;lt, mag es tun &ndash; die Redaktion der Scribus-Online-Hilfe tut es jedenfalls nicht und ignoriert daher kopfsch&uuml;ttelnd die weiterhin stark reparaturbed&uuml;rftigen &raquo;amtlichen&laquo; Absurditäten.</li>
</ol></p>
<h3>Bildschirmschnappsch&uuml;sse</h3>
<p>Fast alle Bildschirmschnappsch&uuml;sse (Screenshots) wurden unter den Fedora- und OpenSUSE-Versionen von KDE4 erstellt. Unter anderen Betriebssystemen oder Desktop-Umgebungen (z.B. Gnome) kann die Benutzeroberfl&auml;che geringf&uuml;gig anders aussehen, aber dank der Verwendung des Qt-Toolkits sollte die Bedienung auf allen unterst&uuml;tzten Betriebssystemen gleich sein.</p>
<h3>Tastaturk&uuml;rzel</h3>
<p>Soweit nicht anders angegeben, beziehen sich Tastaturk&uuml;rzel auf PC-Tastaturen (Linux, UNIX, Windows, OS/2, eComStation).</p>
<h3>Dateien und Verzeichnisse</h3>
<p>Die Autoren dieser Online-Hilfe sind bestrebt, alle unterst&uuml;tzten Betriebssysteme gleichwertig abzudecken. Aus Gr&uuml;nden, die sich anhand der Entwicklungsgeschichte von Scribus erkl&auml;ren lassen, kann es jedoch vorkommen, da&szlig; lediglich Speicherorte unter Linux/UNIX angegeben sind. Sollten Sie auf eine derartige Dokumentationsl&uuml;cke sto&szlig;en, w&uuml;rden wir uns freuen, wenn Sie uns darauf aufmerksam machten und es uns auf diese Weise erm&ouml;glichten, diese L&uuml;cke zu schlie&szlig;en.</p>
</body>
</html>
