<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title><title>Schriftwerkzeuge in Scribus</title></title>
</head>
<body>
<h2>Schriftwerkzeuge in Scribus</h2>
<h3>Die Schriftvorschau</h3>
<p>Ein anderes n&uuml;tzliches Werkzeug in Scribus ist die Schriftvorschau, die wesentlich mehr kann, als ihre Bezeichnung erwarten l&auml;&szlig;t. Die Schriftvorschau steht nur zur Verf&uuml;gung, wenn ein Dokument ge&ouml;ffnet ist, und zwar unter <i>Extras &#062; Schriftvorschau</i>:</p>

<table width="100%"><tr><td align="center"><img src="images/font-preview.png" alt="Die Schriftvorschau" title="Die Schriftvorschau" /></td></tr></table>

<p>Wie Sie sehen, zeigt der Dialog eine Liste aller verf&uuml;gbaren Schriften. Wenn Sie eine Schrift ausw&auml;hlen, wird unten eine Vorschau angezeigt. Sie k&ouml;nnen den Beispieltext jederzeit &auml;ndern und ihn sp&auml;ter wieder auf die Voreinstellung zur&uuml;cksetzen.</p>

<p>Wenn Sie viele Schriften installiert haben, werden Sie die Funktion &raquo;Schnellsuche&laquo; praktisch finden, denn sie erm&ouml;glicht es Ihnen, nach Schriften zu suchen, z.B. nach solchen eines bestimmten Herstellers (Adobe, Bitstream usw.) oder nach Schriftschnitten (z.B. &raquo;Italic&laquo;). Die einzige Einschr&auml;nkung ist hier, da&szlig; Scribus nur in den Schriftnamen sucht, d.h. wenn Sie nach Kursivschnitten (z.B. mit dem Suchbegriff &raquo;Italic&laquo;) suchen, aber das Wort &raquo;Italic&laquo; kein Bestandteil des Namens ist, wird die Schrift nicht angezeigt.</p>

<p>Eine andere n&uuml;tzliche Funktion der Schriftvorschau ist die Option &raquo;Erweiterte Schriftinformationen anzeigen&laquo;. Mit deren Hilfe k&ouml;nnen Sie sich nicht nur dieselben Informationen anzeigen lassen wie im Dialog &raquo;Verf&uuml;gbare Schriften&laquo;, sondern erhalten auch einen Schnellzugriff auf dessen <a href="fonts1.html">Funktionen</a>.</p>

<h3>Hintergrundinformationen zu Schriften</h3>

<p>Schriften sind h&auml;ufig der Ausgangs- und Endpunkt von Problemen im Desktop Publishing und in der Druckvorstufe. Grob gesch&auml;tzt sind 50% aller Problemberichte, die Schriften betreffen, Probleme (d.h. Fehler) in den Schriftdateien selbst. Eine weitere typische Frage von Scribus-Anwendern lautet in etwa so: &raquo;Scribus zeigt Schrift x nicht an, aber die Programme x und y k&ouml;nnen sie problemlos verwenden. Was ist da los?&laquo;</p>

<p>Grunds&auml;tzlich ist Scribus &auml;u&szlig;erst w&auml;hlerisch, wenn es um Schriften geht. Jedesmal wenn Scribus startet, f&uuml;hrt es einen &raquo;Notwehrtest&laquo; durch, um sicherzustellen, da&szlig; Schriften &uuml;ber eine nutzbare Kodierung verf&uuml;gen, skalierbar sind und einen korrekt eingebetteten PostScript-Namen haben. Wenn Scribus ein Dokument l&auml;dt, f&uuml;hrt es eine genauere &Uuml;berpr&uuml;fung der verwendeten Schrift durch, um sicherzustellen, da&szlig; auf alle darin enthaltenen Glyphen zugegriffen werden kann. Sollte letzteres nicht der Fall sein, wird die Schrift in Scribus deaktiviert. Dies ist ein Feature, kein Programmfehler! Es gibt wahrscheinlich nur wenige Programme (wenn &uuml;berhaupt eines), die weniger Toleranz gegen&uuml;ber fehlerhaften Schriftdateien zeigen, als Scribus, denn die Verwendung von problematischen Schriften zu verhindern, ist fraglos von grundlegender Bedeutung f&uuml;r eine verl&auml;&szlig;liche Ausgabe. Zwar mag dies einige Anwender verwirren, aber seien Sie versichert, da&szlig; dadurch viele potentielle Probleme verhindert werden, etwa die Ausgabe einer PDF-Datei, die die Belichtungsmaschine abst&uuml;rzen l&auml;&szlig;t oder die man &uuml;berhaupt nicht ausbelichten kann, obwohl eine Auflage von 200&nbsp;000 gedruckt werden mu&szlig;. Solche Probleme k&ouml;nnen Hunderte, Tausende oder Millionen &ndash; je nach lokaler W&auml;hrung &ndash; kosten.</p>

<p>Wenn Sie sich fragen, warum eine Schrift in Scribus nicht zur Verf&uuml;gung steht, k&ouml;nnen Sie es von der Kommandozeile starten, wo Sie etwas sehen k&ouml;nnten, was so &auml;hnlich aussieht wie dies:</p>

<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>Font /usr/local/share/fonts/URW/p052023l.pfb is broken, discarding it
</pre>
</td></tr></table></blockquote>

<p>Beachten Sie auch, da&szlig; Scribus keine &raquo;falschen&laquo; Schriftschnitte erzeugt. Diese sind der Fluch der Druckvorstufe und bekannt daf&uuml;r, da&szlig; sie f&uuml;r Probleme beim kommerziellen Druck sorgen, weil das Schriftbild oft sehr schlecht ist. Daher wird Scribus keine k&uuml;nstlichen Kursiv- und Fettschnitte erzeugen &ndash; statt dessen m&uuml;ssen die entsprechenden Schriftdateien vorliegen. Einige DTP- und Textverarbeitungsprgramme bieten eine Funktion wie die beschriebene an, aber die Scribus-Entwickler haben sich bewu&szlig;t dagegen entschieden.</p>

<h4>Unterst&uuml;tzte Schriftenformate</h4>

<p>An Schriftformaten herrscht in der modernen Computerwelt wahrlich kein Mangel. Die Bandbreite reicht dabei von Bitmapschriften (die beispielsweise noch f&uuml;r die Kommandozeilen heutiger Betriebssysteme und zum Teil auch noch vom Satzsystem TeX verwendet werden) bis hin zu sogenannten Webfonts, die &uuml;berhaupt nicht auf einem Computer installiert sein m&uuml;ssen, sondern zusammen mit einer Webseite in den Browser &uuml;bertragen werden. Im kommerziellen Druck spielen hingegen nur drei Formate eine Rolle, n&auml;mlich PostScript, TrueType und OpenType.</p>
<ul>
<li><b>PostScript-Schriften</b> waren ein bedeutender Bestandteil der sogenannten Desktop-Publishing-Revolution. Sie verwenden die Programmiersprache <a href="importhints1.html">PostScript</a> und waren lange der Standard im kommerziellen Druck. Obwohl die meisten modernen Druckereien ihre Workflows auf OpenType umgestellt haben, k&ouml;nnen PostScript-Schriften nach wie vor problemlos verwendet werden. Indes hat dieses alte Schriftformat auch einige Nachteile: Erstens k&ouml;nnen PostScript-Schriften nicht ohne weiteres zwischen Betriebssystemen ausgetauscht werden, weil jedes System andere Dateien einer solchen Schrift verwendet (und eine PostScript-Schrift besteht immer aus zwei Dateien). Zweitens kann eine PostScript-Schrift maximal 256 Glyphe enthalten, was heutigen Anforderungen kaum gerecht wird. Um zus&auml;tzliche Glyphe verwenden zu k&ouml;nnen, ben&ouml;tigt man eine weitere Schrift, die diese enth&auml;lt. Mit Ausnahme von asiatischen Schriften (CID-Fonts) kann Scribus mit fast allen PostScript-Schriften umgehen. Dar&uuml;ber hinaus kann Scribus diese Schriften plattformunabh&auml;ngig benutzen. So k&ouml;nnen Sie zum Beispiel dfont-Dateien von Mac&nbsp;OS unter Linux oder eComStation verwenden, obwohl die Betriebssysteme selbst dieses Format nicht unterst&uuml;tzen.</li>
<li><b>TrueType-Schriften</b> wurden in den neunziger Jahren von Microsoft und Apple eingef&uuml;hrt, nachdem Adobe sich geweigert hatte, die Spezifikation des PostScript-Type-1-Formats offenzulegen. Aufgrund der frei verf&uuml;gbaren TrueType-Spezifikation wurde das Internet mit Schriften schlechter Qualit&auml;t &uuml;berflutet, weshalb kommerzielle Druckereien TrueType-Schriften manchmal eine gesunde Dosis an Skepsis entgegenbringen. Es sollte jedoch betont werden, da&szlig; sich diese Skepsis vor allem auf die Quelle vieler TrueType-Schriften bezieht. Aus technischer Sicht l&auml;&szlig;t sich sagen, da&szlig; eine sorgf&auml;ltig gearbeitete TrueType-Schrift in einem kommerziellen Druckproze&szlig; keine Probleme bereiten wird. Wenn Sie also Schriften verwenden, wie sie mit den Produkten von Microsoft oder Apple ausgeliefert werden oder die von einem anerkannten Hersteller wie Bitstream oder Linotype stammen, sollten Sie keine Bedenken haben. TrueType-Schriften bieten gegen&uuml;ber PostScript-Schriften einige Vorteile: Eine TrueType-Schrift besteht aus einer einzigen Datei, die unter jedem modernen Betriebssystem verwendet werden kann, und diese Datei kann mehr als 60&nbsp;000 Glyphe enthalten.</li>
<li><b>OpenType</b> war das Ergebnis einer Zusammenarbeit von Adobe und Microsoft, die den &raquo;Schriftformatkrieg&laquo; zwischen den beiden Unternehmen beenden wollten. Eine OpenType-Schrift kombiniert die Eigenschaften von TrueType- und PostScript-Schriften und bietet dar&uuml;ber hinaus einige zus&auml;tzliche Funktionen. In technischer Hinsicht verwendet eine OpenType-Schrift einen TrueType-Container, weshalb sie aus einer einzigen Datei besteht. Dieser Container kann sowohl PostScript- als auch TrueType-Kurven enthalten, mit denen die Glyphe gezeichnet sind, und es ist sogar m&ouml;glich, beide zu mischen. Dar&uuml;ber hinaus bietet OpenType Zusatzfunktionen f&uuml;r Textsatzprofis, zum Beispiel automatische Ligaturen oder alternative Glyphen. Scribus kann OpenType-Schriften zwar problemlos verwenden, aber die OpenType-Zusatzfunktionen stehen gegenw&auml;rtig noch nicht zur Verf&uuml;gung. <br>Heutzutage werden die meisten kommerziellen Schriften im OpenType-Format vertrieben. Als Faustregel k&ouml;nnen Sie davon ausgehen, da&szlig; Dateien mit der Endung *.ttf (z.B. die Schriften, die in Windows enthalten sind) intern TrueType-Kurven verwenden, w&auml;hrend solche mit der Endung *.otf PostScript-Kurven enthalten.</li>
</ul>

<h3>Vertrauensw&uuml;rdige Schriften</h3>
<p>Hochwertige Schriften sind eine Voraussetzung f&uuml;r eine verl&auml;&szlig;liche Druckausgabe, ganz egal, welches Betriebssystem Sie verwenden. Es ist durchaus kein Snobismus, wenn Druckprofis kostenlosen Freeware- oder Shareware-Schriften &auml;u&szlig;erst skeptisch gegen&uuml;berstehen, denn sie wissen aus Erfahrung, da&szlig; solche Schriften h&auml;ufig nicht den Standards entsprechen. Probleme wie falsche Kodierung, ein fehlender oder falsch formatierter PostScript-Name, defekte Kurven in einzelnen Glyphen und andere M&auml;ngel sind in solchen Dateien nicht gerade selten. Um eine verl&auml;&szlig;liche Schrift herzustellen, mu&szlig; man Qualit&auml;tssicherung betreiben und intensiv testen. So hat es beispielsweise fast ein Jahr gedauert, um die Verdana aus der MS Web Font Collection herzustellen.</p>
<p>Im Scribus-Wiki finden Sie eine Liste mit vertrauensw&uuml;rdigen Schriften und Download-Quellen. Diese Liste wird mehr oder weniger regelm&auml;&szlig;ig aktualisiert.</p>
<br>
</body>
</html>
