<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Silbentrennung</title>
</head>
<body>
<h2>Silbentrennung</h2>
<h3>Einleitung</h3>
<p>Einer der Gr&uuml;nde f&uuml;r ein h&auml;&szlig;liches Layout sind L&uuml;cken zwischen W&ouml;rtern im Text, im Fachjargon auch &raquo;Sturzb&auml;che&laquo; genannt, die aus nicht angewandter Silbentrennung herr&uuml;hren. Als Faustregel gilt dabei, da&szlig; die Wahrscheinlichkeit f&uuml;r solche L&uuml;cken mit der K&uuml;rze einer Zeile steigt. Es ist daher dringend zu empfehlen, die Silbentrennung f&uuml;r Flie&szlig;text immer durchzuf&uuml;hren, ganz besonders wenn Sie Blocksatz verwenden.</p>

<h3>Konfiguration</h3>
<p>Um die besten Resultate zu erzielen, sollten Sie die Silbentrennung f&uuml;r Ihre Zwecke angemessen konfigurieren. Dies geschieht im Dialog <i>Datei > Dokument einrichten > Silbentrennung</i> f&uuml;r das aktuelle Dokument und <i>Datei > Allgemeine Einstellungen > Silbentrennung</i> f&uuml;r neue Dokumente.</p><br>

<table width="100%"><tr><td align="center"><img src="images/hyphen1.png" align="center" alt="Optionen der Silbentrennung" /></td></tr></table>
<p>Der Dialog ist viergeteilt. Im oberen linken Bereich (<i>Allgemeine Optionen</i>) k&ouml;nnen Sie das allgemeine Verhalten der Silbentrennung festlegen:</p>
<ul>
<li><b>Trennvorschl&auml;ge:</b> Wenn diese Option aktiviert ist, wird Scribus f&uuml;r <i>jedes Wort</i> in einem Textrahmen einen Trennvorschlag machen, was bei langen Texten sehr zeitaufwendig sein kann. Es ist wahrscheinlich einfacher, die Silbentrennung in Einzelf&auml;llen von Hand zu korrigeren.</li>
<li><b>Text automatisch w&auml;hrend der Eingabe trennen:</b> Wenn Sie diese Option aktiviert haben, wird Text bei aktivierter Silbentrennung automatisch getrennt, sobald er in einen Textrahmen eingegeben wird. Dies gilt auch f&uuml;r importierten Text.</li>
</ul>
<p>Im oberen rechten Bereich finden Sie die wichtigsten typographischen Optionen:</p>
<ul>
<li><b>Sprache:</b> Die Trennregeln in den verschiedenen Sprachen sind teilweise sehr verschieden, so da&szlig; Sie darauf achten sollten, die richtige Sprache auszuw&auml;hlen. Im Deutschen kommen noch die verschiedenen Orthographien hinzu (herk&ouml;mmlich: Ex-trakt, Kon-stante reformiert: Ext-rakt, Kons-tante; Deutschland und &Ouml;sterreich: SCHLIE-SSEN, Schweiz: SCHLIES-SEN). Wenn Sie unsinnige Trennungen vermeiden wollen, empfehlen wir generell, die herk&ouml;mmliche Trennung anzuwenden, da sie sinnvolle und auch reformiert g&uuml;ltige Trennungen erzeugt &ndash; die Umwandlung von ck in k-k wird ohnehin nicht automatisch durchgef&uuml;hrt. Wenn Sie mit mehrsprachigen Dokumenten arbeiten, k&ouml;nnen Sie die unterschiedlichen Spracheinstellungen in <a href="WwStyles.html">Zeichenstilen</a> festlegen.</li>
<li><b>K&uuml;rzestes Wort</b> bestimmt, wie lang ein Wort sein mu&szlig;, damit &uuml;berhaupt eine Trennung in Frage kommt. Die Voreinstellung ist drei, was f&uuml;r deutsche Texte zu wenig sein d&uuml;rfte. Hier sollten Sie mindestens 5 eingeben.</li>
<li><b>Aufeinanderfolgende Trennungen</b> legt fest, wieviele W&ouml;rter hintereinander getrennt werden d&uuml;rfen. Hier sollten Sie nicht mehr als drei zulassen, denn ansonsten entstehen am rechten Rand durch die Trennstriche leicht h&auml;&szlig;liche &raquo;Leitern&laquo; oder &raquo;Stufen&laquo;. Die relativ strenge Voreinstellung (2) sollte gen&uuml;gen, sofern Sie nicht mit sehr schmalen Spalten arbeiten.</li>
</ul>
<p>In der unteren H&auml;lfte des Dialogs finden Sie zwei Felder, in denen Sie Besonderheiten eingeben k&ouml;nnen, die dem Trenn-Algorithmus &raquo;entgehen&laquo;. Im Feld &raquo;Ausnahmen&laquo; k&ouml;nnen Sie W&ouml;rter eingeben, die falsch getrennt werden. Im Deutschen k&ouml;nnen diese beispielsweise vorkommen, wenn in einem Kompositum ein Vorderglied auf b endet und das folgende Glied mit r beginnt. Da viele W&ouml;rter im Deutschen mit br beginnen, setzt der Trennalgorithmus die Trennung deshalb u.U. vor das b (Tra-brennen statt Trab-rennen). Auch Namen, besonders nichtdeutsche werden h&auml;ufig falsch getrennt (Rani-cki statt Ranic-ki). Die richtige Trennung errreichen Sie, indem Sie das Wort in das Feld eintippen und die Trennstelle(n) manuell mit dem Minuszeichen auf der Tastatur eingeben.</p>
<p>Im Feld &raquo;Liste der Auslassungen&laquo; k&ouml;nnen Sie W&ouml;rter eingeben, von denen Sie m&ouml;chten, da&szlig; sie &uuml;berhaupt nicht getrennt werden.</p>
<h3>Benutzung</h3>
<p>W&auml;hlen Sie einen Textrahmen, richten Sie den Text wie gew&uuml;nscht aus, und klicken Sie dann auf <i>Extras > Silbentrennung anwenden</i> im Men&uuml;. Beachten Sie, da&szlig; auf diese Weise nur der Text im aktuell ausgew&auml;hlten Rahmen getrennt wird.</p>
<p>Im <i>Extras</i>-Men&uuml; finden Sie auch das Gegenst&uuml;ck: <i>Silbentrennung r&uuml;ckg&auml;ngig machen</i>, mit dem Sie die vorgenommene Trennung eines Textes widerrufen k&ouml;nnen. Diese Funktion kann auch zu dazu verwendet werden, um die Trennung eines einzelnen Wortes r&uuml;ckg&auml;ngig zu machen. W&auml;hlen Sie dazu das getrennte Wort aus und klicken Sie auf den Men&uuml;eintrag.</p>
<p>Es wird immer F&auml;lle geben, in denen der Trennalogorithmus nicht jede m&ouml;gliche oder sinnvolle Trennung durchf&uuml;hrt. In einem solchen Fall k&ouml;nnen Sie mit Hilfe eines &raquo;bedingten Trennzeichens&laquo; manuell nachhelfen. &raquo;Bedingt&laquo; bedeutet, da&szlig; Sie dem Programm mitteilen: &raquo;Hier trennen, wenn es m&ouml;glich ist.&laquo; &raquo;M&ouml;glich&laquo; ist eine Trennung, wenn sie nicht durch andere Vorgaben (z.B. die Anzahl aufeinanderfolgender Trennungen) verhindert wird. Ein bedingtes Trennzeichen k&ouml;nnen Sie per Tastatur mit der Kombination Strg+Shift+- oder &uuml;ber den Menupunkt <i>Einf&uuml;gen&nbsp;> Zeichen&nbsp;> Bedingtes Leerezeichen</i> an der jeweiligen Trennstelle eingeben.</p>
<br>
</body>
</html>
