<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Anmerkungen zu Importproblemen mit Scribus</title>
</head>
<body>
<h2>Anmerkungen zu Importproblemen mit Scribus</h2>
<p>Obwohl Scribus die g&auml;ngigsten DTP-Bildformate wie TIFF und EPS importieren kann, wird es manchmal doch zu einer etwas schwierigen Angelegenheit, Dinge ins eigene DTP-Layout hineinzubekommen. Anders als bei anderen DTP-Programmen, deren Druckfunktion mitunter w&auml;hlerisch sein kann, gilt sowohl das Drucken als auch der PDF-Export unter Scribus immer schon als sehr zuverl&auml;ssig. Es ist mir nur wenige Male passiert, da&szlig; Scribus abst&uuml;rzte oder der gew&uuml;nschte Ausdruck bzw. die PDF-Datei ausblieb. Wenn Bilder und Dateien korrekt vorbereitet sind, ist Scribus&apos; Ergebnis dem propriet&auml;rer Layout-Programme ebenb&uuml;rtig.</p>
<p>Der Schl&uuml;ssel hierzu liegt meiner Erfahrung nach darin, da&szlig; f&uuml;r den jeweiligen Bildtyp das optimale Format gew&auml;hlt wird. Wenn irgend m&ouml;glich, importieren Sie Ihre Bilder als Vektorgrafiken (SVG oder EPS)! Zum anderen bin ich pers&ouml;nlich <strong>ausgesprochen</strong> w&auml;hlerisch mit meinen Schriften. Sie werden diese Anmerkung hier immer wieder finden: Wenn Sie mit einer hochleistungsf&auml;higen DTP-Software wie Scribus arbeiten, spielt die Qualit&auml;t der Schriftarten eine Rolle. In der professionellen DTP-Arbeit kommt es wirklich <strong>sehr</strong> darauf an. Die vermutlich h&auml;ufigste Ursache, weshalb eine PostScript-Ausgabe scheitert (ob nun als Druck oder PDF-Export), ist eine fehlerhafte oder beschädigte Schrift.</p>

<h3>TIFF, JPEG und PNG &ndash; was ist der Unterschied?</h3>
<p>Tips oder: Wie sich manche Probleme, die einen Anf&auml;nger verwirren, vermeiden lassen:</p>

<h3>Wenn es auf dem Bildschirm gut aussieht, wird es auch auf Papier gut aussehen.</h3>
<p>Nein, eher nicht, leider. Es ist einer der verbreitetsten Anf&auml;ngerfehler, anzunehmen, da&szlig; ein nett aussehendes JPEG-Bild aus dem Internet auch einen guten Papierausdruck ergibt. Die meisten Webseiten verwenden JPEG-, GIF- oder, leider, noch seltener PNG-Dateien. Dabei werden JPEGs von ihrer Struktur her nicht verlustlos komprimiert. Beim Kompressionsvorgang einer JPEG-Grafik gehen Daten unwiederbringlich verloren. Au&szlig;erdem gibt es einen JPEG-Typ, der als "progressiv" bezeichnet wird und in einem PostScript-Workflow das pure Gift ist. Eine progressive JPEG-Datei ist ein Bildtyp, der w&auml;hrend des Herunterladens in einem Webbrowser schrittweise dargestellt wird. <strong>Vermeiden Sie das unter allen Umst&auml;nden.</strong> Und denken Sie schlie&szlig;lich auch daran, da&szlig; die meisten Grafiken im Internet nur eine Aufl&ouml;sung von 72&ndash;96 dpi haben, w&auml;hrend Scribus PDF-Dateien mit bis zu 4000 dpi erzeugen kann.</p>
<p>F&uuml;r hochqualitativen PostScript-Druck gibt es 3 Arten von Dateiformaten, die f&uuml;r Bilder wie Fotos (und alles, was aus Pixeln besteht) gut geeignet und langerprobt sind: TIFF, tif und Tiff.</p>
<p>Ganz gleich, wie Sie es schreiben, das Format &quot;Tagged Image File&quot; ist das Dateiformat f&uuml;r Bitmap-Grafiken. Schlu&szlig;, aus, basta! Keine Diskusssion: Ich habe recht.</p>

<h3>Doch weshalb?</h3>
<ol>
	<li>Es ist ein verlustfreies (engl. &quot;lossless&quot;) Format. Das Kompressionsverfahren mindert die Qualit&auml;t nicht.</li>
	<li>F&uuml;r Ihren Zweck der Anwendung mit Scribus leistet GIMP eine gute Arbeit, indem es Dateien aus seinem eigenen XCF-Format exportiert oder abspeichert.</li>
	<li>Es kann problemlos mit ICC-Profilen umgehen. Sie k&ouml;nnen es mit TIFFicc, einem kleinen kleinen littlecms-Hilfsprogramm, &quot;markieren&quot; oder mittels Photoshop, Photopaint oder anderen Bitmap-Editoren ein ICC-Profil einbetten.</li>
	<li>Es unterst&uuml;tzt CMYK-Farben besser als fast alle anderen Bitmap-Formate.</li>
	<li>Es wird von jeder hochwertigen DTP-Anwendung unterst&uuml;tzt, einschlie&szlig;lich Scribus.</li>
	<li>TIFF-Dateien, die in GIMP oder Photoshop ordentlich vorbereitet wurden, sind im kommerziellen Druckeinsatz au&szlig;erordentlich zuverl&auml;ssig, und PostScript-Ger&auml;te haben h&ouml;chst selten Schwierigkeiten mit ihnen.</li>
</ol>

<h3>Voraussetzungen</h3>
<p>Es gibt mehr als 50 verschiedene TIFF-Varianten, und nicht jedes Bildbearbeitungsprogramm speichert sie gleicherma&szlig;en standardgetreu ab. Das Bildbearbeitungsprogramm GIMP, das die Grafikbibliothek libTIFF gemeinsam mit Scribus nutzt, unterst&uuml;tzt TIFF-Grafiken ganz ausgezeichnet. Ich arbeite mit GIMP meist in der Art, da&szlig; ich die Originaldatei in GIMPs Eigenformat (xcf) speichere, bis ich mit der Bearbeitung zufrieden bin, um sie dann als TIFF abermals zu speichern, bzw. als Bildschirmfoto f&uuml;r Webseiten im PNG-Format.</p>
<p>Ja, die Ausnahme von der Regel ist PNG, insbesondere bei Bildschirmfotos von Applikationen. Das PNG-Format besitzt viele fortschrittliche Eigenschaften und Funktionen, wie die Unterst&uuml;tzung für ICC-Farbmanagement und echte Alpha-Transparenz (die von Anwendungssoftware manchmal nur m&auml;&szlig;ig unterst&uuml;tzt wird [man denke nur an eine ma&szlig;gebliche Browserapplikation]). PNG läßt sich auch ausgezeichnet komprimieren. Es gibt nur einen Fall, in dem ich JPEG gegen&uuml;ber PNG bevorzuge, n&auml;mlich bei Fotos mit hohem Kontrastumfang (HDR), meist wegen der Dateigr&ouml;&szlig;e auf einer Webseite. Zur Anfertigung von PDF-Dateien mit Bildschirmfotos eignet sich PNG hervorragend &ndash; auch für den Druck, solange Sie keine Anpassungen vornehmen, die die Bildgr&ouml;&szlig;e ver&auml;ndern. Wenn Sie also ein Bildschirmfoto mit der typischen Aufl&ouml;sung von 72&ndash;96 dpi vor sich haben und dieses verkleinern m&ouml;chten, bearbeiten Sie das Bild m&ouml;glichst mit GIMP oder in Scribus. Bei der Gr&ouml;&szlig;enver&auml;nderung von Screenshots sollten Sie immer die Neuberechnung abschalten, und zwar in jeder Bildbearbeitung. Verringern Sie bei Screenshots nie die Auflösung, denn sie verlieren damit an Sch&auml;rfe.</p>

<h3>Wenn es auf dem Bildschirm schlecht aussieht, wird es auch als Ausdruck f&uuml;rchterlich.</h3>
<p>EPS-Dateien oder &quot;Encapsulated PostScript&quot;. EPS-Dateien verfügen von Haus aus über keine Vorschaum&ouml;glichkeit. EPS-Dateien sind tats&auml;chlich eine spezielle Teilmenge von PostScript-Anweisungen. Falls diesen Dateien eine TIFF- oder PICT-Vorschau eingebettet ist, sehen sie auf dem Bildschirm schlicht furchtbar aus, oder sie erscheinen einfach als simpler grauer Kasten. EPS-Dateien haben zwei wichtige Vorz&uuml;ge: Sie lassen sich gut auf hochaufl&ouml;senden Druckern ausgeben, und sie bringen gute PDF-Resultate. EPS-Dateien sind nicht von der Aufl&ouml;sung abh&auml;ngig, und sie sind (fast) der einzige Dateityp, den Sie (manchmal) getrost um mehr als 100% vergr&ouml;&szlig;ern k&ouml;nnen, ohne etwas von der Bildsch&auml;rfe einzub&uuml;&szlig;en.</p>
<p>Obwohl EPS-Dateien von vielen Anwendungsprogrammen erzeugt werden können, sind nicht alle solcherart erzeugten Dateien für den professionellen Druck geeignet, weil sie sich nicht an die Spezifikationen halten. Um eine EPS-Datei f&uuml;r den Gebrauch mit Scribus zu testen, &ouml;ffnen Sie diese in GSview, dr&uuml;cken auf der Tastatur Umschalt-M, und es erscheint ein Fenster, das die Meldungen von Ghostscript anzeigt. Ghostscript ist mit Recht  ziemlich penibel im Umgang mit EPS-Dateien. Wenn Sie also versuchen, EPS-Dateien zu importieren, diese nicht ordentlich in in Scribus funktionieren und GSview/Ghostscript jede Menge Fehlermeldungen ausgibt, probieren Sie die Dateien mit Hilfe eines anderen Programms zu erzeugen.</p>
<p>Ein Grund f&uuml;r die Allgegenwart von EPS-Dateien im DTP ist die Existenz einer anderen DTP-Anwendung, die in der Vergangenheit eher schlecht mit TIFF- und anderen Bitmap-Grafikdateien umgehen konnte, daf&uuml;r aber beim EPS-Import ihre St&auml;rke zeigte. Daher haben sich viele DTP-Anwender daran gew&ouml;hnt, Pixelgrafiken aus Bildbearbeitungsprogrammen wie Photoshop oder anderen im EPS-Format zu speichern. Leider kann dies den Nebeneffekt haben, da&szlig; es unm&ouml;glich wird, Bilddateien, die etwa angepa&szlig;t werden m&uuml;ssen, entsprechend zu bearbeiten, weil keine Originaldatei vorhanden ist. EPS ist ideal, um Vektorgrafiken wie Landkarten zu erhalten, die mit Text vermischt sind. Voraussetzung ist, da&szlig; die Schriftarten sauber im EPS eingebettet sind, denn nur so kann mit Scribus ein sauberes Druckresultat erzielt werden.</p>
<p>Gl&uuml;cklicherweise erzeugt Scribus automatisch eine niedrigaufl&ouml;sende Vorschaugrafik, die gut dazu geeignet ist, die Datei zu plazieren und skalieren. Wenn eine EPS-Datei importiert wird, erzeugt Scribus eine PNG-Vorschau der Grafik mit 72 dpi. Machen Sie sich also keine Sorgen, wenn sie nicht gleich die optimale Sch&auml;rfe aufweist. Erst beim Druck oder beim Export nach PDF wird die hohe Aufl&ouml;sung erreicht.</p>
<p>Skeptisch? Sie m&ouml;chten mit eigenen Augen sehen, wie unterschiedlich Vektor- und Bitmap-Grafikdateien sind? Hier ist ein Beispiel, gehen Sie auf diese Seite: <a href="http://www.isc.tamu.edu/~lewing/linux">http://www.isc.tamu.edu/~lewing/linux</a></p>
<p>Laden Sie sich hier &uuml;ber den &quot;PostScript&quot;-Link eine EPS-Version von Tux und danach mit einem Rechtsklick eine der GIF-Dateien herunter. Sie sind ungef&auml;hr gleich gro&szlig;. Nun erstellen Sie in Scribus ein neues Dokument mit 2 normal gro&szlig;en Seiten. Plazieren Sie die GIF- auf der einen und die EPS-Grafik auf der anderen Seite. F&uuml;hren Sie einen Export nach PDF mit (wenigstens) 600 dpi durch. &Ouml;ffnen Sie das Dokument im Acrobat Reader. Vergrößern Sie die Ansicht auf 200&ndash;400%. Jetzt sehen Sie den Unterschied...</p>
<p>Wie kommt es zu dem Unterschied? Scribus erzeugt und der Acrobat Reader rendert die sogenannten PostScript-Operatoren &ndash; wieder mal eine schicke Bezeichnung, hier f&uuml;r eine mathematische Anwendung zum Erzeugen von Kurven f&uuml;r die Bildschirm- oder Druckausgabe. Eine GIF- oder JPEG-Grafik ist einfach ein Haufen Pixel, also eigentlich nur P&uuml;nktchen, die das Bild ausmachen.</p>

<h3>Mein neues Lieblingsdateiformat</h3>
<p>Durch die Erweiterung der Importm&ouml;glichkeiten um das SVG-Format kann der Anwender auf noch vorz&uuml;glichere Weise seine Bilder und Grafiken importieren: SVG (Scalable Vector Graphics). Skalierbar, das ist gro&szlig;artig, denn das hei&szlig;t ja, da&szlig; Sie die Grafik (theoretisch) bis zur Gr&ouml;&szlig;e eines Hauses ver&auml;ndern k&ouml;nnten, ohne da&szlig; sie ihre Sch&auml;rfe verliert. Vektor deutet darauf hin, wie es geschieht: Die Formen werden mittels mathematischer Beschreibungen gezeichnet &ndash; vereinfacht gesagt. Mehr dar&uuml;ber auf der n&auml;chsten Seite, die sich mit ein paar netten Import-Tricks besch&auml;ftigt.</p>

<h3>Beim Import auch an Schriftarten denken</h3>
<p>&Auml;hnlich verhält es sich mit Schriftarten, die auf dem Bildschirm gut aussehen, nicht aber im Druckresultat. Normalerweise trifft das auf Freeware-TrueType-Schriften zu, die irgendwo heruntergeladen wurden. Im gro&szlig;en und ganzen sehen TrueType-Schriften auf dem Bildschirm besser aus, liefern beim Druck aber nicht immer das gew&uuml;nschte Ergebnis. Nun ja, es braucht schon eine ganze Menge Zeit und Qualit&auml;tssicherung, bis eine hochqualitative Schriftart erstellt ist, insbesondere was korrektes "Hinting" angeht. Denken Sie daran, da&szlig; es nicht sehr viele hochqualitative Schriften gibt, die als freie Software (Open Source) entwickelt wurden. Es gibt einige, doch leider nicht so viele, wie neue Applikationen bei Freshmeat erscheinen.</p>
<p>Im Gegensatz hierzu sind die Type1-Schriftarten, die zu Ghostscript geh&ouml;ren, nicht f&uuml;r die Bildschirmdarstellung optimiert, doch normalerweise eignen sie sich ausgezeichnet für den Drucke. Die Schriften wurden &uuml;brigens von URW++ erstellt, einem hochangesehenen Schriftenhersteller. Sie gelangten dann als eine Stiftung von Artifex in die Ghostscript-Distribution. Lediglich die Nimbus-Schriftarten sind etwas problematisch &ndash; anstelle ihrer richtigen PostScript-Namen wird h&auml;ufig ein Alias gesetzt, n&auml;mlich Times, Helvetica oder Courier. Folglich denkt mancher Anwender, es sei nicht n&ouml;tig, diese Schriftarten einzubetten, da sie ja zum Acrobat Reader geh&ouml;ren. Wenn diese dann nicht eingebettet sind, verf&auml;hrt der Acrobat Reader recht ungl&uuml;cklich mit ihnen, indem er sie mit seinen eigenen Multi-Master-Schriften nachbildet. Mit Scribus gibt es dieses Problem nicht, denn Scribus verwendet den korrekten Postscript-Namen, der aus der Fontdatei ausgelesen wird.</p>
<p>Die Bitstream-Schriftarten, die in X.Org enthalten sind (wie Charter und die neuen Vera-Schriften), sind gute Drucker-Schriftarten. Au&szlig;erdem mag ich die Utopia-Schriftfamilie, bei der es sich &uuml;brigens um eine Adobe-Type1-Schriftart handelt, die von IBM gestiftet wurde. Beim Erstellen von Scribus-Dokumenten in PDF-Form verwende ich recht oft nur noch diese Familie.</p>
</body>
</html>
