<qt>
<title>Bemerkungen zum EPS/PS-Import</title>
<h2>Bemerkungen zum EPS/PS-Import</h2>

<p>Um Ihre Chancen f&uuml;r einen erfolgreichen EPS-Import zu erh&ouml;hen, sollten Sie auf drei Dinge achten:</p>
 <ul>
<li>Eine EPS-Datei, die den ver&ouml;ffentlichten Spezifikationen entspricht. Nicht alle Anwendungen exportieren EPS-Dateien gleich zuverl&auml;ssig, und auch Fonts werden nicht immer richtig eingebettet.</li>
<li>Die jeweils neueste Version von Ghostscript.</li>
<li>Wenn eine EPS-Datei Fonts enth&auml;lt, stellen Sie sicher, da&szlig; die Fontpfade f&uuml;r Ghostscript richtig konfiguriert sind. Siehe <a href="gsfont.html">Ghostscript-Fonts</a> f&uuml;r weitere Hinweise.</li></ul>
<p>Es gibt zwei Methoden, EPS-Dateien zu importieren, und beide haben ihre Vor-und Nachteile. Die erste und oft bevorzugte Methode ist, EPS-dateien als native Vektorobjekte zu importieren. Die zweite ist, eine Datei einfach in einen Bildrahmen zu laden, genauso wie es bei GIMP oder Photoshop der Fall ist. Das hei&szlig;t, das Bild wird <em>gerastert</em> oder in eine Bilddatei umgewandelt.  Man mu&szlig; abw&auml;gen, welche Methode man anwendet, was teilweise an der Natur der EPS-Formats liegt. Wie im Fall des PDF-Formats sind die meisten, wenn nicht sogar alle EPS-Dateien nicht f&uuml;r Weiterbearbeitung gedacht, sondern es handelt sich um ein Austauschformat. Wenn Sie jedoch als native Scribus-Objekte importiert werden, kann ein Teil des Inhalts bearbeitet und verlustfrei skaliert werden.</p>

<h4>Import-Hinweise</h4>
<p>Eine meiner bevorzugten Methoden, EPS-Dateien zu importieren, sieht wie folgt aus: Schlie&szlig;en Sie alle Scribus-Dokumente. Gehen Sie dann auf <em>Datei > Importieren > EPS/PS-Dateien importieren</em> und w&auml;hlen Sie die Datei aus. Scribus erstellt nun eine Seite in den Dimensionen der importierten Datei. Speichern Sie die Datei als Scribus-Dokument und schlie&szlig;en Sie diese.</p>
<p>&Ouml;ffnen Sie das Zieldokument und erstellen Sie eine neue Ebene. Importieren Sie dann das gespeicherte Dokument auf die neue Ebene. Dadurch wird verhindert, da&szlig; eines der importierten Elemente mit anderen in Konflikt ger&auml;t, und au&szlig;erdem k&ouml;nnen Sie die Grafik pr&auml;zise plazieren.</p>
<h4>Weitere EPS/PS-Hinweise:</h4>
<ul>
   <li>Anwendern, die Illustrator 9.0 oder h&ouml;her verwenden, wird dringend empfohlen, in einem fr&uuml;heren Format (Version 7 oder darunter) zu speichern. Warum? Illustrator 9.0 und sp&auml;tere Versionen verwenden PDF als natives Format und betten nicht eben wenige Adobe-spezifische Daten in eine EPS-Datei ein, die beim Import Probleme  bereiten k&ouml;nnen (Scribus ist nicht als einziges Programm davon betroffen).</li>
   <li>Photoshop kann EPS exportieren, aber es handelt sich dabei meist um Rasterobjekte mit einigen Photoshop-Spezialit&auml;ten wie Ebenen und Transparenzmodi innerhalb einer EPS-Datei. Photoshop kann au&szlig;erdem eine besondere Form von EPS-Dateien exportieren, n&auml;mlich sogenannte DCS-Dateien (Desktop Color Separations). Diese EPS-Dateien importiert man am besten in einen Bildrahmen. Scribus (ab Version 1.3.4) wird dann die <strong>Erweiterten Bildeigenschaften</strong> aktivieren.<a href="psd.html">Weitergehende Hinweise zum Umgang mit Photoshop-Dateien</a></li>
<li>Es ist sehr zu empfehlen, keine Rasterbilder in EPS-Dateien zu verwenden und nur Vektordaten als EPS zu importieren, wenn es m&ouml;glich ist. Siehe unten.</li>
   <li>Scribus kann PS-Dateien, die mehrere Seiten enthalten, importieren. Wenn Sie eine solche Datei mit <strong>Datei > &Ouml;ffnen</strong> importieren, erzeugt Scribus so viele Seiten wie notwendig. Indes ist diese Vorgehensweise nicht f&uuml;r PS-Dateien zu empfehlen, die nur Text enthalten, denn zur Zeit wird Text in Kurven umgewandelt. Wenn Sie den Text ben&ouml;tigen, k&ouml;nnen Sie die PostScript-Datei mit GSView &ouml;ffnen oder das Kommandozeilenwerkzeug ps2asii verwenden, um den Text zu extrahieren. Ps2ascii funktioniert auch unter Windows und Mac OS X.</li>
<li>Falls es f&uuml;r Ihre Plattform verf&uuml;gbar ist, sollte GSView Ihre erste Wahl sein, wenn Sie PostScript-Dateien betrachten und untersuchen m&ouml;chten. Auch wenn es kein Farbmanagement unterst&uuml;tzt, wird es meist helfen, Importprobleme in Scribus zu analysieren. Wenn Sie <strong>M</strong> eingeben, erscheint ein Fenster, das h&auml;ufig hilfreiche diagnostische Informationen anzeigt.</li>
<li>Wenn Sie als EPS oder PostScript exportieren, achten Sie, wenn m&ouml;glich, darauf, da&szlig; die Schriften eingebettet sind.</li>
 </ul>
<h4>EPS-Dateien mit Rastergrafiken importieren</h4>
<p>Scribus kann EPS-Dateien importieren, die Rastergrafiken enthalten. Dies funktioniert jedoch sehr viel besser mit einer Ghostscript-Version ab 8.50, und es gibt einige Einschr&auml;nkungen:</p>
<ul>
<li>Bildmasken funktionieren nicht richtig.</li>
<li>Beschneidungspfade werden ignoriert.</li>
<li>Beim Import wird f&uuml;r jede enthaltene Bitmap-Datei (und das k&ouml;nnen sehr viele sein) eine TIF-Datei angelegt.</li>
</ul>
<h3>EPS-Dateien als Bilder importieren</h3>
<p>Wenn Sie eine EPS-Datei in Scribus importieren m&ouml;chten, die eine Mischung aus Text, Bitmap- und Vektorbildern enth&auml;lt, ist dies wahrscheinlich Ihre einzige Option. Wenn die Fonts korrekt eingebettet sind, funktioniert diese Methode normalerweise sehr zuverl&auml;ssig. CMYK-Farben, die in der EPS-Datei definiert sind, bleiben zuverl&auml;ssig erhalten. Beim Import ignoriert Scribus eingebettete TIF- oder PICT-Vorschaubilder und generiert eine eigene niedrigaufl&ouml;sende Vorschau. Wenn Sie nichts sehen, deutet dies auf ein Importproblem hin, das genauer untersucht werden mu&szlig;. Beim PDF-Export wird die EPS-Datei von Ghostscript neu gerendert, weil sie in die PDF-Datei eingebettet wird. Seien Sie also nicht &uuml;berrascht, wenn der PDF-Export lange dauert oder die Speicherauslastung stark ansteigt.</p>
</p>
<p>Um eine EPS-Datei als Bild zu importieren,</p>
<ul>
   <li>ziehen Sie einen neuen Bildrahmen auf</li>
   <li>w&auml;hlen Sie <strong>Bild laden</strong> im Kontextmen&uuml; eines Bildrahmens</li>
 </ul>
<h3>EPS-Dateien als native Scribus-Objekte importieren</h3>
<p>Eine EPS-Datei als natives Scribus-Objekt zu importieren, hat, wenn es m&ouml;glich ist, einige Vorteile. Zun&auml;chst handelt es sich um reine Vektordaten, so da&szlig; die Dateigr&ouml;&szlig;en beim Export ziemlich klein sind. Als Vektoren haben sie au&szlig;erdem keine Bildauf&ouml;sung, so da&szlig; sie beliebig vergr&ouml;&szlig;ert werden k&ouml;nnen, ohne ihre Sch&auml;rfe zu verlieren. Au&szlig;erdem k&ouml;nnen Sie die grafischen Elemente wie Linien, Polygone und Kurven mit den Scribus-Vektorwerkzeugen bearbeiten.</p>
<p>Um eine EPS-Datei als natives Scribus-Objekt zu importieren, gehen Sie wie folgt vor:</p>
<ul>
   <li><strong>Datei > Importieren > EPS/PS-Datei importieren</strong>  </li>
   <li>W&auml;hlen Sie EPS als Dateityp aus der Liste. Wenn Sie die Vorschau aktiviert haben, kann es einige Zeit dauern, bis gro&szlig;e und komplexe EPS-Dateien gerendert sind.</li>
   <li>Klicken Sie mit der linken Maustaste dorthin, wo die Grafik plaziert werden soll. Sobald die EPS-Datei eingef&uuml;gt ist, sind alle Bestandteile gruppiert. Sie m&uuml;ssen also die Gruppe aufl&ouml;sen, wenn Sie einzelne Objekte bearbeiten wollen. Um eine importierte EPS-Datei zu skalieren, fassen Sie sie an der rechten unteren Ecke an und ziehen mit der Maus, w&auml;hrend Sie Strg + Shift gedr&uuml;ckt halten. Damit wird die Grafik proportional skaliert.</li>
 </ul>


<h4>Probleml&ouml;sungen beim EPS-Import </h4>
<p>Wie oben erw&auml;hnt, schwankt die Exportqualit&auml;t anderer Anwendungen erheblich. Einige Programme m&ouml;gen es ungl&uuml;cklicherweise, ihre eigenen Spezialit&auml;ten einzubauen. Der erste Schritt, einen fehlgeschlagenen Import zu &uuml;berpr&uuml;fen, ist das &Ouml;ffnen der Datei in <a href="toolbox6.html">GSView</a>. Dr&uuml;cken Sie die Taste <strong>M</strong>, um die Ghostscript-Meldungen zu lesen, w&auml;hrend es versucht, die Datei zu &ouml;ffnen. Wenn das &Ouml;ffnen fehlschl&auml;gt, k&ouml;nnen die Meldungen manchmal etwas kryptisch erscheinen, aber sie sind hilfreich, um herauszufinden, was das Problem ist.</p>
<p></p>
</qt>