<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Scribus installieren</title>
</head>
<body>
<h2>Scribus installieren</h2>

<p>Der Installationsvorgang von Scribus h&auml;ngt davon ab, welche Linux/Unix-Distribution Sie verwenden. Das ist wie bei jedem anderen Programm, das Sie installieren m&ouml;chten. Die folgenden Beispiele zeigen, wie sich Scribus unter verschiedenen Distributionen installieren l&auml;&szlig;t:</p>
<table border="1">
	<tr bgcolor="#dddddd"><td>Linux-Distribution</td><td>Installationsmethode</td></tr>
	<tr bgcolor="#eeeeee"><td>Debian</td><td><code>apt-get install scribus</code> oder verwenden Sie besser einen der grafischen Paket-Manager wie &quot;Synaptic&quot;, mit denen die &quot;Recommends&quot; (Empfehlungen) korrekt abgearbeitet werden. Um  weitere Informationen zu erhalten, lesen Sie bitte <a href="install-dpkg.html">How to use the Scribus Debian Repository</a></td></tr>
	<tr bgcolor="#eeeeee"><td>Gentoo</td><td><code>emerge scribus</code></td></tr>
	<tr bgcolor="#eeeeee"><td>PLD</td><td><code>poldek -i scribus</code></td></tr>
	<tr bgcolor="#eeeeee"><td>RedHat/Fedora</td><td><code>rpm -Uvh ./scribus-1.x.rpm</code></td></tr>
	<tr bgcolor="#eeeeee"><td>Slackware</td><td>Installieren Sie von Quelldateien, bis Version 1.2 Teil von Slackware ist.</td></tr>
	<tr bgcolor="#eeeeee"><td>SuSE</td><td>Verwenden Sie Yast2 zur Installation, ODER: <code>rpm -Uvh ./scribus-1.x.rpm</code></td></tr>	
	<tr bgcolor="#dddddd"><td>Anderes OS</td><td>Installationsmethode</td></tr>
	<tr bgcolor="#eeeeee"><td>FreeBSD</td><td><code>cd /usr/ports/print/scribus; make install</code></td></tr>
	<tr bgcolor="#eeeeee"><td>Mac OSX</td><td>Bitte beachten Sie das Kapitel <a href="cross-platform.html">Cross Platform</a> </td></tr>
	<tr bgcolor="#eeeeee"><td>Windows&trade;</td><td>Bitte beachten Sie das Kapitel <a href="cross-platform.html">Cross Platform</a> </td></tr>
</table>

<p>Je nach Version Ihrer Distribution kann es sein, da&szlig; Sie verschiedene Abh&auml;ngigkeiten von Scribus aufl&ouml;sen m&uuml;ssen. Die oben genannten Befehle sollen daf&uuml;r sorgen, da&szlig; die hierzu notwendigen Pakete korrekt installiert werden.</p>
<p>F&uuml;r den Zugriff auf Schriftarten, die Sie in Scribus verwenden m&ouml;chten, ist Scribus zum Beispiel auf FreeType-Dateien angewiesen. Um bestm&ouml;gliche Ergebnisse zu erzielen, empfehlen wir den Einsatz von FreeType 2.1.9 oder dar&uuml;ber. Ohne einen gewissen Minimalstand an vorhandener Software k&ouml;nnen wir Ihnen nicht garantieren, da&szlig; Scribus korrekt funktioniert, und dies gilt auch f&uuml;r die Resultate, die Sie zu erreichen versuchen. Falls die oben genannten Befehle nicht alle Abh&auml;ngigkeiten in Ihrem System aufl&ouml;sen, beachten Sie bitte die Seite <a  href="install2.html">Requirements</a>, damit alles vorhanden ist.</p>
<p>Wenn Sie eine aktuellere Version von Scribus installieren m&ouml;chten, als sie in Ihrer Distribution enthalten ist, &uuml;berpr&uuml;fen Sie, da&szlig; alle <a href="install2.html">Requirements</a> erf&uuml;llt sind, und fahren Sie fort im Kapitel <a href="install1.html">Scribus Source</a>.</p>

</body>
</html>
