<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Mailinglisten</title>
</head>
<body>
<h2>Mailinglisten</h2>
<h3>Einleitung</h3>
<p>Scribus wird von einem Team entwickelt, dessen Mitglieder &uuml;ber den ganzen Globus verstreut sind. Hinzu kommen Beitragende aus allen Teilen der Welt. Aus diesem Grund geh&ouml;ren IRC und E-Mail zu den bevorzugten Kommunikationsformen.</p>
<p>Unsere Mailinglisten sind &ouml;ffentlich, d.h. da&szlig; jedermann nicht nur lesen kann, was dort gepostet wurde, sondern sich auch an den dort stattfindenden Diskussionen beteiligen kann. Wir ermutigen alle Interessierten, bei der Entwicklung von Scribus mitzuwirken und f&uuml;r das Prinzip Freier Software zu werben. Die Liste <code>scribus</code> behandelt die Benutzung von Scribus, Destop Publishing im allgemeinen, Hilfeanfragen von Benutzern sowie Ank&uuml;ndigungen. Die Liste <code>scribus-dev</code> dient Diskussionen rund um die Scribus-Entwicklung zwischen dem Teammitgliedern und der Scribus-Community.
</p>

<h3>Benutzung</h3>

<p>Jede Scribus-Mailingliste (im folgenden wird jeweils ein Platzhalter verwendet) hat eine E-Mail-Adresse in der Form <code>listname@lists.scribus.info</code>, eine Kontrolladresse in der Form <code>listname-request@lists.scribus.info</code> und eine Website: <a href="http://lists.scribus.info/mailman/listinfo/">http://lists.scribus.info/mailman/listinfo/</a>.</p>
<p>Um eine E-Mail an eine Liste zu senden, verschicken Sie diese einfach an eine der beiden Adressen. Wenn Sie die Liste abonnieren m&ouml;chten, um an diese gerichtete E-Mails zu lesen, sobald sie eintreffen, verwenden Sie die Kontrolladresse (s.u.).
</p>
<p>
Eine Aufstellung aller &ouml;ffentlich zug&auml;nglichen Mailinglisten finden Sie unter <a href="http://lists.scribus.info">http://lists.scribus.info</a>.</p>

<h3>Eine Liste abonnieren</h3>

<p>Jedermann kann eine Mailingliste abonnieren oder abbestellen, sofern diese Liste &ouml;ffentlich ist.</p>
<p>Sie k&ouml;nnen ein einfaches Webformular verwenden, um eine Liste zu abonnieren oder abzubestellen. Dieses finden Sie unter <a href="http://lists.scribus.info/">http://lists.scribus.info/</a>.</p>
<p>Anfragen bez&uuml;glich eines Abonnements oder der Abbestellung desselben k&ouml;nnen auch an eine Kontrolladresse (s.o.), aber bitte <b>unter keinen Umst&auml;nden</b> an eine regul&auml;re Listenadresse gerichtet werden.</p>
<p>Um eine Liste automatisch zu abonnieren oder abzubestellen, senden Sie eine E-Mail an eine Kontrolladresse, und zwar mit dem Betreff &raquo;subscribe&laquo; (Abonnement) oder &raquo;unsubscribe&laquo; (Abbestellung).</p>
<p>Als Teil des Registrierungsprozesses erhalten Sie automatisch eine E-Mail, auf die Sie antworten m&uuml;ssen. Dies ist eine Sicherheitsma&szlig;nahme, um zu verhindern, da&szlig; jemand Fremde ohne deren Wissen und Erlaubnis anmeldet.</p>
<p>Bitte beachten Sie, da&szlig; eine Abbestellung von der Adresse aus erfolgen sollte, die bei der Registrierung verwendet wurde. Sollte dies nicht m&ouml;glich sein, sollte der Betreff wie folgt aussehen: &raquo;unsubscribe subscribedaddress@subscribed.domain&laquo;</p>
<p>Wenn Sie E-Mails von einer Liste erhalten, aber nicht mehr wissen, unter welcher Adresse Sie sich registriert haben, k&ouml;nnen Sie diese im Kopf der E-Mail nachsehen:</p>
<p><pre>
    To: quux@example.com
    List-Id: <scribus.lists.scribus.info>
    Sender: scribus-bounces@lists.scribus.info
</pre></p>
<p>Daraus k&ouml;nnen Sie ersehen, da&szlig; die Liste <code>scribus</code> hei&szlig;t und die Registrierungsadresse <code>quux@example.com</code> lautet. In diesem fiktiven Fall w&uuml;rden Sie eine E-Mail an <code>scribus-request@lists.scribus.info</code> mit dem Betreff <code>unsubscribe quux@example.com</code> senden, um Ihr Abbonnement abzubestellen.</p>

<h3>Optionen f&uuml;r Abonnenten</h3>

<ul>
<li>Die Seite, auf der Sie verschiedene Optionen des Abonnements wahrnehmen k&ouml;nnen finden Sie unter http://lists.scribus.info/mailman/options/listname/email (z.B. http://lists.scribus.info/mailman/options/scribus/john.doe@example.com).</li>
<li>Ein anderer Weg, um Zugang zu Ihren Optionen zu erlangen, ist, indem Sie die Seite <a href="http://lists.scribus.info/mailman/listinfo/scribus">http://lists.scribus.info/mailman/listinfo/scribus</a>) aufsuchen und Ihre E-Mail-Adresse in das Feld &raquo;Unsubscribe or Edit Options&laquo; eingeben.</li>
<li>Wenn Sie nicht schon eingeloggt sind, sehen Sie oben auf der Seite ein Feld, in das Sie Ihr Pa&szlig;wort eingeben k&ouml;nnen. Falls Sie Ihr Pa&szlig;wort vergessen haben, klicken Sie auf &raquo;Email My Password To Me&laquo;. Sie erhalten dann ein neues Pa&szlig;wort per E-Mail zugesandt.</li>
</ul>
<h3>Verhaltensregeln</h3>

<p>Wenn Sie die Scribus-Mailinglisten benutzen, beachten Sie bitte folgende Regeln:</p>

<ul>
<li>Versenden Sie keinen Spam; siehe die Werberichtlinien weiter unten.</li>
<li>Verwenden Sie, falls m&ouml;glich, Englisch. Sie k&ouml;nnen aber auch eine andere Sprache probieren, denn die Scribus-Community ist vielsprachig, aber es ist nicht gesagt, da&szlig; Sie dann sofort eine Antwort erhalten. Die Mitglieder des Scribus-Teams k&ouml;nnen in folgenden Sprachen kommunizieren: Englisch, Deutsch, Niederl&auml;ndisch, Franz&ouml;sisch, Russisch, Ukrainisch, Finnisch, Tschechisch, Schwedisch und Luxemburgisch.
</li>
<li>
Achten Sie darauf, da&szlig; Sie die richtige Liste verwenden. Vor allem sollten Sie keine Anwenderfragen an die Entwicklerliste senden.</li>
<li>Es erleichert anderen das Leben, wenn Sie Ihr E-Mail-Programm so einstellen, da&szlig; eine Zeile nicht mehr als 80 Zeichen enth&auml;lt.</li>
<li>Vermeiden Sie es, auf Nachrichten anderer zu antworten, indem Sie die Antwort oberhalb der urspr&uuml;nglichen Nachricht plazieren (&raquo;Top Posting&laquo;). <a href="http://www.blakjak.demon.co.uk/gey_stv0.htm">Hier erfahren Sie, wieso</a>. Viele Abonnenten erhalten die Zusammenfassung, die ausgesprochen unleserlich wird, wenn die Antworten am Anfang einer Nachricht stehen.</li>
<li>
Senden Sie keine automatischen Abwesenheitsnachrichten an eine Liste.</li>
<li>
Senden Sie keine registrierungsbezogenen Anfragen an eine Liste, sondern verwenden Sie statt dessen die jeweilige <code>-request</code>-Adresse.
</li>
<li>Senden Sie <b>auf gar keinen Fall</b> Nachrichten im HTML-Format. Verwenden Sie statt dessen einfachen Text.</li>
<li>Vermeiden Sie es, gro&szlig;e Dateianh&auml;nge zu versenden. Es gibt eine Obergrenze hinsichtlich der Dateigr&ouml;&szlig;e, und Anh&auml;nge werden automatisch entfernt, so da&szlig; sie nur &uuml;ber die Web-Schnittstelle zug&auml;nglich sind.</li>
<li>Verwenden Sie nur die E-Mail-Adresse, mit der Sie registriert sind, um mit der Liste zu kommunizieren. Wenn Sie eine andere Adresse verwenden, wird Ihre Nachricht zur&uuml;ckgehalten, bis ein Moderator sie freigegeben hat.</li>
<li>Zitieren Sie keine Nachrichten, die Sie von anderen privat erhalten haben, wenn die Absender nicht zugestimmt haben.</li>
<li>Wenn Sie auf eine Nachricht von der Liste antworten, senden Sie keine Kopie (CC) zum urspr&uuml;nglichen Autor, wenn dieser nicht ausdr&uuml;cklich darum gebeten hat.</li>
<li>Wenn Sie eine Nachricht an eine Liste senden, die Sie nicht abonniert haben, sollten Sie dies immer erw&auml;hnen.</li>
<li>Verwenden Sie keine unfl&auml;tige Sprache. Bedenken Sie, da&szlig; manche Interessenten Mailinglisten &uuml;ber Medien abonniert haben, in denen das Fluchen illegal ist.</li>
<li>Beteiligen Sie sich nicht an sogenannten Flame Wars. Es ist einfach unh&ouml;flich.</li>
<li>Benutzen Sie immer Ihren gesunden Menschenverstand.</li>
</ul>

<h3>Unterhaltung und Verwaltung der Listen</h3>

<p>Manchmal sind unsere Server wegen Wartungsarbeiten nicht erreichbar. Werden Sie deshalb nicht gleich nerv&ouml;s, denn wir tun alles, um die Server so schnell wie m&ouml;glich wieder hochzufahren.</p>
<p>Falls Sie ein Problem mit Ihrem Abonnement haben (z.B. beim Registrieren oder Abmelden), lesen Sie bitte die obengenannten Informationen noch einmal genau durch.</p>
<p>Um die Listenadministratoren zu erreichen, senden Sie bitte eine E-Mail an: mailman@lists.scribus.info. Statt dessen k&ouml;nnen Sie auch einen Fehlerbericht in den <a href="http://bugs.scribus.net">Bugtracker</a> einstellen.
</p>
<p>Wenn sich Ihr Abonnement nicht abbestellen l&auml;&szlig;t, kopieren Sie bitte den Kopf einer E-Mail, die Sie von der Liste empfangen haben, in Ihre Nachricht an die Administratoren.
</p>

<h3>Haftungssauschlu&szlig;/Datenschutz</h3>

<p>Die Mailinglisten sind &ouml;ffentliche Foren.</p>
<p>Alle E-Mails, die an die Listen gesandt werden, werden allen Abonnenten zugesandt und au&szlig;erdem in einem &ouml;ffentlichen Online-Archiv gespeichert, das auch von Menschen durchsucht werden kann, die keine Abonnenten sind.</p>
<p>Dar&uuml;ber hinaus lassen sich die Mailinglisten als Usenet-Newsgroups durchsuchen, etwa &uuml;ber eine Web-Schnittstelle wie Google oder Gmane.</p>
<p>Es k&ouml;nnte weitere Stellen geben, unter denen die Listen zug&auml;nglich sind. Stellen Sie also sicher, da&szlig; Sie niemals vertrauliche oder unlizenzierte Inhalte an die Listen senden. Dazu geh&ouml;ren ausdr&uuml;cklich auch E-Mail-Adressen. Sie sollten wissen, da&szlig; Spammer, Viren und W&uuml;rmer gerne E-Mail-Adressen, die auf &ouml;ffentlichen Mailinglisten zug&auml;nglich sind, mi&szlig;brauchen.</p>
<p>
Das Scribus-Team betreibt seine Mailinglisten in gutem Glauben und wird alles unternehmen, um jeden Mi&szlig;brauch zu unterbinden und einen ununterbrochenen Betrieb zu gew&auml;hrleisten. Das Scribus-Team ist jedoch nicht f&uuml;r Nachrichten verantwortlich, die an die Listen gesendet werden, oder irgend etwas, das bez&uuml;glich dieser Nachrichten geschieht.</p>

<h3>Richtlinien in bezug auf Werbung</h3>

<p>Das Senden von unerbetener Massen-E-Mail (auch bekannt als Spam) an irgend eine der Scribus-Listen ist verboten. Absender solcher Nachrichten werden gesperrt und/oder den zust&auml;ndigen Beh&ouml;rden gemeldet.</p>
<p>Die Administratoren der Listen tun ihr Bestes, um zu verhindern, da&szlig; solche Nachrichten die Listen erreichen.</p>
<p>Viele der Regeln und Muster, die wir verwenden, um Spammer zu erkennen und ihre Nachrichten zu blockieren, wurden uns von Abonnenten mitgeteilt. Wenn Sie mithelfen m&ouml;chten, Spam noch effektiver zu verhindern, ist Ihre Mitwirkung hochwillkommen. Um Spam zu melden, senden Sie eine E-Mail an <code>mailman@lists.scribus.info</code>, in die Sie die URL zu der fraglichen Nachricht aus dem Listenarchiv kopiert haben. Sie erhalten eine Nachricht, sobald entsprechende Ma&szlig;nahmen ergriffen worden sind. Bitte beachten Sie, da&szlig; wir nur auf Berichte reagieren, die innerhalb der letzten Stunden eingegangen sind, weil es wenig Sinn ergibt, veraltete Filterregeln zu pflegen.</p>
<p>Erlauben Sie nicht, da&szlig; E-Mails, die Sie von einer Scribus-Liste erhalten, zu einem Anti-Spam-System weitergeleitet werden. Sie k&ouml;nnten damit allen Anwendern schaden, und Sie w&uuml;rden uns zwingen, die Weiterleitung von Nachrichten an Ihre Adresse zu blockieren, bis Sie glaubhaft machen k&ouml;nnen, da&szlig; sie dies nicht wieder tun.</p>

<h3>Lizenz</h3>
<p><i>Dieses Dokument basiert auf der Beschreibung der Mailinglisten des Debian-Projekts. Dieses Material darf nur unter den Bedingungen der Open Publication License, Entwurf v1.0 oder h&ouml;her vertrieben werden. Die aktuelle Version finden Sie normalerweise unter <a href="http://www.opencontent.org/openpub/">http://www.opencontent.org/openpub/</a>.</i></p>
<br>
</body>
</html>
