<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Hinweise zur Mausbenutzung</title>
</head>
<body>
<h2>Hinweise zur Mausbenutzung</h2>

<p>F&#252;r die Mausbenutzung bietet Scribus einige ausgekl&#252;gelte Funktionen, die, wenn man sie einmal gelernt hat, sehr n&#252;tzlich sind.</p>
<ul>
<li>Leertaste + linke Maustaste schaltet in den Modus zum Verschieben des Fensterinhaltes mit dem "Handsymbol"</li>
<li>Klicken Sie die mittlere Maustaste oder, wenn Sie nur eine Zweitastenmaus besitzen, beide Maustasten, um die Anzeige zu aktualisieren.</li>
<li>Mit Strg + Shift + linke Maustaste w&#228;hlen Sie Objekte aus, die auf derselben Ebene unter anderen Objekten liegen.</li>
<li>Strg + Linke Maustaste dient zur Gr&#246;&#223;en&#228;nderung und zum Verschieben von tieferliegenden Objekten. Wenn Sie Strg loslassen, k&#246;nnen Sie nur die Gr&#246;&#223;e &#228;ndern, wenn Sie Strg gedr&#252;ckt halten, k&#246;nnen Sie das Objekt verschieben.</li>
<li>Mit der linken Maustaste &#228;ndern Sie die Gr&#246;&#223;e von Objekten.</li>
<li>Mit der rechten Maustaste kopieren oder verschieben Sie Objekte. Es erscheint ein Kontextmen&#252;, das Sie fragt, welche Aktion Sie ausf&#252;hren m&#246;chten.</li>
<li>Strg + Mausrad &#228;ndert die Vergr&#246;&#223;rungsstufe </li>
<li>Strg + rechte Maustaste schaltet in den Modus zum Verschieben des Fensterinhaltes mit dem "Handsymbol"</li>
</ul>

<h4>Arbeiten mit dem Farbw&#228;hler:</h4>
<ul><li>Linke Maustaste = F&#252;llfarbe</li>
<li>Strg + linke Maustaste = Textfarbe</li>
<li>Alt + linke Maustaste = Linienfarbe</li></ul>
<h4>In der Eigenschaftenpalette:</h4>
<ul>
<li>Strg + Mausrad erh&#246;ht bzw. verringert die Zahl der Einheiten um 10.</li>
<li>Shift + Mausrad erh&#246;ht bzw. verringert die Zahl der Einheiten um 1/10.</li>
<li>Strg + Shift + Mausrad erh&#246;ht bzw. verringert die Zahl der Einheiten um 1/100.</li>
</ul>
<p>Alternativ:</p>
<ul>
<li>Shift + Pfeiltaste erh&#246;ht bzw. verringert die Zahl der Einheiten um 10.</li>
<li>Strg + Pfeiltast erh&#246;ht bzw. verringert die Zahl der Einheiten um 1/10.</li>
</ul>
</body>
</html>