<qt>
<title>Musterseiten &ndash; Verwendung der Seitenpalette</title>
	
<h3>Musterseiten &ndash; Verwendung der Seitenpalette</h3>

<p>Musterseiten sind ein Mittel, um sich auf mehreren Seiten wiederholende Inhalte wie Seitenzahlen, Kapitelnamen, Abschnitts&uuml;berschriften und dergleichen nur einmal einzuf&uuml;gen. Grundlegend f&uuml;r das Verst&auml;ndnis der Funktionsweise von Musterseiten ist die Tatsache, da&szlig; diese nicht von normalen Seiten aus berabeitet werden k&ouml;nnen. Alle Objekte au&szlig;er Seitennummern sindd statische Hintergrundobjekte.</p>

<p>Der gut durchdachte Einsatz von Muserseiten und Stilen kann Ihre Arbeit am Layout erheblich vereinfachen und beschleunigen &ndash; je komplexer das Dokument, desto wichtiger sind sind sie. Der h&auml;ufigste Einsatzzweck von Musterseiten d&uuml;rfte das Einf&uuml;gen von Seitenzahlen sein. Lassen Sie uns also damit beginnen.</p>

<h4>Automatische Seitenzahlen einf&uuml;gen</h4>
<p>Es ist wirklich ganz einfach. Gehen Sie auf <strong>Bearbeiten > Musterseiten</strong> und ziehen Sie einen Textrahmen an der Stelle auf, an der die Seitenzahl stehen soll. Klicken Sie in den Textrahmen und dr&uuml;cken Sie die Tastenkombination Strg+Alt+Shift+P. Speichern Sie die Musterseite und schlie&szlig;en Sie den Musterseitendialog.</p>

<h4>Die Seitenpalette</h4>


<p>Die Seitenpalette erm&ouml;glicht es Ihnen, per Ziehen und Ablegen schnell Musterseiten anzuwenden, im Dokument zu navigieren sowie Seiten zu verschieben und einzuf&uuml;gen. Der obere Teil der Palette zeigt die verf&uuml;gbaren Musterseiten an, weiter unten sehen Sie die in Ihrem Dokument vorhandenen Seiten.</p>

<table width="100%"><tr><td align="center"><img src="images/pagetemplate1.png" title="Die Seitenpalette" alt="Die Seitenpalette" align="center" /></td></tr></table>


<p>In der Seitenpalette k&ouml;nnen Sie folgendes tun:</p><ul>
<li>Sie k&ouml;nnen eine neue Seite erstellen, indem Sie eine Musterseite in das Fenster mit den angezeigten Seiten ziehen. Sobald Sie einen horizontalen Balken sehen, lassen Sie die linke Maustaste los.</li>
<li>Sie k&ouml;nnen eine Musterseite anwenden, indem Sie diese mit der Maus auf eine angezeigte Seite ziehen.</li>
<li>Sie k&ouml;nnen eine Seite oder Musterseite l&ouml;schen, indem Sie sie auf das M&uuml;lleimersymbol ziehen.</li>
<li>Sie k&ouml;nnen Seiten mit der Maus verschieben. Sobald Sie einen horizontalen Balken sehen, lassen Sie die linke Maustaste los.</li>
<li>Wenn Sie mit der linken Maustaste auf eine Seite klicken, wird diese im Programmfenster angezeigt.</li>
<li>Sie k&ouml;nnen eine Vorschau der Muserseiten an- und abschalten, indem Sie mit der rechten Maustaste in das Feld mit den Musterseiten klicken.</li>
<li>Wenn Sie auf eine Musterseite klicken, wechselt Scribus in den Bearbeitungsmodus f&uuml;r Musterseiten.</ul></li>



<!--<p>Above is an example of how to use a template which allows you to have recurring objects on several pages. The template page is has a background of black tinted at 5% to simulate glossy grey paper with a faded logo in the background. The eliminates the time to recreate this on each page.
</p>-->


<h4>Musterseiten</h4>
<p>Wenn Sie mehrere Vorlagen ben&ouml;tigen, die viele gemeinsame Elemente ben&ouml;tigen, k&ouml;nnen Sie Zeit sparen, wenn Sie eine einzige Vorlage mit diesen Elementen erzeugen und die Musterseite anschlie&szlig;end duplizieren, anstatt jede Seite einzeln aufzubauen.</p>
<p>Eine andere n&uuml;tzliche Eigenschaft von Scribus ist die M&ouml;glichkeit, Musterseiten aus anderen Dateien zu importieren. Wenn ein Buch beispielweise verschiedene Vorlagen f&uuml;r einzelne Kapitel ben&ouml;tigt, kann man entsprechende Musterseiten aus einer anderen Scribus-Datei importieren.</p>
</qt>