<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Automatische Seitennumerierung</title>
</head>
<body>
<h2>Automatische Seitennumerierung</h2>

<p>Das Einf&uuml;gen von automatisch hochz&auml;hlenden Seitenzahlen ist ein zweistufiger Proze&szlig;, der, wenn man ihn einmal gelernt hat, sehr einfach ist. Es gibt zwei verschiedene Methoden, die unabh&auml;ngig voneinander verwendet werden k&ouml;nnen. Die erste ist, einen Textrahmen aufzuziehen, darauf doppelzuklicken und dann den Men&uuml;befehl <strong>Einf&uuml;gen > Zeichen > Seitenzahl</strong> anzuwenden. Damit f&uuml;gen Sie die Seitennummer lediglich auf der aktuellen Seite ein. Die zweite Methode verwendet daher Musterseiten, um Seitenzahlen automatisch auf jeder Seite zu erzeugen.</p>

<p>Scribus verwendet eine spezielle Variable in <a href="pagetemplate1.html">Musterseiten</a>, um die Seitenzahlen anzuzeigen. Auf diese Weise werden diese automatisch im Dokument gespeichert, ohne da&szlig; Sie sich Gedanken beim Verschieben, Importieren oder L&ouml;schen von Seiten machen m&uuml;&szlig;ten.</p>

<h4>Schritt eins</h4>

<p>Wenn Sie ein Dokument ge&ouml;ffnet haben, gehen Sie zum Men&uuml;punkt <strong>Bearbeiten > Musterseiten</strong>. Falls Sie noch keine Musterseite angelegt haben, werden Sie nur eine einzige vorfinden, die den Namen "Normal" tr&auml;gt.</p>

<h4>Schritt zwei</h4>
<p>Ziehen Sie als n&auml;chstes einen Textrahmen an der Stelle auf, an der die Seitennummer auf jeder Seite erscheinen soll. Klicken Sie dann doppelt auf den Textrahmen und f&uuml;gen Sie die Seitennummer ein wie oben beschrieben. Je nachdem, wie viele Seiten Ihr Dokument enth&auml;lt, m&uuml;ssen Sie bis zur Version 1.3.3.x verschiedene Mustserseiten f&uuml;r ein-, zwei- oder dreistellige Seitennummern anlegen. Ab Version 1.3.4 gen&uuml;gt die Eingabe eines einzigen Platzhalters. Speichern Sie dann Ihre Musterseiten, indem Sie den Musterseiten-Dialog schlie&szlig;en. Anschlie&szlig;end wenden Sie Ihre pr&auml;parierten Musterseiten auf die entsprechenden Seiten an.</p>

<table width="100%"><tr><td align="center"><img src="images/pagenumbering.png" title="Inserting Page Number placeholders." alt="Inserting Page Number placeholders"  /></td></tr></table>

<p>Falls Sie mehr als eine Sorte Musterseiten verwenden, m&uuml;ssen Sie die Variable auf allen Musterseiten einf&uuml;gen, die Seitennummern anzeigen sollen.</p>

<p>Auf Variablen f&uuml;r Seitennummern k&ouml;nnen Sie wie auf jeden anderen Text Stile und direkte Formatierungen anwenden, genau wie auf jeden anderen Textrahmen.</p>
</body>
</html>
