<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>PDF-Export mit Scribus</title>
</head>
<body>
<h2>PDF-Export mit Scribus</h2>
<h3>Verlauf des PDF-Exports mit Scribus</h3>

<p>Neben der sp&auml;ter noch beschriebenen interaktiven PDF-Erstellung eines bestimmten Dokuments gibt es grunds&auml;tzlich vier Wege, auf die sich PDF-Dateien erzeugen lassen:</p>
<ol>
<li>
<p><strong>Download aus dem Netz - Lesen auf dem Bildschirm - Interaktive Formbl&auml;tter</strong> - Folgen Sie diesem Arbeitsverlauf, wenn eine minimale Dateigr&ouml;&szlig;e erw&uuml;nscht und hochaufl&ouml;sender Druck nicht ben&ouml;tigt wird.</p>
</li>
<li>
<p><strong>Pr&auml;sentationseffekte</strong> - Als Einstellung wird empfohlen, die Abtastrate aller Grafiken auf 72, 96 oder 120 dpi zu reduzieren, je nach Ausl&ouml;sung des verwendeten Bildschirms. Betten Sie alle Schriftarten ein. Die Seitenorientierung als Querformat verschafft Ihnen auf dem Bildschirm die gr&ouml;&szlig;tm&ouml;gliche Fl&auml;che f&uuml;r das Objekt, falls Sie vorhaben, einen Videoprojektor zu verwenden. Weitere Tipps zu Pr&auml;sentationen und PDF werden folgen.</p>
</li>
<li>
<p><strong>Professionelle Druckvorlagen</strong> - Verzichten Sie auf die Verringerung der Abtastrate sowie auf jegliche Bildkompression, wenn die Bildqualit&auml;t von gr&ouml;&szlig;ter Wichtigkeit ist. Alle Grafiken, die als plazierte Bilder in Scribus eingebracht wurden, sollten wenigstens 200 dpi aufweisen; bei Fotos oder TIFF-Dateien sollten es 300 dpi oder mehr sein. Strichzeichnungen oder Vektorgrafiken, die von einem Programm wie Illustrator ins EPS-Format konvertiert wurden, sollten wenigstens 800 dpi aufweisen, um ein optimales Ergebnis zu erzielen. Die meisten vektorisierten EPS-Dateien lassen sich direkt als native Scribus-Objekte importieren, was nach M&ouml;glichkeit stets vorzuziehen ist. <strong>Wenn Ihre Druckerei mit dem Farbmanagement f&uuml;r PDF/X-3 umgehen kann, so ist dies die angezeigte Methode f&uuml;r optimale Ergebnisse. Da diese aber nur von der aktuellsten Drucktechnologie unterst&uuml;tzt wird, sollten Sie sie wirklich nur einsetzen, wenn die Druckerei gr&uuml;nes Licht gegeben hat.</strong></p>
</li>
<li>
<p><strong>Optimale Ausdrucke</strong> - Hiermit ist eine PDF-Qualit&auml;t gemeint, die zur Ausgabe auf einem B&uuml;ro-Laserdrucker oder Tintenstrahldrucker bestimmt ist. Empfohlene Einstellungen: Abtastraten aller Grafiken auf 300 dpi oder weniger reduzieren, Schriftarten einbetten sowie den Seitenr&auml;ndern genug Spielraum geben, damit die Seitenbeschr&auml;nkungen bei Desktop- bzw. gew&ouml;hnlichen B&uuml;ro-Laserdruckern eingehalten werden (etwa 6/10 Zoll oder 15cm).</p>
</li>
</ol>
</body>
</html>