<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>PDF-Export mit Scribus</title>
</head>
<body>
<h2>PDF-Export mit Scribus</h2>

<h3>&Uuml;berblick</h3>

<p>Die Kompetenz und Flexibilit&auml;t von Scribus beim PDF-Export ist eines seiner hervorstechenden Merkmale. Hier all seine Funktionen vollst&auml;ndig zu dokumentieren, das w&uuml;rde fast ein gesondertes Kapitel n&ouml;tig machen. Ich empfehle Ihnen, diesen Einf&uuml;hrungsteil aufmerksam zu lesen, um sich mit allen PDF-Funktionen und M&ouml;glichkeiten vertraut zu machen, wobei Sie sich zugleich einige der von Scribus erstellten PDF-Dokumente anschauen sollten, die im Download-Bereich von <a href="http://www.scribus.net">www.scribus.net</a> verf&uuml;gbar sind.</p>
<p>Die Plattformunabh&auml;ngigkeit von PDF macht es Scribus-Anwendern m&ouml;glich, einige potenzielle H&uuml;rden zu &uuml;berwinden, die Linux und DTP eigen sind. Scribus exportiert zuverl&auml;ssig und in hoher Qualit&auml;t ein &quot;druckreifes&quot; PDF-Ergebnis. Darin enthalten sind die neuen Besonderheiten der PDF-Version 1.4, ein ISO-konformes PDF/X-3 sowie PDFs mit ICC-Farbmanagement, dank <a href="http://www.littlecms.com">Little CMS</a>. Falls Ihre Druckerei sich skeptisch zeigt, verweisen Sie bitte auf <a href="prepress.html">Scribus Druckvorstufe</a>. Das ist ein PDF-Dokument zum Herunterladen, in dem Druckvorstufen-Tests mit Scribus dargelegt sind, erg&auml;nzt durch weitere Zusatzinformationen.</p> 
<p>Wenn Scribus nur hochaufl&ouml;sende PDFs bester Handelssorte erzeugte, so w&uuml;rde das allein schon reichen, es ein gro&szlig;artiges Anwendungsprogramm zu nennen. Ein Plus ist seine einfach zu nutzende Vielseitigkeit: Es erstellt Pr&auml;sentationen &aacute; la Powerpoint oder internetf&auml;hige, interaktive PDF-Formbl&auml;tter f&uuml;r den Elektronischen Dokumentenaustausch, und es kann mittels JavaScript bestimmte Elemente innerhalb  der PDF-Datei steuern. Scribus verf&uuml;gt &uuml;ber weitere benutzerfreundliche Funktionen wie Anmerkungen, Lesezeichen - und falls erw&uuml;nscht oder ben&ouml;tigt: Dokumentensicherheit.</p>
<p>W&auml;hrend PDF in gewisser Hinsicht einen propriet&auml;ren Standard darstellt, ist es au&szlig;erdem auf quasi jeder Computer-Plattform weitreichend verf&uuml;gbar. Dar&uuml;ber hinaus ist es bestens dokumentiert. Das Benutzerhandbuch zu PDF 1.5 umfa&szlig;t <em>lediglich</em> 1.100 Seiten. Die F&auml;higkeiten von PDF in Scribus erm&ouml;glicht die <strong>Neuorientierung</strong> eines Dokuments. Ein Dokument kann erstellt werden f&uuml;r den Druck, zum Herunterladen aus dem Netz oder f&uuml;r Pr&auml;sentationszwecke wie bei StarOffice Impress oder MS PowerPoint. Da&szlig; dies beim DTP als ein Zukunftstrend gelten kann, zeigt sich darin, da&szlig; eben diese Strategie sowohl in Adobes InDesign 2.0+ wie auch in den neuen PDF-F&auml;higkeiten von Quark Xpress 6 und Adobe Illustrator 10+ zu finden ist. Beim elektronischen Publishing und der Druckvorstufen-Produktion haben beide eine Vielzahl von PDF-Verbesserungen erfahren, wodurch die Beschr&auml;nkungen von HTML bzw. des traditionellen PostScript oftmals aufgehoben werden.</p>
<p>Die besten Bildschirm- oder Druckergebnisse erzielen Sie mit der neuesten Version des Acrobat Reader 5.0.8 f&uuml;r Linux bzw. Version 6.0+ auf anderen Plattformen, soweit verf&uuml;gbar. Tests haben gezeigt, da&szlig; der Linux-Version einiges an Funktionalit&auml;t fehlt, insbesondere bei den JavaScript-F&auml;higkeiten der Versionen 4.05 und 5.0.8 unter Linux. Einige dieser Fehler sind beim Acrobat Reader 5.0.5+ auf dem Apple Macintosh oder unter Win32 nicht vorhanden.</p>
<p>Eine der Herausforderungen bei PDF- und EPS-Betrachterprogrammen unter Linux ist, da&szlig; Scribus hochqualitative Dokumente in PostScript-Level 3 und PDF 1.4 erstellt, deren Leistungsverm&ouml;gen die meisten freien (Open Source) Betrachterprogramme &uuml;berfordert. Einige dieser Funktionen werden nur von kommerziellen Druckvorstufen- oder DTP-Programmen unterst&uuml;tzt. Nach mehr als zweij&auml;hriger Arbeit mit Scribus bin ich zu dem Schlu&szlig; gekommen, da&szlig; folgende 3 Betrachterprogramme zur Darstellung von PS/EPS/PDF-Dokumenten, die von Scribus erzeugt wurden, am zuverl&auml;ssigsten sind:</p>
<ul>
<li><strong>Acrobat Reader 5.0.8+ f&uuml;r Linux</strong> - Die beste und manchmal einzige Wahl zur PDF-Betrachtung. Detaillierte Anmerkungen und Tipps: <a href="toolbox1.html">Adobe Reader</a>.</li>
<li><strong>GSview 4.7+</strong> - mit der neuesten erh&auml;ltlichen Ghostscript-Version. Diese Kombination ist die beste Wahl zum Betrachten von EPS- oder PS-Dateien sowie der meisten PDF-Dokumente. Dar&uuml;ber hinaus besitzt GSview viele andere n&uuml;tzliche F&auml;higkeiten, dank Erweiterungen wie <code>pstoedit</code> und <code>epstool</code>. Weitere Einzelheiten und Tipps finden Sie hier: <a href="toolbox6.html">GSview</a>. Ich betrachte es als ein f&uuml;r Linux unerl&auml;&szlig;liches Programm.</li>
<li><strong>Kpdf 3.4+</strong> - Dieser aktualisierte PDF-Betrachter von KDE 3.4 besitzt eine neue Rendering-Maschine und kann PDF 1.5-Dateien darstellen.</li>
</ul>
<p><strong>Wenn Sie irgendeinen anderen PDF- oder EPS- Betrachter verwenden, der die von Scribus erzeugten PDF-Dateien nicht darstellen kann, diese jedoch im Acrobat Reader einwandfrei zu sehen sind, schreiben Sie dem Programmautor einen Fehlerbericht. In praktisch allen F&auml;llen, die ich getestet habe, liegt die Beschr&auml;nkung beim Betrachterprogramm. Scribus-PDFs werden t&auml;glich mit spezieller Druckvorstufen-Software getestet, um die Einhaltung der offiziellen PDF-Spezifikationen zu &uuml;berpr&uuml;fen.</strong></p>
</body>
</html>
