<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>PDF-Export mit Scribus</title>
</head>
<body>
<h2>PDF-Export mit Scribus</h2>
<h3>PDFs zur Bildschirmdarstellung und f&uuml;r Online-Formbl&auml;tter</h3>
<p>W&auml;hlen Sie folgende Einstellungen, wenn schnelles Herunterladen und/oder eine geringe Dateigr&ouml;&szlig;e das Wichtigste sind.</p>

<p><b>Empfohlene Einstellungen und Tipps:</b></p>

<ul>
	<li>Verringern Sie die Abtastrate aller Bilder auf 72-96 dpi.</li>
	<li>Betten sie keine Schriftarten ein. Um ein halbwegs geschlossenes Layout sicherzustellen, w&auml;hlen Sie als Schriftarten die &quot;Base 14 Fonts&quot;, die normalerweise in allen Versionen des Acrobat Readers enthalten sind und deren Ghostscript-Ersetzungen &auml;hnlich sind. Hierzu geh&ouml;ren die Grundvarianten von Courier, Helvetica, Times New Roman, Symbol und Zapf Dingbat, die allesamt auf den meisten PC-Plattformen &auml;hnlich sind.</li> 
	<li>W&auml;hlen Sie als Kompressionsstufe die geringste Einstellung, die auf dem Bildschirm noch eine akzeptable Lesequalit&auml;t darstellt.</li>
	<li>In vielen F&auml;llen l&auml;&szlig;t sich Arial durch Helvetica ersetzen, zumal diese Schriftart im sp&auml;ter benutzten Betrachterprogramm bereits enthalten sein d&uuml;rfte.</li> 
	<li>Verzichten Sie darauf, EPS- oder PDF-Dateien in Ihr Document zu nehmen - Konvertieren Sie sie stattdessen mittels GSview nach PNG und plazieren sie anschlie&szlig;end in Ihrem Scribus-Dokument. Weshalb? Sie sind im Bildschirmaufbau schneller und liefern oft kleinere Dateien.</li>
	<li>Verwenden Sie m&ouml;glichst keine Nimbus-Schriiftarten, es sei denn als Subset. Der Acrobat Reader arbeitet auf anderen Plattformen teilweise nicht korrekt und f&uuml;hrt Ersetzungen mit seinen eigenen Schriftarten durch. Ein anderes Problem, da&szlig; Ihnen begegnen kann, ist die Alias-Gleichsetzung von Helvetica als &quot;Nimbus Sans L&quot; bei vielen Distributionen.</li>
	<li>Wenn Sie f&uuml;r Grafiken keine Transparenz ben&ouml;tigen, w&auml;hlen Sie PDF 1.3 als Ausgabeformat, wodurch die gr&ouml;&szlig;te Kompatibilit&auml;t zu anderen Anwendern erreicht wird.</li>
</ul>
</body>
</html>