<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Gestion des couleurs avec Scribus, une introduction</title>
</head>
<body>
<h2>Gestion des couleurs avec Scribus, une introduction</h2>

<h4>Activation de la gestion des couleurs</h4>
<p>Pour que la gestion des couleurs fonctionne correctement, les &eacute;l&eacute;ments suivants doivent &ecirc;tre install&eacute;s, actifs et utilisables :</p>
<ul><li>Les librairies LittleCMS doivent &ecirc;tre install&eacute;es et Scribus, compil&eacute; avec le support lcms. Vous pouvez le savoir en regardant dans <strong>Aide > &Agrave; propos de Scribus</strong> et en cherchant C-C-T. Le premier C signifie que Scribus est compil&eacute; avec le support LittleCMS. C'est le standard avec Mac OSX et Windows.</li>
<li>Vous avez besoin au <strong>minimum</strong> d'un profil RVB et CMJN. Scribus vient avec deux profils de base qui garantissent que CMS pourra &ecirc;tre activ&eacute; imm&eacute;diatement. En pratique, vous en aurez besoin de plus. Un sRVB pour la plupart des couleurs RVB et un autre pour chaque p&eacute;riph&eacute;rique couleur. Un pour votre &eacute;cran qui est cr&eacute;&eacute; &agrave; l'aide de l'outil de profilage d'&eacute;cran. Plusieurs profils CMJN pour imprimer. Quelques profils CMJN sont reconnus comme "standard d'impression", c'est-&agrave;-dire qu'ils repr&eacute;sentent des standards d'impression communs utilis&eacute;s en Am&eacute;rique du Nord et en Europe. L'id&eacute;al est de t&eacute;l&eacute;charger la version "Windows" de la suite profil Adobe ICC et de la d&eacute;comprimer dans un r&eacute;pertoire tel que $home/.colors/icc. Les utilisateurs de Linux peuvent &eacute;galement t&eacute;l&eacute;charger gratuitement les profils redistribuables &agrave; partir de la section <a href="http://www.scribus.org.uk/modules.php?op=modload&name=Downloads&file=index&req=viewdownload&cid=16">ICC downloads</a> sur <a href="http://www.scribus.net">www.scribus.net</a> </li>
<li>Sur Linux, Scribus cherchera par d&eacute;faut dans :
 <pre>$home/.color/icc</pre> et <pre>/usr/share/color/icc/</pre>
pour les profils icc ou syst&egrave;me. Il existe une petite collection en expansion de profils icc gratuits pour le t&eacute;l&eacute;chargement &agrave; <a href="http://www.scribus.net">www.scribus.net</a>. Regardez dans la section Downloads > ICC . Scribus sur Windows ou Mac OSX cherchera dans le r&eacute;pertoire syst&egrave;me par d&eacute;faut. Les versions ant&eacute;rieures de Scribus chercheront dans le r&eacute;pertoire indiqu&eacute; dans les pr&eacute;f&eacute;rences.</li>
<li>Si vous n'&ecirc;tes pas familiaris&eacute; avec la gestion des couleurs, prenez le temps de parcourir les liens et la documentation indiqu&eacute;s &agrave; ce sujet dans www.scribus.net. Ils approfondissent la th&eacute;orie et les concepts.</li></ul>
<h4>Aper&ccedil;u</h4>
<p>L'objectif d'un syst&egrave;me de gestion des couleurs est d'att&eacute;nuer les diff&eacute;rences qui peuvent exister entre le rendu des couleurs &agrave; l'&eacute;cran et celui de l'imprim&eacute; final, mais aussi de pointer les couleurs qui se positionnent en dehors des gammes reproductibles de votre syst&egrave;me d'impression. Il faut prendre la pr&eacute;caution de fournir un profil d'imprimante, et un autre pour votre &eacute;cran, qui soient raisonnablement pr&eacute;cis. Pour les utilisateurs d'autres applications ou les nouveaux venus &agrave; la PAO, les param&egrave;tres par d&eacute;faut et les descriptions peuvent sembler un peu d&eacute;routants. Sans connaissance pr&eacute;alable des termes, il est en effet <strong>assez</strong> facile de se tromper de r&eacute;glage. De telles erreurs peuvent alt&eacute;rer l'affichage &agrave; l'&eacute;cran ou &agrave; l'impression. Il arrive donc que les d&eacute;butants se lassent vite de tout cela et d&eacute;sactivent la gestion des couleurs.</p>

<p>En un mot : <strong>ATTENTION</strong>. D&egrave;s que vous aurez compris quelques concepts primordiaux et conna&icirc;trez la destination finale de votre imprim&eacute;, vous serez capable de pr&eacute;voir &agrave; quoi ressemblera votre document. Cela vous sera particuli&egrave;rement utile pour produire des reproductions en quadrichromie ou des PDF haute r&eacute;solution. Le type de gestion des couleurs support&eacute; par Scribus, &agrave; mon avis, est le premier du genre pour un programme Open Source. Les am&eacute;liorations futures apporteront un contr&ocirc;le encore plus fin de la reproduction des couleurs. Les r&eacute;centes versions CUPS 1.1.15 et suivantes supportent maintenant une vraie impression couleur en CMJN. La nouvelle version de LittleCMS 1.16 a introduit de nombreuses nouveaut&eacute;s qui am&eacute;liorent les capacit&eacute;s de Scribus pour un rendu exact des couleurs, tout en accroissant ses performances g&eacute;n&eacute;rales.</p>

<p>Voici les &eacute;tapes &agrave; respecter pour un fonctionnement optimal (ce que vous affichez est ce que vous imprimez) :</p>

<ol>
	<li>Renseignez-vous un peu sur les concepts et termes de la gestion des couleurs. Suivez les liens ci-dessous.</li>
	<li>Param&eacute;trez correctement les profils. Vous trouverez ci-dessous une liste d'outils disponibles pour Linux. Le plus important est
de trouver un bon profil d'&eacute;cran. Les profileurs prof font un excellent travail de cr&eacute;ation de profils d'&eacute;cran. Vous trouverez <a href="moncal.html">ici</a> une marche &agrave; suivre pour cr&eacute;er des profils ICC adapt&eacute;s &agrave; votre &eacute;cran &agrave; l'aide des outils lprof. <strong>Sans un profil &eacute;cran correctement cr&eacute;&eacute;, l'activation de la gestion des couleurs vous donnera des r&eacute;sultats insatisfaisants &agrave; l'impression et des aper&ccedil;us &agrave; l'&eacute;cran non repr&eacute;sentatifs.</strong> </li>
	<li>Int&eacute;grez le profil d'image aussi souvent que possible. </li>

</ol>

<p>Le syst&egrave;me de gestion des couleurs int&eacute;gr&eacute; &agrave; Scribus est pr&eacute;vu pour permettre une gestion logicielle des images du document. Scribus peut aussi signaler les couleurs non reproductibles &agrave; l'impression. (La plupart des imprimantes poss&egrave;dent une gamme de couleurs plus &eacute;troite quand on les compare &agrave; la majorit&eacute; des &eacute;crans.) Il n'incorpore pas les profils dans vos images ni ne les transforme au moment de l'impression. Quelques images PNG ou TIFF peuvent contenir un profil icm ou icc dans l'en-t&ecirc;te de fichier.  Le fichier est alors dit <strong><em>balis&eacute;</em></strong> par le profil couleur.  Plus avant, nous d&eacute;crirons comment et quand il serait appropri&eacute; d'utiliser LittleCMS ou Photopaint pour appliquer une <strong>balise</strong> ou inclure un profil de couleur. Si un fichier est <strong>balis&eacute;</strong>, Scribus travaillera avec LittleCMS pour lire ce profil &agrave; l'int&eacute;rieur de l'image et l'utilisera pour afficher plus fid&egrave;lement les couleurs de l'image. Si une image ne contient pas d'information de profil et si vous connaissez le profil du p&eacute;riph&eacute;rique qui devrait y &ecirc;tre assign&eacute;, vous pouvez toujours utiliser les param&egrave;tres CMS pour pr&eacute;visualiser votre document avec le profil temporaire. Mais attention, n'assignez jamais un mauvais profil &agrave; moins que vous ne soyez parfaitement s&ucirc;r de la source de l'image.</p>

<p>Le module <strong>littlecms</strong> est devenu une librairie stable et &eacute;prouv&eacute;e.  Des tests ind&eacute;pendants garantissent son exactitude et LittleCMS est utilis&eacute; dans le microcode des imprimantes les plus exotiques et les plus raffin&eacute;es. Compte tenu de l'&eacute;quipe tr&egrave;s restreinte qui a accompli ce travail, cette pr&eacute;cision est remarquable, quand on songe aux ressources consid&eacute;rables d&eacute;ploy&eacute;es par les grandes soci&eacute;t&eacute;s telles que Kodak, Adobe et Agfa.</p>

<p><strong>Description des profils de couleur ou de p&eacute;riph&eacute;rique ?</strong></p>

<p>Les profils <strong>ICC</strong> ou <strong>ICM</strong> sont des fichiers un peu sp&eacute;ciaux qui d&eacute;crivent les caract&eacute;ristiques colorim&eacute;triques d'un p&eacute;riph&eacute;rique comme un scanner, un &eacute;cran ou une imprimante, bref de tout p&eacute;riph&eacute;rique qui peut cr&eacute;er, afficher ou traiter la couleur d'une image num&eacute;rique. Il y a aussi des profils de couleurs qui sont connus comme &eacute;tant <strong>ind&eacute;pendants du p&eacute;riph&eacute;rique</strong> ou associ&eacute;s &agrave; <strong>l'espace de travail</strong>. Ces fichiers peuvent &ecirc;tre compar&eacute;s &agrave; des traducteurs qui convertissent les profils d'un type &agrave; un autre.  Un fichier icm ou icc est un jeu de tables qui d&eacute;crivent les valeurs math&eacute;matiques par lesquelles les p&eacute;riph&eacute;riques mesurent les couleurs. Heureusement, elles sont regroup&eacute;es dans des standards internationaux ouverts qui fonctionnent de la m&ecirc;me fa&ccedil;on sur un Mac, sur un PC Windows, sur Linux ou sur Solaris.</p>

<p><strong>Les profils de p&eacute;riph&eacute;rique</strong> d&eacute;crivent la fa&ccedil;on dont un &eacute;quipement mat&eacute;riel cr&eacute;e (scanner, appareil photo num&eacute;rique), affiche (&eacute;cran), ou rend (imprimante) les couleurs. Les utilisateurs de Photoshop sont familiaris&eacute;s avec le choix de <strong>profils de travail</strong> ou <strong>d'espace de travail</strong>. Ces profils ne sont pas li&eacute;s &agrave; un mat&eacute;riel sp&eacute;cifique mais sont con&ccedil;us pour faciliter la conversion d'une couleur d'un p&eacute;riph&eacute;rique &agrave; un autre.  Les profils d'"espaces de travail" Include sRGB, Adobe&#174; RGB 1998, Colormatch, Bruce RGB ou CIERGB sont bien connus. Les utilisateurs de Photoshop ou d'autres gestionnaires de couleurs seront &eacute;tonn&eacute;s de ne pas trouver ces fonctions, mais LittleCMS utilise son propre processus de conversion de couleurs pour op&eacute;rer une transformation entre les diff&eacute;rents espaces colorim&eacute;triques. Voil&agrave; une chose de r&eacute;gl&eacute;e !</p>

<table width="100%"><tr><td align="center"><img src="../en/images/cmsmodify1.png" align="center" title="&Eacute;cran Modifier la gestion des couleurs" alt="&Eacute;cran Modifier la gestion des couleurs"/></td></tr></table>

<p>Pourquoi une "correction logicielle" ? Avec les param&egrave;tres appropri&eacute;s d'un profil colorim&eacute;trique, LittleCMS peut ajuster les couleurs de votre &eacute;cran pour mieux repr&eacute;senter ce que sera votre document une fois imprim&eacute;. Cela peut &ecirc;tre doublement utile si vous souhaitez faire une impression commerciale ou utiliser un service d'impression. De plus, chaque image peut &ecirc;tre modifi&eacute;e individuellement par Scribus de mani&egrave;re &agrave; y assigner un profil directement (S&eacute;lectionnez l'image &gt; clic droit sur &gt; Modifier ) si bien que sa couleur peut &ecirc;tre correctement g&eacute;r&eacute;e dans la phase de reproduction du document : pr&eacute;paration de films, d'un PDF/x3 ou transfert direct sur plaque. Cela n'alt&egrave;re cependant pas l'image elle-m&ecirc;me. Les profils de pr&eacute;visualisation <strong>affect&eacute;s</strong> &agrave; une image sont une partie des param&egrave;tres retenus dans un document Scribus ou lors de la cr&eacute;ation d'un PDF. Il existe &eacute;galement un outil en ligne de commande dans LittleCMS pour inclure les profils avec <strong>tifficc</strong> et <strong>jpegicc</strong>. Consultez la documentation de LittleCMS pour conna&icirc;tre les options exactes. Vous pouvez aussi incorporer des profils ICC en utilisant Cinepaint, Imagemagick, Krita avec Adobe Photoshop.</p>
<br />

</body>
</html> 