<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
  	<title>Gestion des couleurs avec Scribus, une introduction - partie 2</title>
</head>
<body>
<h2>Gestion des couleurs avec Scribus, une introduction - partie 2</h2>
<p><strong>Obtenir de bons aper&ccedil;us &agrave; partir de la gestion de couleur d&eacute;pend de la r&eacute;ussite de ces &eacute;tapes</strong></p>

<p>&Eacute;tablissement du profil appropri&eacute; pour les p&eacute;riph&eacute;riques d'entr&eacute;e g&eacute;n&eacute;rant l'image. Les scanners, appareils photo num&eacute;riques et autres dispositifs ont des sp&eacute;cificit&eacute;s d&eacute;chiffr&eacute;es par certains outils. Le plus important est d'avoir un &eacute;cran correctement calibr&eacute; <strong>et</strong> profil&eacute;.</p>

<p>La premi&egrave;re suggestion est d'all&eacute;ger l'environnement visuel. Vous devriez &eacute;voluer dans un th&egrave;me "Vanille".  Oui, KDE et Gnome sont livr&eacute;s avec des bureaux spectaculaires, mais Scribus appr&eacute;ciera les interfaces sobres sans animation ni fantaisie. Pour une calibration plus juste des couleurs, appliquez un fond de bureau gris neutre ou une couleur claire sans d&eacute;grad&eacute; ou motif d'arri&egrave;re-plan.Cela aidera vos yeux &agrave; bien juger de l'&eacute;quilibre des couleurs pour une image. Il faut appliquer les m&ecirc;mes principes &agrave; GIMP et aux autres logiciels d'imagerie. Quand on calibre
un &eacute;cran pour Photoshop avec un p&eacute;riph&eacute;rique de sortie co&ucirc;teux, il s'agit toujours de la premi&egrave;re &eacute;tape &agrave; effectuer. Ce que nous nous effor&ccedil;ons de faire ici, c'est d'imiter le mieux possible la couleur des encres sur le papier. </p>

<p><strong>Calibrer</strong>, c'est param&eacute;trer l'&eacute;cran en fonction d'un &eacute;tat connu. La plupart des &eacute;crans sont livr&eacute;s avec une temp&eacute;rature de couleur par d&eacute;faut de 9300k ou Kelvin, ce qui est souvent trop "froid" ou bleut&eacute; pour un espace de couleur pr&eacute;cis. <a href="http://www.color.org/">www.color.org</a> contient une multitude de sp&eacute;cifications de couleurs pour votre usage. La plupart des standards de couleur sont &agrave; 5000k ou "lumineux". Je sugg&egrave;re une base de 6500 comme point r&eacute;glage de l'&eacute;cran, ce qui se rapproche le plus de la lumi&egrave;re naturelle du soleil. Au d&eacute;but, vos yeux trouveront l'affichage jauni, mais ils s'y habitueront assez vite, surtout si la luminosit&eacute; et le contraste sont corrects. La valeur 9300k, c'est-&agrave;-dire le r&eacute;glage en usine de la plupart des &eacute;crans, est parfaite pour un &eacute;diteur de texte, mais elle d&eacute;lave les couleurs, qui paraissent mal balanc&eacute;es, avec une teinte bleut&eacute;e.</p>

<p>Chaque espace de travail est bas&eacute; sur certains r&eacute;glages d'&eacute;cran. Le gamma et la temp&eacute;rature de couleur devraient correspondre aux propri&eacute;t&eacute;s de l'espace de travail. Par exemple, Adobe&#174; RGB et Bruce RGB sp&eacute;cifient 6500 Kelvin et un gamma 2.2, &agrave; peu pr&egrave;s communs &agrave; tous les &eacute;crans de PC Intel;  il s'agit des valeurs par d&eacute;faut recommand&eacute;es pour traiter des images pour lesquelles la couleur est importante.</p>

<p>Il convient aussi de bien cibler le p&eacute;riph&eacute;rique CMJN en utilisant un profil appropri&eacute; au papier et &agrave; l'imprimante. Les profils d'imprimantes d&eacute;pendent largement du support choisi. Le papier journal et le papier non couch&eacute; (un-coated) sont un peu plus gris en apparence, leurs profils vont donc avoir une &eacute;tendue plus restreinte. Ils ne produisent pas les couleurs &eacute;clatantes et la saturation qu'on obtient avec des papiers couch&eacute;s, ni le brillant des papiers photographiques. Une imprimante peut avoir &agrave; elle seule une demi-douzaine de profils, voire davantage, en fonction de la diff&eacute;rence de couleur des papiers et leur capacit&eacute; d'absorption de l'encre.</p>

<p><strong>Alors, o&ugrave; vais-je trouver les profils qui conviennent &agrave; mon mat&eacute;riel ?</strong></p>

<p>Certains profils sont "g&eacute;n&eacute;riques" et peuvent &ecirc;tre obtenus aupr&egrave;s du fabricant. Les profils de ce type sont effectu&eacute;s &agrave; partir d'un &eacute;chantillonnage de dispositifs d'un fabricant. Un nombre croissant de fournisseurs d'&eacute;crans, de scanners ou d'imprimantes les incluent dans le logiciel livr&eacute; avec le p&eacute;riph&eacute;rique. Donc, m&ecirc;me si ces profils correspondent rarement de mani&egrave;re exacte au mat&eacute;riel utilis&eacute;, ils peuvent fournir un bon point de d&eacute;part. Allez
sur le site du fabricant et cherchez, parmi les pilotes, s'il existe un profil utilisable pour votre mat&eacute;riel. Un autre type de profil "g&eacute;n&eacute;rique" est le profil standard de presse. Ce sont des profils CMJN qui sont d&eacute;finis selon les standards de l'industrie des presses commerciales, tels que <!--<a href="lcms/swop.html">-->SWOP, FOGRA, ECI et d'autre organismes de normalisation.<!--</a>--></p>

<p><strong>Outils couleurs de Linux</strong></p>

<p><strong>Gamma de l'&eacute;cran</strong> - Le gamma n'est qu'un chiffre qui repr&eacute;sente la luminosit&eacute; des couleurs neutres ou des gris. Il est essentiel de fixer un gamma correct pour obtenir une bonne balance des couleurs <strong>avant</strong> de cr&eacute;er un profil personnalis&eacute;. Le profiler de lprof est fait pour vous aider &agrave; accomplir cette t&acirc;che.</p>

<p>L'&eacute;tape suivante consiste &agrave; g&eacute;n&eacute;rer un profil personnalis&eacute; avec un logiciel sp&eacute;cifique, comme ceux fournis avec LittleCMS. <a href="moncal.html">Voyez les instructions pour calibrer votre &eacute;cran.</a> Il est int&eacute;ressant de voir la correspondance avec les profils cr&eacute;&eacute;s avec un outil de calibration professionnel et un outil physique sous Windows 2000.</p>

<p>La fa&ccedil;on la plus pr&eacute;cise de calibrer un &eacute;cran est d'utiliser un outil &eacute;lectronique de profil, comme un appareil photo con&ccedil;u sp&eacute;cialement pour mesurer les couleurs.  Le logiciel injecte une couleur connue dans l'&eacute;cran, lit la couleur renvoy&eacute;e et cr&eacute;e le profil en fonction de la mesure
obtenue. Les pilotes Linux pour ces colorim&egrave;tres ne sont pas encore disponibles, mais le profileur peut utiliser le
p&eacute;riph&eacute;rique lorsque les pilotes existent. Les utilisateurs qui en ont utilis&eacute; un sous Windows peuvent tenter d'utiliser le m&ecirc;me profil sous Linux si l'&eacute;cran est r&eacute;gl&eacute; de la m&ecirc;me fa&ccedil;on ET si le pilote Linux ne produit pas des ajustements radicaux dans les valeurs de couleur. &Ccedil;a vaut la peine d'essayer, au moins! J'ai cr&eacute;&eacute; un profil pour mon &eacute;cran qui fonctionne bien sous Linux. Avec la gestion de couleur activ&eacute;e, les couleurs de Scribus sont identiques &agrave; celles de Photoshop 6.0 ! Quel travail accompli par Scribus et LittleCMS !</p>

<p><strong>Param&egrave;tres de gestion de couleur dans Scribus</strong></p>

<p><strong>Profils syst&egrave;me -</strong> Les menus d&eacute;roulant r&eacute;pertorient les profils disponibles sur votre syst&egrave;me. Pour permettre &agrave; Scribus d'utiliser les profils, ceux-ci doivent &ecirc;tre copi&eacute;s dans le r&eacute;pertoire <pre>$prefix/share/Scribus/profiles</pre> ; vous pouvez les placer n'importe o&ugrave; dans votre r&eacute;pertoire maison et pointer vers ce r&eacute;pertoire dans vos pr&eacute;f&eacute;rences. Les profils colorim&eacute;triques .icm et .icc sont ind&eacute;pendants de la plateforme, ce qui signifie que les fichiers cr&eacute;&eacute;s pour Mac et PC sont utilisables sous Linux, avec LittleCMS dans Scribus.  Profitez de la page de liens pour aller chercher plus d'informations sur l'obtention des profils. Je recommande fermement d'appliquer les profils Adobe qui sont pr&eacute;sent&eacute;s dans cette page de liens si vous souhaitez faire une impression commerciale ou multi-plateforme, profils r&eacute;gl&eacute;s aussi bien pour stations PAO que pour des imprimantes commerciales. </p>
<table width="100%"><center><img src="images/colormgmtscreen.png" title="Options de gestion des couleurs" alt="Options de gestion des couleurs"/></center></td></tr></table>
<p>La capture d'&eacute;cran ci-dessus est un bon point de d&eacute;part pour expliquer les points importants du module LittleCMS de Scribus. Dans le cas pr&eacute;sent, les images du document ont &eacute;t&eacute; cr&eacute;&eacute;es avec un appareil photo num&eacute;rique de milieu de gamme. L'appareil photo applique lui-m&ecirc;me une balance automatique des couleurs et ajuste la sortie pour la gamme ou l'<strong>espace des couleurs</strong> sRGB. Il vaut mieux conserver ce r&eacute;glage. Si l'image provient d'un scanner, vous voudrez certainement choisir le profil propre au mat&eacute;riel cr&eacute;&eacute; avec un logiciel de calibration. </p>

<p>Les couleurs d'accompagnement peuvent &ecirc;tre d&eacute;crites du <strong>RVB</strong>
(rouge, vert, bleu) au <strong>CMJN</strong> (cyan, magenta, jaune et noir), o&ugrave; "K" d&eacute;signe le noir - ces couleurs repr&eacute;sentant celles utilis&eacute;es dans le processus d'impression ou dans les imprimantes &agrave; jets d'encre). Dans ce cas, nous utilisons des couleurs RVB basiques, qui subiront ensuite une transposition logicielle vers l'espace CMJN de l'imprimante; il s'agit d'un proc&eacute;d&eacute; commercial connu sous le nom de <!--<a  href="./lcms/swop.html">-->US SWOP<!--</a>--> sur papier couch&eacute; pour assurer des couleurs riches et vivantes.</p>

<p>Il est pr&eacute;f&eacute;rable de donner au profil un nom assez court. Par exemple D226500mon.icm est un profil personnalis&eacute; cr&eacute;&eacute; par le calibreur Kmonitor avec un gamma 2.2 et une temp&eacute;rature de 6500 Kelvin. Le D est l&agrave; pour signifier Daylight (lumi&egrave;re du jour). La lumi&egrave;re ambiante produite par certains types d'&eacute;clairages artificiels affecte aussi votre perception des couleurs, parfois radicalement. Autre exemple : le nom de l'&eacute;cran Sony 17 pouces vient de #la description effectu&eacute;e par le calibreur Qmonitorprofiler de LittleCMS. </p>

<p><strong>Activer la gestion des couleurs</strong> permet une gestion globale pour le document. Scribus retient les param&egrave;tres d'un fichier &agrave; l'autre.  Notez que l'enregistrement et la fermeture d'un document g&eacute;r&eacute; en colorim&eacute;trie ralentira la r&eacute;ouverture de celui-ci, Scribus ne devant pas seulement s'occuper des fichiers mais aussi de la lecture et de la correction des profils. La conversion des couleurs produit plusieurs points interm&eacute;diaires pour chaque couleur, donc, patience! LittleCMS est heureusement tr&egrave;s stable et comporte seulement quelques bugs mineurs dans la gestion des profils. Il existe une deuxi&egrave;me case d'option &agrave; cocher pour simuler le rendu de l'imprimante &agrave; l'&eacute;cran. Elle indique &agrave; Scribus et &agrave; LittleCMS de convertir &agrave; la vol&eacute;e l'espace colorim&eacute;trique de l'image vers celui de l'&eacute;cran, pour simuler le profil de l'imprimante choisie. L'option <strong>Identifier les couleur hors gamme</strong> signalent les couleurs qui risquent de poser un probl&egrave;me, compte tenu du profil d'imprimante choisi. Habituellement,
lorsque les couleurs sont ainsi marqu&eacute;es, elles s'imprimeront dans des teintes plus sombres, plus claires ou avec un d&eacute;grad&eacute;.  La derni&egrave;re option <strong>&Eacute;quilibrer le point noir</strong>, est un moyen qui facilite le rendu des ombres dans les images en couleur. Vous devez faire des exp&eacute;riences pour v&eacute;rifier si ces param&egrave;tres am&eacute;liorent vos images.</p>

</body>
</html>
 
