<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Gestion des couleurs avec Scribus, une introduction partie 3</title>
</head>
<body>
<h2>Gestion des couleurs avec Scribus, une introduction partie 3</h2>
<p ><strong>Rendus</strong></p>

<p>L'autre casse-t&ecirc;te pour les nouveaux convertis &agrave; la gestion des couleurs tient dans les <strong><em>rendus.</em> </strong>Vos choix de rendus sont une fa&ccedil;on de signifier &agrave; littlecms comment vous voulez que les couleurs soient organis&eacute;es d'un espace colorim&eacute;trique &agrave; l'autre. </p>

<p><strong>Perceptible</strong> - Ce mode agit doucement, pr&eacute;servant les relations entre les couleurs similaires. Cela pr&eacute;vient "l'effet de seuil" avec ses pertes de d&eacute;tail potentielles et ses probl&egrave;mes de "bandes tonales". L'effet de seuil intervient quand 2 ou plusieurs couleurs diff&eacute;rentes dans l'image d'entr&eacute;e apparaissent identiques &agrave; l'impression. Le rendu perceptible produit quelques ajustement dans l'image pour pr&eacute;server les relations color&eacute;es. Il sacrifie quelques pr&eacute;cisions colorim&eacute;triques pour assurer des r&eacute;sultats plus plaisants. Pour les photos et les scans, c'est souvent le meilleur choix pour un r&eacute;glage par d&eacute;faut. </p> 

<p>Le rendu perceptible va produire les r&eacute;sultats les plus pr&eacute;visibles &agrave; l'impression pour un large panel d'images, par exemple lorsque vous imprimez des images RVB en CMJN, ou quand vous essayez de faire co&iuml;ncider deux p&eacute;riph&eacute;riques CMJN radicalement diff&eacute;rents. Consid&eacute;rez ce r&eacute;glage comme &eacute;tant habituellement le meilleur pour les utilisateurs manipulant une grande vari&eacute;t&eacute; d'images. </p>

<p><strong>Saturation</strong> convient aux logos, les couleurs d'accompagnement, etc. Elle tend &agrave; pr&eacute;server l'importance des couleurs et leur vivacit&eacute;. Mais elle peut rendre les photos d&eacute;sagr&eacute;ables. Si vous travaillez des logos avec une nuance sp&eacute;cifique, saturation am&eacute;liorera la correspondance colorim&eacute;trique, si vous apportez plus d'importance &agrave; la couleur qu'&agrave; l'image. </p>

<p><strong>Colorim&eacute;trie absolue: </strong>Quand une couleur n'est pas imprimable dans une &eacute;tendue de p&eacute;riph&eacute;rique de sortie, ce rendu imprime seulement la correspondance la plus proche. Il reproduit autant que possible les couleurs sans compromis en utilisant la m&ecirc;me gamme. Cela produit le r&eacute;sultat le plus juste pour les couleurs d'accompagnement. Mais il peut aussi en r&eacute;sulter un effet de seuil, o&ugrave; deux couleurs qui sont diff&eacute;rentes dans l'original sont identiques &agrave; l'impression. Les points blancs subissent le m&ecirc;me effet de seuil, causant des probl&egrave;mes de relation entre les couleurs les parties claires des images. Ce type de d&eacute;coupe et les probl&egrave;mes qui en r&eacute;sultent en font un rendu difficile &agrave; utiliser avec tout autre chose que des <!--<a href="./lcms/spot.html">-->couleurs d'accompagnement<!--</a>-->. Quelques utilisateurs seront constern&eacute;s par l'apparence jaunie de leur image, mais cela est pourtant mesur&eacute; dans des conditions d'&eacute;clairage tr&egrave;s contr&ocirc;l&eacute;es avec une bo&icirc;te lumineuse D50. Ce r&eacute;glage a donc souvent une temp&eacute;rature plus chaude. Ce mode de rendu est utilis&eacute; exclusivement quand un logo ou une couleur doit correspondre exactement quel que soit le m&eacute;dia. Le jaune Kodak en est un bon exemple.</p>

<p><strong><em>Colorim&eacute;trie relative: </em></strong>Quand une couleur n'est pas imprimable dans l'&eacute;tendue du p&eacute;riph&eacute;rique, ce r&eacute;glage applique la correspondance la plus proche, en utilisant un ajustement qui fait correspondre le  blanc au papier de sortie. La cartographie du "point blanc" permet d'&eacute;viter les probl&egrave;mes li&eacute;s au mode "colorim&eacute;trie absolue" avec des images sans couleur d'accompagnement. Lors de la production de couleur sur des jets d'encre RVB, vous pouvez utiliser ce syst&egrave;me pour simuler le CMJN, si vous connaissez le profil exact. Les utilisateurs de Adobe Press Ready comprendont bien ce concept. Cette approche fonctionne particuli&egrave;rement lorsque vous avez des profils corrects incorpor&eacute;s (scanner ou plus rarement appareils photos num&eacute;riques) dans des images converties en espace CMJN avec des profils d'imprimante tr&egrave;s pr&eacute;cis mesur&eacute;s avec des outils sp&eacute;cifiques. Les r&eacute;sultats sont donc les meilleurs lorsque quelqu'un a pass&eacute; du temps et de l'effort &agrave; calibrer et profiler finement son &eacute;quipement. Cela n&eacute;cessite un outillage de calibration sophistiqu&eacute; ($$$) pour mesurer l'imprimante dans des conditions contr&ocirc;l&eacute;es. </p>

<h4>Impression finale avec Scribus</h4>

<p>Pour les utilisateurs de Scribus, il y a une s&eacute;rie d'options permettant d'imprimer avec un rendu avec gestion des couleurs. </p>

<p>Lors de l'impression, Scribus peut &eacute;ventuellement appliquer le profil d'imprimante que vous avez choisi dans l'&eacute;cran de gestion des couleurs. Cela peut &ecirc;tre tr&egrave;s utile si vous voulez simuler un profil d'imprimante commerciale avec votre imprimante &agrave; jet d'encre &agrave; l'aide de CUPS. </p>

<p>Sortie PostScript - Ceci requiert que vos images aient un profil incorpor&eacute; avant d'&ecirc;tre plac&eacute;es dans des fichiers Scribus soit comme pur PostScript ou comme EPS individuel. Scribus utilise un postscript de niveau 3. Les postscript de niveau 2 et niveau 3 peuvent lire et utiliser les profils icc int&eacute;gr&eacute;s &agrave; l'image. La plupart des p&eacute;riph&eacute;riques postscript couleur le feront aussi et les utilisent pour rendre les couleurs de l'image de mani&egrave;re ind&eacute;pendante. </p>
</body>
</html> 