<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Gestion des couleurs avec Scribus, une introduction - partie 4</title>
</head>
<body>
<h2>Gestion des couleurs avec Scribus, une introduction - partie 4</h2>
<h4>DF/X-3 et gestion des couleurs</h4>
<p>Ci-dessus, nous avons couvert les bases permettant de faire fonctionner et de configurer correctement la gestion des couleurs. Maintenant, consid&eacute;rons l'utilisation de PDF/X-3 pour optimiser la sortie pour l'impression commerciale. PDF/X-3 est le dernier et le plus avanc&eacute; des standards ISO pour les fichiers PDF, que Scribus supporte en totalit&eacute;, en plus d'&ecirc;tre la premi&egrave;re application PAO &agrave; pouvoir exporter directement des fichiers PDF/X-3 conformes.</p>

<p>Le principal avantage du format PDF/X-3 r&eacute;side dans une conversion des couleurs plus pr&eacute;cises de RVB vers une sortie imprimante CMJN. Cette
pr&eacute;cision provient du fait de travailler avec des couleurs RVB jusqu'&agrave; un stade avanc&eacute; du processus d'impression, lorsque le module RIP de l'imprimante effectue la conversion RVB > CMJN. L'inconv&eacute;nient est que seuls les processeurs RIP plus r&eacute;cents supportent PDF/X-3, m&ecirc;me si certains reconnaissent des standards PDF/X-x ant&eacute;rieurs. Comme le module RIP poss&egrave;de conna&icirc;t exactement la gamme de couleurs et les capacit&eacute;s connexes, il est difficile, dans la plupart des cas, d'obtenir une conversion plus pr&eacute;cise. PDF/X-3 n'emp&ecirc;che pas d'utiliser des images CMJN,
mais l'id&eacute;al est de conserver vos images en RVB le plus longtemps possible dans le processus.</p>
<p>Le plus grand inconv&eacute;nient du travail en PDF/X-3 est double : vous ne pouvez pas y utiliser la transparence en mode natif. PDF/X-3 est bas&eacute; sur PDF-1.3, qui ne supporte pas la transparence. De plus, seul un nombre limit&eacute; mais croissant d'imprimantes supportent ce format. En cas de doute, demandez. Mes tests d&eacute;montrent des r&eacute;sultats tr&egrave;s fiables avec un minimum de d&eacute;calage des couleurs. </p>
<p></p>
<p>Il faut &eacute;galement se demander quel est le profil d'imprimante &agrave; utiliser. Il y a deux strat&eacute;gies possibles. La premi&egrave;re est
d'avoir le profil ICC de votre imprimante pour le type de papier. La seconde est d'utiliser un standard d'impression bien connu comme SWOP, ECI ou autres. Pour utiliser
PDF/X-3, il faut de la coop&eacute;ration de la part de votre imprimeur, mais cela peut r&eacute;ellement am&eacute;liorer la concordance des couleurs &agrave; l'impression. Comme d'habitude, une courte visite <strong>pr&eacute;alable</strong> &agrave; votre imprimeur est fortement recommand&eacute;e. Si les r&eacute;ponses obtenues ne sont pas satisfaisantes, essayez-en un autre. L'impression est un domaine concurrentiel et on peut presque toujours &ecirc;tre trouver  une solution.<p><strong>Exp&eacute;riences r&eacute;elles</strong></p>

<p>L'auteur a test&eacute; Scribus avec une grande vari&eacute;t&eacute; d'images en activant la gestion des couleurs. Ces documents haute r&eacute;solution TIFF, RVB et CMJN ont &eacute;t&eacute; pr&eacute;par&eacute;s &agrave; l'aide des outils les plus r&eacute;cents de gestion des couleurs sous Windows 2000, et de moniteurs professionnels de PAO calibr&eacute;s et profil&eacute;s avec Photoshop 6; ils ont &eacute;t&eacute; ensuite v&eacute;rifi&eacute;s par des rendus sur imprimantes PostScript 3. Ces images ont servi de couverture de magazines
tir&eacute;s &agrave; 1 million d'exemplaires par ann&eacute;e. &Agrave; l'aide de profils identiques &agrave; ceux utilis&eacute;s pour la production de magazines, LittleCMS et Scribus peuvent cr&eacute;er des aper&ccedil;us qui sont remarquablement exacts, compte tenu de la nouveaut&eacute; de ces programmes. La pr&eacute;cision de LittleCMS a &eacute;t&eacute; am&eacute;lior&eacute;e dans chaque version 1.1x, notamment en ce qui concerne les rendus en colorim&eacute;trie absolue. LittleCMS 1.11+ peut traiter l'&eacute;quilibre du point noir et peut ainsi supporter Scribus si Lcms 1.11+ est install&eacute;. Cela aide &agrave; l'am&eacute;lioration du contraste dans les photos.</p>

<p>Sous Linux, le seul &eacute;diteur d'images matricielles disponible offrant la gestion des couleurs est Corel PhotoPaint. Cet outil offre une grande polyvalence dans les aper&ccedil;us en couleur et vous pouvez y activer le m&ecirc;me genre de profil que dans Scribus. Le profil d'&eacute;cran est certainement l'&eacute;l&eacute;ment le plus important &agrave; ajouter &agrave; Photopaint, si vous l'avez cr&eacute;&eacute; avec Qmonitorprofiler. L'autre fonctionnalit&eacute; de PhotoPaint consiste &agrave; afficher les couleurs non imprimables, comme le propose Scribus en option dans ses param&egrave;tres de gestion des couleurs. Vous pouvez aussi utiliser l'utilitaire <strong>tifficc</strong> de LittleCMS pour appliquer directement ces profils. La prochaine version de GIMP 2.4 devrait &ecirc;tre dot&eacute;e de fonctionnalit&eacute;s enrichies pour la gestion des couleur. </p>

<p>Les pr&eacute;visualisations de documents PDF cr&eacute;&eacute;s avec Acrobat 4.05 g&eacute;n&egrave;rent parfois un d&eacute;calage de couleur avec le format TIFF RVB et CMJN. Il
s'agit d'un bug d'Acrobat et non de Scribus. Les m&ecirc;mes PDF s'affichent et s'impriment correctement avec Acrobat 5 sous Windows 2000 et Mac OS lorsqu'ils sont envoy&eacute;s sur une imprimante PostScript 3. Adobe a mis &agrave; jour Acrobat 5.0.6 pour Linux et Solaris, et le programme contient des am&eacute;liorations notables au chapitre de la rapidit&eacute; et de la gestion des couleurs. Tous les utilisateurs sont invit&eacute;s &agrave; appliquer la mise &agrave; jour au Reader 7. De plus, cette version affichera correctement les nouvelles possibilit&eacute;s de Scribus en mati&egrave;re de formulaires PDF. Le cas &eacute;ch&eacute;ant, la plus r&eacute;cente version de Wine installera et supportera &agrave; la fois Acrobat Reader 5.1 et la version compl&egrave;te d'Acrobat pour Windows, et cela sans probl&egrave;me particulier. </p>

<p><strong>Conclusions</strong></p>

<p>Ainsi, &agrave; titre d'exemple, nous pr&eacute;sentons une simple strat&eacute;gie de gestion des couleurs pour notre document. Il suffit de prendre la source, de lui appliquer correctement les profils et de choisir les bons r&eacute;glages de rendu dans un autre mod&egrave;le colorim&eacute;trique. Dans notre exemple, en choisissant l'option "Simulation du rendu de l'imprimante &agrave; l'&eacute;cran", on demande &agrave; Scribus de faire une conversion en deux temps pour
que votre moniteur affiche correctement les images et les couleurs avant l'impression. </p>

<p>L'incorporation d'un syst&egrave;me de gestion des couleurs simple mais efficace dans Scribus est un projet ambitieux; selon l'auteur, il s'agit de la premi&egrave;re tentative v&eacute;ritable dans le monde Open Source. Ce type d'outil est courant dans les applications de pr&eacute;-presse professionnelles de grande qualit&eacute;. Comme il s'agit d'un territoire inexplor&eacute; pour l'Open Source, vos commentaires et suggestions sur ce document et  votre exp&eacute;rience en gestion des couleurs sont les bienvenus. Le lecteur doit aussi &ecirc;tre pr&eacute;venu que la gestion des couleurs est l'objet d'am&eacute;liorations continues de la part de l'industrie graphique. </p>

<p><strong>Soyez patients</strong> - la gestion des couleurs constitue un apport important &agrave; la PAO. Il faut mettre un peu de temps
pour comprendre la th&eacute;orie, qui m&egrave;ne ensuite aux r&eacute;sultats pratiques. </p>

<p>Remerciements :</p>

<p>Mart&iacute; Maria; d&eacute;veloppeur de LittleCMS, sans qui le pr&eacute;sent document n'aurait &eacute;t&eacute; possible.</p>

</body>
</html> 