<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
<h2 align="center">Information sur le document Scribus</h2>
<h3>Aper&ccedil;u</h3>
<p align="justify">Il y a quelques points importants &agrave; consid&eacute;rer dans les champs de l'information du document : 1) Scribus supporte une initiativeappel&eacute;e <a href="http://dublincore.org/">Dublin Core Initiative</a>. Dublin Core, pour  faire bref, est un ensemble de sp&eacute;cifications sur les m&eacute;tadonn&eacute;es d'un document. 2) La seconde caract&eacute;ristique est que les champs du premier onglet sont utilis&eacute;s lors de l'exportation PDF export, tout en faisant partie des m&eacute;tadonn&eacute;es de Dublin Core. Ces donn&eacute;es peuvent &ecirc;tre utilis&eacute;es par des serveurs d'indexation sp&eacute;ciaux capables de traiter les fichiers PDF, ainsi que par Acrobat Reader. Le second onglet contient les m&eacute;tadonn&eacute;es au format Dublin Core qui peut &eacute;galement &ecirc;tre utilis&eacute;e par une base de donn&eacute;es qui tracerait les fichiers Scribus.</p>
<center><img src="images/docinfo.png" alt="Information d'un document PDF" title="Information d'un document PDF" /></center>
<p>Le second onglet contient l'information du document qui est strictement &eacute;tablie selon Dublin Core, donc d&eacute;finie par les sp&eacute;cifications suivantes :</p>

<center><img src="images/docinfo2.png" alt="Propri&eacute;t&eacute;s Dublin Core" width="321" height="514" align="middle" border="0" title="Propri&eacute;t&eacute;s Dublin Core dans un document" /></center>

<table width="550" border="0" align="center">
  <tbody>
    <tr>
      <td align="left" >&Eacute;diteur</td>
      <td align="justify" > La personne ou l'organisation responsable de rendre le document disponible ou de l'envoyer &agrave; l'impression.</td>
    </tr>
    <tr>
      <td align="left">Contribuants</td>
      <td align="justify"> Une personne ou une organisation responsable de faire les contributions au contenu du document</td>
    </tr>
    <tr>
      <td align="left">Date</td>
      <td align="justify"> Une date associ&eacute;e &agrave; un &eacute;v&eacute;nement dans le cycle de vie du document, dans le format AAAA-MM-JJ, suivant la norme ISO 8601</td>
    </tr>
    <tr>
      <td align="left">Type</td>
      <td align="justify"> La nature ou le genre de contenu du document, par exemple les cat&eacute;gories, les fonctions, les genres, etc.</td>
    </tr>
    <tr>
      <td align="left">Format</td>
      <td align="justify"> La manifestation physique ou num&eacute;rique de ce document. Le type de m&eacute;dia et les dimensions vaudraient la peine d'&ecirc;tre mentionn&eacute;s. RFC2045,RFC2046 pour les types MIME seraient aussi utiles ici</td>
   </tr>
    <tr>
      <td align="left">Identifiant</td>
      <td align="justify"> Une r&eacute;f&eacute;rence non ambigue au document dans un contexte donn&eacute;, comme ISBN ou URI</td>
   </tr>
    <tr>
      <td align="left">Source</td>
      <td align="justify"> Une r&eacute;f&eacute;rence &agrave; un document &agrave; partir duquel le document est g&eacute;n&eacute;r&eacute;, par exemple ISDN ou URI</td>
   </tr>
    <tr>
      <td align="left">Langue</td>
      <td align="justify"> La langue dans laquelle le contenu du document est r&eacute;dig&eacute;, habituellement un code de langue ISO-639. Optionnellement suivi d'un tiret et d'un code de pays ISO-3166, par exemple en-GB, fr-CH</td>
   </tr>
    <tr>
      <td align="left">En rapport</td>
      <td align="justify"> Une r&eacute;f&eacute;rence &agrave; un document li&eacute;, g&eacute;n&eacute;ralement bas&eacute; sur un identifiant formel comme un ISBN ou un URI</td>
   </tr>
    <tr>
      <td align="left">Domaine trait&eacute;</td>
      <td align="justify"> L'&eacute;tendue ou la port&eacute;e du contenu du document, y compris le lieu, la p&eacute;riode effective et les territoires administratifs</td>
   </tr>
    <tr>
      <td align="left">Droits</td>
      <td align="justify"> Information concernant les droits sur ce document, par exemple les droits d'auteur, brevets ou marques de commerces </td>
   </tr>
  </tbody>
</table>
</body>
</html> 