<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Les polices en d&eacute;tail</title>
</head>
<body>
<h2>Les polices en d&eacute;tail</h2>

<p>En PAO, les probl&egrave;mes sont souvent li&eacute;s &agrave; l'utilisation des polices. Je sais par exp&eacute;rience que les polices sont un des probl&egrave;mes majeurs de la PAO en g&eacute;n&eacute;ral et l'une des sources de questions &agrave; r&eacute;p&eacute;tition dans la liste Scribus et dans l'IRC. Une estimation brute serait que 50 % des probl&egrave;mes rapport&eacute;s qui sont li&eacute;s aux polices sont des probl&egrave;mes avec les polices elles-m&ecirc;mes. Une question ou plainte typique sur l'IRC est : "Scribus n'utilise pas la police X, mais l'application bla et blabla les utilisent correctement. Pourquoi?"</p>

<p>Fondamentalement, Scribus est <strong>vraiment tr&egrave;s</strong> tatillon au sujet des polices. C'est une caract&eacute;ristique et non un probl&egrave;me. Certainement, sous Linux, aucune autre application est moins tol&eacute;rante aux polices avec des probl&egrave;mes que Scribus. C'est une bonne chose &#8482;! Emp&ecirc;cher l'utilisateur d'utiliser des polices possiblement d&eacute;fectueuses est essentiel pour obtenir une sortie fiable. Ceci a caus&eacute; des d&eacute;sagr&eacute;ments mineurs ou de la confusion chez les utilisateurs. Soyez assur&eacute; que vous &eacute;viterez ainsi beaucoup de probl&egrave;mes potentiels en cours de route. Par exemple, un PDF qui plante lorsque vous imprimez 200 000 couvertures de magasine parce que la machine de composition bloque ou refuse de produire un fichier. Dans le monde r&eacute;el, ce genre de probl&egrave;me peut co&ucirc;ter des milliers, voire des millions en monnaie locale.</p>

<p>Scribus utilise les biblioth&egrave;ques freetype2 pour acc&eacute;der aux fonctions des polices. Scribus contr&ocirc;le aussi la qualit&eacute; des polices au lancement du logiciel. Toutes les polices ne sont pas &agrave; la hauteur des exigences de la PAO. Pourquoi?</p>
<p>Peu importe la plate-forme, il est essentiel d'utiliser des polices de qualit&eacute;, seules garantes d'un r&eacute;sultat final pr&eacute;visible. On pourra me traiter de snob, mais je n'utilise <b>jamais</b> de polices shareware offertes en t&eacute;l&eacute;chargement gratuit. L'exp&eacute;rience nous a montr&eacute; que certaines polices gratuites ne respectent pas les sp&eacute;cifications normales d'une police, et elles ont par exemple un encodage incorrect, un nom PostScript manquant ou incorrectement format&eacute;, des courbes corrompues dans des glyphes particuliers, ou d'autres d&eacute;fauts. </p>

<p>
Scribus effectue un test "d'auto-d&eacute;fense" initial lors du d&eacute;marrage pour v&eacute;rifier si les polices disponibles ont un encodage utilisable, sont redimensionnables et ont un nom PostScript correctement inclus. Puis, en chargeant un document, Scribus utilise freetype2 pour effectuer une v&eacute;rification plus pouss&eacute;e des polices requises afin de s'assurer que freetype2 puisse acc&eacute;der tous les glyphes de la police. Si freetype2 ne peut pas lire les glyphes correctement, alors l'utilisation de cette police en particulier est d&eacute;sactiv&eacute; par Scribus.</p>



<h3>Polices fiables</h3>

<p>Voici les polices que j'utilise en toute confiance (sans ordre particulier) :</p>
<ul>
	<li>Les plus r&eacute;centes polices Ghostscript. De pr&eacute;f&eacute;rence, si vous n'avez pas besoin des caract&egrave;res "non latins", vous pouvez aussi les obtenir en format TrueType sur le site Artifex. Ce faisant, vous obtiendrez quelques familles de polices additionnelles.  </li>
	<li>Toutes les polices Adobe ou Bitstream de Xfree86 ou X.org : Charter, Luxi et Utopia sont d'excellents choix. La version PDF de la pr&eacute;sente documentation est compos&eacute; en Utopia.</li>
	<li>N'importe quelle police Lucida offerte par Sun Java.</li>
	<li>Les polices MS Web - &agrave; l'exception de Wingdings qui cause des probl&egrave;mes pour la PAO, et pas seulement dans Scribus (r&eacute;gl&eacute; dans la version 1.2.2). Cette police particuli&egrave;re a un sch&eacute;ma d'encodage inhabituel, diff&eacute;rent de celui des autres polices.</li>
	<li>La famille Lido CE est une solution de rechange au Times Roman. C'est une police tr&egrave;s bien faite, par une compagnie tr&egrave;s connue.</li>
	<li>Gentium - un ambitieux projet de cr&eacute;ation d'une police Unicode librement accessible qui fonctionne bien avec la plupart des langues latines.</li>
	<li>La famille Bitstream Vera. Ces polices ont &eacute;t&eacute; donn&eacute;es &agrave; la fondation Gnome et sont incluses dans la plupart des distributions. La police Vera Serif, en particulier, est une perle rare : c'est une police serif tr&egrave;s facile &agrave; lire &agrave; l'&eacute;cran. </li>
	<li>N'importe quelle police Bitstream de Corel Draw. J'ai des clients qui utilisent ces polices en environnement pr&eacute;presse professionnel depuis des ann&eacute;es sans aucun probl&egrave;me.</li>
	<li>Toutes les polices Adobe. Ces polices sont parmi les meilleures et les nouvelles versions OpenType sont sensationnelles. Scribus est une des rares applications qui permet l'utilisation de ce format - y compris dans les PDF, qui s'impriment sans difficult&eacute;.</li>
	<li>Toutes les polices livr&eacute;es avec StarOffice 6.0+. Dans certains cas, ces polices remplacent les polices Windows install&eacute;es par d&eacute;faut et incluent quelques variantes. Ce sont des polices de grande qualit&eacute;, sous licence Agfa Monotype, qui devraient fonctionner tr&egrave;s bien dans Scribus.</li>
</ul>
<p>Vous trouverez sur le site de Scribus les liens vers toutes les polices t&eacute;l&eacute;chargeables &eacute;num&eacute;r&eacute;es ci-dessus sous le  lien Web Links > Fonts. </p>

<p>Certaines distributions Linux incluent, sous des appellations diverses, des polices gratuites ou shareware. J'&eacute;vite de m'en servir, je les retire m&ecirc;me de mon syst&egrave;me. Elles ne me manquent pas du tout. Les utilisateurs Windows devraient &eacute;galement se m&eacute;fier s'ils t&eacute;l&eacute;chargent des polices sur un site qui a "free" et "font" dans son nom de domaine. </p>

<p>J'&eacute;vite de m'en servir, je les retire m&ecirc;me de mon syst&egrave;me. Elles ne me manquent pas du tout. Ne soyez pas surpris si des polices shareware ou des clones TrueType t&eacute;l&eacute;charg&eacute;s sur Internet produisent un r&eacute;sultat d&eacute;cevant &agrave; l'impression. Ces polices n'ont parfois pas &eacute;t&eacute; cr&eacute;&eacute;es selon les sp&eacute;cifications d'encodage requises et ne sont de ce fait pas fiables dans un environnement PostScript. La cr&eacute;ation d'une police fiable, du point de vue Postscript, n'est pas une mince t&acirc;che et exige de nombreux tests. Par exemple, la cr&eacute;ation et la mise au point de la police Verdana de la collection MS Web a dur&eacute; pr&egrave;s d'une ann&eacute;e.</p>

<p>De m&ecirc;me, l'apparence un peu rebutante des polices URW &agrave; l'&eacute;cran ne doit pas vous tromper - ces polices s'impriment tr&egrave;s bien. Des polices comme Palladio et Utopia par exemple, m&ecirc;me si elles n'ont pas une belle apparence &agrave; l'&eacute;cran, font des documents faciles &agrave; lire. Ce n'est pas pour rien que les ateliers de pr&eacute;presse et les imprimeurs d&eacute;pensent des milliers de dollars pour se procurer des polices de qualit&eacute;. </p>

<p>Sous Linux, du c&ocirc;t&eacute; installation, Scribus retrouvera sans peine les polices que vous ajouterez dans votre r&eacute;pertoire <code>$home/.fonts</code>. Pour qui voit d'un mauvais oeil l'installation de polices au moyen des lignes de commande, KDE 3.2+ inclut une version am&eacute;lior&eacute;e du programme kfontinstaller de Keith Drummond. La version incluse dans KDE 3.3 fonctionne &agrave; merveille et vous pouvez m&ecirc;me pr&eacute;visualiser vos polices dans Konqueror. C'est l'installateur de polices le plus convivial que j'ai vu, toutes plates-formes confondues. Il cr&eacute;e aussi automatiquement les fichiers Ghostscript Fontmap pour utilisation avec GSview et Ghostscript. Je vous le recommande. </p>

<p>Il est aussi tr&egrave;s facile d'indiquer &agrave; Scribus des chemins additionnels menant &agrave; vos polices. Fermez d'abord tous vos documents et allez dans le menu Fichier > Pr&eacute;f&eacute;rences > Chemins additionnels. S&eacute;lectionnez le r&eacute;pertoire contenant les polices que vous d&eacute;sirez activer et cliquez sur OK. Si certaines polices demeurent inaccessibles, vous devrez probablement les ajouter &agrave; votre r&eacute;pertoire <code>$home/.fonts.conf</code> ou utiliser une autre m&eacute;thode, selon votre distribution. Si apr&egrave;s cela certaines polices n'apparaissent toujours pas, il est possible que le m&eacute;canisme de contr&ocirc;le des polices de Scribus les ait d&eacute;sactiv&eacute;es. Vous pouvez effectuer des v&eacute;rifications de base en suivant les indications &agrave; la page: <a href="fonts4.html">Tests de base des polices</a> </p>
</body>
</html>
 
