<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>C&eacute;sures - Astuces de frappe</title>
</head>
<body>
<h2>C&eacute;sures - Astuces de frappe</h2>
<h3>Introduction</h3>
<p>La fonction C&eacute;sures permet le r&eacute;glage pr&eacute;cis des coupures de mots dans Scribus. Elle est bas&eacute;e sur le code de Tex et sur celui d'OpenOffice.org, et son algorithme de rep&eacute;rage des syllabes a fait ses preuves.</p>

<h3>Utilisation</h3>
<p>C&eacute;sures. S&eacute;lectionnez un cadre de texte, ajustez l'alignement et allez ensuite au menu Pr&eacute;f&eacute;rences &#062; C&eacute;sures. Automatiquement signifie que s&eacute;lectionner un cadre de texte puis Pr&eacute;f&eacute;rences &#062; C&eacute;sures devient &eacute;quivalent &agrave; appliquer un style. Changer la police, l'espacement ou la taille de police redessinera automatiquement le texte et r&eacute;appliquera la c&eacute;sure automatiquement.</p>

<table width="100%"><tr><td align="center"><img src="images/hyphen1.png" align="center" alt="Fen&ecirc;tre des param&egrave;tres de c&eacute;sures" /></td></tr></table>

<p>Le r&eacute;glage le plus simple et qui conviendra &agrave; la plupart des cas consiste &agrave; ne cocher aucune option. Au moment d'ins&eacute;rer les c&eacute;sures dans votre texte, il suffira de s&eacute;lectionner le cadre de texte et d'aller au menu Extra &#062;  Effectuer les c&eacute;sures. Tout se passera automatiquement. Il est aussi possible de demander &agrave; Scribus d'ins&eacute;rer les c&eacute;sures en cours de saisie.</p>

<table width="100%"><tr><td align="center"><img src="images/hyphen2.png" align="center" alt="Fen&ecirc;tre des c&eacute;sures permises" title="Fen&ecirc;tre des c&eacute;sures permises" /></td></tr></table>

<p>Lorsque vous cochez l'option Suggestions de c&eacute;sures, vous avez la possibilit&eacute; d'accepter ou non les suggestions, ou d'en changer, comme on peut le voir ci-dessous.</p>

<table width="100%"><tr><td align="center"><img src="images/hyphen3.png" align="center" alt="Fen&ecirc;tre des c&eacute;sures permises" title="Fen&ecirc;tre des c&eacute;sures permises" /></td></tr></table>

<p>Il existe un fichier d'exemple, inclus avec la documentation, qui montre bien l'effet des c&eacute;sures sur une colonne de texte : <code>hyphen.scd.gz</code>.</p>

<p>Vous obtiendrez un beau r&eacute;sultat avec du texte <strong>justifi&eacute;</strong>.</p>

<p>&Agrave; l'heure actuelle, il est possible d'effectuer les c&eacute;sures dans les langues suivantes : allemand, anglais, catalan, danois, espagnol, finnois, fran&ccedil;ais, ga&eacute;lique, grec, hongrois, italien, lituanien, polonais, portugais, russe, slovaque, slov&egrave;ne, su&eacute;dois, tch&egrave;que et ukrainien.</p>
</body>
</html>
 
