<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Astuces d'importations avanc&eacute;es avec Scribus</title>
</head>
<body>
<h2>Astuces d'importations avanc&eacute;es avec Scribus</h2>
<p>Comme je l'ai mentionn&eacute;e dans la page pr&eacute;c&eacute;dente, une des t&acirc;ches les plus difficiles de la PAO est de mettre tout vos &eacute;l&eacute;ments <em>dans</em> votre mise en page. Voici quelques trucs que j'ai d&eacute;velopp&eacute;s en travaillant avec le nouvel importateur SVG. Une des raisons pour laquelle j'aime l'importation SVG est que Scribus peut l'&eacute;diter et que les couleurs peuvent &ecirc;tre g&eacute;r&eacute;es tr&egrave;s facilement. C'est compact et les PDF r&eacute;sultants sont &eacute;galement petits. Les SVG import&eacute;s s'impriment superbement.</p>
<p>Un jour, j'ai accept&eacute; de donner une pr&eacute;sentation pour un groupe technique local constitu&eacute; principalement de d&eacute;veloppeurs web sous Windows. Mon sujet &eacute;tait PDF et le web. Mon but &eacute;tait de montrer o&ugrave; les fichiers PDF pouvaient &ecirc;tre int&eacute;gr&eacute;s dans le contenu web. J'avais d&eacute;cid&eacute; que je voulais leur montrer Scribus et la puissance des outils de d&eacute;veloppement open source pour le web, via une &#034;pr&eacute;sentation&#034; PDF.</p>
<p>Quelques probl&egrave;mes sont survenus imm&eacute;diatement :</p>
<ol>
	<li>Cette pr&eacute;sentation allait &ecirc;tre faite sur un bon &eacute;cran de pr&eacute;sentation, donc la qualit&eacute; &eacute;tait importante.</li>
	<li>J'avais beaucoup de fichiers diff&eacute;rents qui devaient &ecirc;tre incorpor&eacute;s &agrave; la pr&eacute;sentation.</li>
</ol>
<p>Un des probl&egrave;me a &eacute;t&eacute; d'obtenir le logo de Scribus en SVG. Je voulais avoir le Scribus, ainsi que le logo du groupe en SVG, afin de pouvoir le redimensionner tr&egrave;s grand, comme 6+ pieds (2 m&egrave;tres). Voici comment j'ai proc&eacute;d&eacute; :</p>

<p>Franz avait le logo original en EPS, heureusement. Cependant, une partie du logo dans l'EPS &eacute;tait un bitmap. L'arme secr&egrave;te &eacute;tait <code>pstoedit</code>, un outil de ligne de commande qui peut convertir les fichiers bitmaps EPS et PS en tout types de formats vectoriels. Lorsqu'il est install&eacute; correctement, vous pouvez l'utiliser comme une sorte d'extension de GSview.</p>
<p>J'ai ouvert le fichier EPS du logo de Scribus dans GSview. Dans &Eacute;dition > Convertir en vecteur, ce dialogue appara&icirc;t :</p>

<table width="100%"><tr><td align="center"><img src="images/pstoedit1.png" alt="pstoedit"/></td></tr></table><br />

<p>En regardant la longue liste de format d'exportation de fichier, qui est impressionnante, j'ai trouv&eacute; Sketch, qui peut exporter en SVG. J'ai donc s&eacute;lectionn&eacute; cette option et coch&eacute; <strong>Texte en polygones</strong>. Pourquoi? La manipulation du texte SVG est ardue et incompl&egrave;te dans Sketch ou Sodipodi. Alors, GSview a affich&eacute; un &eacute;cran blanc et j'ai obtenu un .sk ou fichier Sketch. Je l'ai ouvert dans Sketch et il paraissait bien. Je l'ai donc export&eacute; en SVG &agrave; partir de Sketch puis je l'ai import&eacute; dans Scribus. Parfait. Non, pas encore. Certains &eacute;l&eacute;ments n'avaient pas &eacute;t&eacute; export&eacute;s comme esp&eacute;r&eacute; et n'apparaissaient pas dans le SVG. (&Agrave; ce moment l'importateur SVG avait seulement une semaine, donc j'ai suppos&eacute; qu'il s'agissait d'un bogue ou d'une caract&eacute;ristique manquante, mais j'ai d&eacute;couvert par la suite que ce n'&eacute;tait <strong>pas</strong> le cas. Scribus importe correctement un SVG <em>bien form&eacute;</em>.)</p>
<p> Donc, j'ai essay&eacute; d'ouvrir de m&ecirc;me SVG dans Sodipodi et de le re-sauvegarder. Puis en le r&eacute;-importer, c'&eacute;tait mieux mais pas parfait. J'ai ensuite r&eacute;alis&eacute; que dans Sodipodi, il y a une option pour <strong>Enregistrer en tant que SVG de base</strong>. OK, nous sommes presque arriv&eacute;s. Je pouvais clairement voir les &eacute;l&eacute;ments dans le groupe, mais quelques uns &eacute;taient blancs. Donc, dans Scribus, j'ai d&eacute;group&eacute; tous les &eacute;l&eacute;ments du SVG import&eacute; et j'ai s&eacute;lectionn&eacute;s ceux qui &eacute;taient blancs. Fait int&eacute;ressant : j'ai d&eacute;couvert dans la palette d'&eacute;dition de dessin que certains chemins n'&eacute;taient pas ferm&eacute;s. J'ai cliqu&eacute; sur l'option de fermeture et la couleur est apparue. Apr&egrave;s quelques minutes &agrave; cliquer et fermer les chemins et j'avais le logo de Scribus dans Scribus, en SVG. Mission accomplie</p>

<p>J'ai utilis&eacute; le m&ecirc;me truc pour importer des tables d'un PDF dans Scribus. Un des utilisateurs de Scribus sur la liste essayait d'utiliser Scribus au lieu de InDesign. Durant les tests, un des probl&egrave;mes &eacute;tait le manque de support pour les tableaux dans Scribus et Scribus a un bon support pour les tableaux. Une fois encore, pstoedit, Sketch et Sodipodi sont venus &agrave; la rescousse.</p>
<p>J'ai obtenu le fichier InDesign, qui a pu &ecirc;tre reproduit dans Scribus, mais qui a pris beaucoup de temps &agrave; faire. Donc, &agrave; partir de InDesign, j'ai export&eacute; en PDF 1.3, beau et simple. Ensuite j'ai ouvert le PDF dans GSview. J'ai utilis&eacute; l'extension pstoedit pour le convertir en un fichier Sketch. J'ai ouvert Sketch et le fichier &eacute;tait parfait &agrave; l'&eacute;cran. J'ai export&eacute; en SVG. Je l'ai ouvert dans Scribus, nous avons presque termin&eacute;. J'ai r&eacute;-ouvert le SVG dans Sodipodi, je l'ai resauvegard&eacute; en SVG de base. Puis je l'ai import&eacute; dans Scribus. Comme r&eacute;sultat, j'ai obtenu une r&eacute;plique parfaite du document PDF original.</p>
<p>Cependant, cette m&eacute;thode fonctionne mieux avec des fichiers EPS ou PDF qui ont du texte ou des &eacute;l&eacute;ments vectoriels comme des courbes ou des lignes. Oubliez les fichiers avec des photographies ou des d&eacute;grad&eacute;s complexes. Mais pour convertir des logos, des tableaux ou m&ecirc;me dans certains cas du texte stylis&eacute;, c'est une mani&egrave;re nouvelle et utile de placer vos travaux dans Scribus. Ils peuvent &ecirc;tre &eacute;dit&eacute;s et vous pouvez &ecirc;tre certains qu'ils seront reproduits parfaitement en PDF ou &agrave; l'impression.</p>

<p><strong><em>Le&ccedil;ons :</em></strong> premi&egrave;rement, <strong>pstoedit</strong> est un outil remarquable dont l'usage est facilit&eacute; par GSview. La qualit&eacute; de conversion, avec les param&egrave;tres par d&eacute;faut, &eacute;tait &eacute;tonnante. Les courbes dans l'EPS Scribus correspondaient parfaitement &agrave; celles du SVG, les couleurs &eacute;galement. Deuxi&egrave;mement, re-sauvegarder un format d'image complexe dans une application autre que celle qui l'a cr&eacute;&eacute; a parfois l'effet de "nettoyer" un fichier. L'oppos&eacute; doit aussi &ecirc;tre vrai, par exp&eacute;rience. Troisi&egrave;mement, n'ayez pas peur d'exp&eacute;rimenter un peu, sp&eacute;cialement avec le format SVG. SVG est un format de fichier merveilleux avec plusieurs possibilit&eacute;s. Cependant, il est relativement r&eacute;cent et aucune application open source ou commercial n'a perfectionn&eacute; son importation ou exportation. De plus, aucun &eacute;diteur vectoriel ne supporte toutes les sp&eacute;cifications SVG.</p>

<p>Vous savez maintenant pourquoi SVG est mon nouveau format de fichier pr&eacute;f&eacute;r&eacute;.</p>
</body>
</html>
 
