<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Notes sur les probl&egrave;mes d'importation avec Scribus</title>
</head>
<body>
<h2>Notes sur les probl&egrave;mes d'importation avec Scribus</h2>
<p>M&ecirc;me si Scribus importe les formats d'images les plus courant de la PAO, comme TIFF et EPS, au fil du temps, une des t&acirc;ches les plus difficile est d'agencer le contenu dans votre mise en page. Contrairement &agrave; certaines applications de PAO o&ugrave; l'impression s'effectue &agrave; vos risques et p&eacute;rils, l'impression et l'exportation avec Scribus ont toujours &eacute;t&eacute; tr&egrave;s fiables. Je peux compter sur mes doigts les quelques plantages ou les occasions o&ugrave; je n'ai pu obtenir l'impression ou le PDF d&eacute;sir&eacute; de Scribus. Avec des images et des fichiers correctement pr&eacute;par&eacute;s, la sortie de Scribus est du niveau des
applications commerciales de mise en page.</p>
<p>D'apr&egrave;s mon exp&eacute;rience, la cl&eacute; est d'utiliser le bon format pour le bon type d'image. Lorsque c'est possible, importez vos images en format vectoriel via SVG, EPS ou PDF. Or, je suis <strong>vraiment</strong> pointilleux &agrave; propos des polices. Il est not&eacute;, tout au long de la documentation, que le travail avec des outils de PAO avanc&eacute;s comme Scribus est &eacute;troitement li&eacute; &agrave; la qualit&eacute; des polices. Dans la PAO professionnelle, cela importe <strong>beaucoup</strong>. Il y a fort &agrave; parier qu'une sortie PostScript rat&eacute;e, soit chez un imprimeur, soit &agrave; l'exportation PDF, est due &agrave; une police &eacute;pineuse ou corrompue.</p>

<h3>TIFF, JPEG, PNG quelle est la diff&eacute;rence?</h3>
<p>Conseils (ou) moyen d'&eacute;viter quelques probl&egrave;mes pos&eacute;s &agrave; un d&eacute;butant :</p>

<h3>Si &ccedil;a para&icirc;t bien &agrave; l'&eacute;cran, &ccedil;a para&icirc;tra bien sur papier</h3>
<p>Non, d&eacute;sol&eacute;. Une des erreurs les plus courantes commises par les d&eacute;butants est d'assumer qu'un JPEG paraissant bien sur un site web s'imprimera correctement sur papier. La plupart des sites web utilisent des GIF ou malheureusement, moins couramment, des PNG. Les JPEG, par leur conception, perdent des &eacute;l&eacute;ments dans la compression. Dans le processus de compression d'un JPEG, des donn&eacute;es sont mises de c&ocirc;t&eacute; et perdues de mani&egrave;re permanente. De plus, il y a un type de JPEG appel&eacute; "progressif" qui est un pur poison dans le processus PostScript. Un JPEG progressif est le type qui d'affiche partiellement lors du t&eacute;l&eacute;chargement dans un navigateur web. <strong>&Eacute;vitez-les &agrave; tout prix.</strong> Scribus ne chargera pas et n'exportera pas de JPEG progressifs. Finalement, rappelez-vous que la plupart des graphiques d'une page web ont ne r&eacute;solution de 72-96 ppp. Scribus peut g&eacute;n&eacute;rer des PDF avec 4000 ppp.</p>
<p>Pour l'impression PostScript de haut niveau, il y a trois sortes de formats de fichiers qui fonctionnent bien pour des images comme des photos, compos&eacute;es de pixels, et qui ont maintes fois &eacute;t&eacute; test&eacute;s : TIFF, tif et Tiff.</p>
<p>Peu importe la mani&egrave;re de l'&eacute;crire, un Tagged Image File Format est le format de fichier pour les images bitmap. Point. Fin de l'histoire. N'argumentez pas : je gagnerais.</p>

<h3>Pourquoi?</h3>
<ol>
	<li>C'est un format &#034;sans pertes&#034;. Le mode de compression ne r&eacute;duit pas la qualit&eacute;.</li>
	<li>Pour ce qui est de travailler avec Scribus, GIMP effectue un bon travail d'exportation ou de sauvegarde des images &agrave; partir du format natif XCF.</li>
	<li>Il manipule les profils ICC sans probl&egrave;me. Vous pouvez &#034;l'annoter&#034; avec l'outil littlecms, tifficc, ou inclure le profil ICC dans Photoshop, Photopaint et d'autres &eacute;diteurs bitmap.</li>
	<li>Il supporte les couleurs CMYK mieux que tout autre format bitmap.</li>
	<li>Toute application PAO de qualit&eacute; peut les supporter, incluantScribus.</li>
	<li>Les fichiers TIFF, s'ils sont pr&eacute;par&eacute;s correctement dans GIMP ou Photoshop, sont extr&ecirc;mement fiables lors de l'impression commerciale. Les p&eacute;riph&eacute;riques PostScript ont rarement des probl&egrave;mes avec.</li>
</ol>

<h3>Pr&eacute;cautions</h3>
<p>Il y a plus de cinquante types de TIFF diff&eacute;rents. Tous les &eacute;diteurs d'images ne les sauvegardent en respectant totalement les standards. GIMP utilise libtiff, partag&eacute; avec Scribus et effectue supporte bien lesTiff. Avec des fichiers qui proviennent de GIMP, je sauvegarde le fichier original dans le format natif xcf de GIMP, puis, une fois &eacute;dit&eacute;, je le r&eacute;-enregistre en tant que TIFF, ou avec des copies d'&eacute;cran destin&eacute;es au web, en PNG.</p>
<p>Maintenant, l'exception &agrave; la r&egrave;gle est le PNG, sp&eacute;cialement pour une copie d'&eacute;cran d'application. Le PNG poss&egrave;de beaucoup de caract&eacute;ristiques avanc&eacute;es, comme le support couleur ICC et la vraie transparence alpha, qui souvent ne sont pas bien support&eacute;es par certaines applications (un certain navigateur connu vient ici en t&ecirc;te). Le PNG compresse &eacute;galement tr&egrave;s bien. Le seul moment o&ugrave; je pr&eacute;f&egrave;re le JPEG au PNG est pour les photos avec une grande gamme dynamique, principalement pour des raison de taille sur une page web. Pour cr&eacute;er des PDF avec des copies d'&eacute;cran, le PNG est superbe et s'imprime bien, tant que vous n'effectuez pas d'ajustements de tailles qui r&eacute;duisent la taille de l'image. Donc si vous avez une copie d'&eacute;cran, qui est typiquement &agrave; 72-96 ppp, mais que vous devez la r&eacute;duire, faites-le en r&eacute;duisant l'image dans GIMP ou Scribus. Redimensionner des copies d'&eacute;cran d&eacute;sactive le r&eacute;-&eacute;chantillonnage dans les &eacute;diteurs d'images. Avec des copies d'&eacute;cran, vous ne devriez jamais r&eacute;duire le nombre de pixels ou vous perdrez de l'acuit&eacute; rapidement.</p>

<h3>Si le rendu &agrave; l'&eacute;cran est mauvais, il sera terrible &agrave; l'impression</h3>
<p>Les fichiers EPS ou Encapsulated PostScript. Les fichiers EPS n'ont nativement aucun aper&ccedil;u &agrave; l'&eacute;cran. Les fichiers EPS sont vraiment un sous-ensemble d'instructions Postscript. &Agrave; l'&eacute;cran, ils typiquement horribles s'ils incluent un aper&ccedil;u TIFF ou PICT ou sinon, ils apparaissent tout simplement comme un rectangle gris. Les EPS ont deux vertus importantes : ils s'impriment bien sur des imprimantes haute r&eacute;solution ou lors de la cr&eacute;ation de PDF. Les fichiers EPS peuvent &ecirc;tre ind&eacute;pendants de la r&eacute;solution et sont les seuls fichiers que vous pouvez (parfois) redimensionner de mani&egrave;re s&eacute;curitaire &agrave; plus de 100% que sa taille initiale sans d&eacute;grader l'acuit&eacute; de l'image.</p>
<p>Le seul probl&egrave;me auquel vous pourrez &ecirc;tre confront&eacute; avec les fichiers EPS est lorsque beaucoup d'applications peuvent g&eacute;n&eacute;rer des fichiers EPS, ils ne le font pas tous avec la m&ecirc;me fid&eacute;lit&eacute; &agrave; l'impression de haute qualit&eacute;, et toutes les applications ne respectent pas les sp&eacute;cifications EPS correctement. Une mani&egrave;re de tester un EPS destin&eacute; &agrave; Scribus, est de l'ouvrir dans GSview et de regarder dans la bo&icirc;te de messages, en pressant Shift M. Ceci montrera les messages de sortie g&eacute;n&eacute;r&eacute;s par Ghostscript. Ghostscript est correctement tatillon au sujet des fichiers EPS. Donc, si vous essayez d'importer des fichiers EPS et qu'ils ne fonctionnent pas correctement dans Scribus et que GSview/Ghostscript produit beaucoup de messages d'erreurs, essayez d'utiliser une application diff&eacute;rente pour les g&eacute;n&eacute;rer.</p>
<p>Une raison de l'ubiquit&eacute; des fichiers EPS dans la PAO est qu'il y a une autre application de PAO qui avait historiquement un mauvais support pour le TIFF et les autres fichiers images bitmap, mais supportait bien les EPS. Plusieurs utilisateurs de PAO ont donc par habitude cr&eacute;&eacute; des fichiers EPS &agrave; partir d'images bitmaps, avec Photoshop ou autres. Malheureusement, ceci peut avoir l'effet ind&eacute;sirable de recevoir des fichiers images qui ont besoin d'ajustements, mais sans le fichier image original c'est impossible. Les EPS sont l'id&eacute;al pour recevoir des dessins vectoriels, comme des cartes, m&eacute;lang&eacute;s &agrave; du texte. Le seul point est que les polices doivent &ecirc;tre incluses dans l'EPS correctement pour s'imprimer correctement &agrave; partir de Scribus.</p>
<p>Heureusement, Scribus cr&eacute;e automatiquement un aper&ccedil;u image en basse r&eacute;solution qui est pratique pour placer et ajuster l'image dans la page. Lors de l'importation d'un EPS, Scribus g&eacute;n&egrave;re un aper&ccedil;u PNG 72 ppp de l'EPS, ne vous pr&eacute;occupez donc pas s'il n'appara&icirc;t pas clairement tout de suite. Imprimer ou exporter un PDF g&eacute;n&eacute;rera une image haute r&eacute;solution dans le fichier.</p>
<p>Sceptique &agrave; propos de la diff&eacute;rence entre un vecteur et une images bitmap? Voici un exemple que vous pouvez voir par vous-m&ecirc;me. Allez &agrave; : <a href="http://www.isc.tamu.edu/~lewing/linux">http://www.isc.tamu.edu/~lewing/linux</a></p>
<p>T&eacute;l&eacute;chargez le PostScript li&eacute;, qui est une version EPS de Tux, puis cliquez avec le bouton droit de la souris et t&eacute;l&eacute;chargez un des gifs. Ils ont environ la m&ecirc;me taille de fichier. Cr&eacute;ez maintenant un nouveau document dans Scribus avec deux pages de taille normale. Placez le gif sur une page et l'eps sur l'autre. Exportez en PDF &agrave; 600+ ppp.
Ouvrez dans Acrobat Reader. Agrandissez &agrave; 200-400 %. Voyez maintenant la diff&eacute;rence...</p>
<p>Pourquoi cette diff&eacute;rence? Scribus cr&eacute;e et Acrobat Reader rendu ce qu'on appelle des op&eacute;rateurs PostScript, un autre nom pour l'utilisation des math&eacute;matiques dans le dessin des courbes &agrave; l'&eacute;cran et &agrave; l'impression. Un GIF ou un JPEG n'est qu'un ensemble de pixels, c'est-&agrave;-dire des points qui constituent l'image.</p>

<h3>Mon nouveau format de fichier favori</h3>
<p>Avec l'ajout r&eacute;cent de l'importation SVG, l'utilisateur poss&egrave;de maintenant une autre excellente mani&egrave;re d'importer des images et des dessins. SVG signifie Scalable Vector Graphics. L'aspect "Scalable" permet le redimensionnement, ce qui signifie qu'en th&eacute;orie vous pouvez agrandir une image vectorielle jusqu'&agrave; la taille d'un immeuble, et il gardera sa nettet&eacute;. En r&eacute;sum&eacute;, les vecteurs permettent ce r&eacute;sultat, les formes &eacute;tant dessin&eacute;es par des commandes math&eacute;matiques. Des trucs d'importations sont pr&eacute;sent&eacute;s &agrave; la page suivante.</p>

<h3>Pensez aux polices lorsque vous importez &eacute;galement</h3>
<p>Un probl&egrave;me semblable survient lorsque les polices s'affichent normalement &agrave; l'&eacute;cran mais ne s'impriment pas bien. Habituellement, c'est le case avec les polices TrueType gratuites t&eacute;l&eacute;charg&eacute;es du web. Les polices TrueType, en g&eacute;n&eacute;ral, para&icirc;tront mieux &agrave; l'&eacute;cran, mais ne donneront pas les r&eacute;sultats escompt&eacute;s &agrave; l'impression. Cependant, beaucoup de temps de tests est n&eacute;cessaire pour cr&eacute;er des polices de haute qualit&eacute;, sp&eacute;cialement pour obtenir des polices TrueType correctes. Notez qu'il y a tr&egrave;s peu de police de haute qualit&eacute; qui ont &eacute;t&eacute; d&eacute;velopp&eacute;es en open source. Il y en a quelques unes, mais malheureusement pas avec la r&eacute;gularit&eacute; avec laquelle nous voyons appara&icirc;tre de nouvelles applications sur Freshmeat.</p>
<p>D'un autre c&ocirc;t&eacute;, les polices Type 1 incluses avec Ghostscript ne sont pas optimis&eacute;es pour l'apparence &agrave; l'&eacute;cran, mais elles font habituellement d'excellentes polices d'impression. Ces polices ont &eacute;t&eacute; faites par URW++, une fonderie bien connue, et ont &eacute;t&eacute; donn&eacute;es &agrave; la distribution Ghostscript par Artifex. Le seul probl&egrave;me est que les polices Nimbus voient souvent leur vrai nom PostScript assimil&eacute; &agrave; Times, Helvetica et Courier. L'utilisateur
en vient &agrave; penser qu'il n'est pas n&eacute;cessaire d'inclure ces polices puisqu'elles viennent en standard avec Acrobat Reader. Malheureusement, elles ne sont pas incluses. Acrobat Reader effectue un travail particuli&egrave;rement mauvais en les &eacute;mulant avec ses polices int&eacute;gr&eacute;es multi-master. Avec Scribus, vous n'aurez pas cette pr&eacute;occupation, puisque Scribus utilise les noms PostScripts corrects inclus dans la police.</p>
<p>Les polices Bitstream incluses avec Xfree86 comme Charter et les nouvelles polices Vera donnent de bons r&eacute;sultats &agrave; l'impression. J'aime aussi la famille Utopia qui est actuellement une police Adobe Type 1 donn&eacute;e par IBM. Lors de la cr&eacute;ation de documents Scribus sous forme de PDF, j'utilise presque exclusivement cette famille.</p>
</body>
</html>
 
