<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>La PAO Open Source pour Linux, Mac OS&#174; X et Windows&#174;</title>
</head>
<body>
<table border="0" cellspacing="0" cellpadding="0" width="100%" bgcolor="#2780b9" >
	<tr>
		<td align="left"><img src="../en/images/docheader1.png" width="222" height="87"></td>
		<td align="right"><img src="../en/images/docheader2.png" width="318" height="87"></td>
	</tr>
</table>

<h2>La PAO Open Source pour Linux, Mac OS&#174; X et Windows&#174;</h2>

<p>Scribus fournit aux environnements Linux/Unix, MacOSX et Windows la PAO professionnelle, maintes fois pl&eacute;biscit&eacute;, offrant &agrave; la fois des sorties &#034;pr&ecirc;tes pour l'impression&#034; et une nouvelle approche de la mise en page.</p>

<p>Depuis ses modestes d&eacute;buts au printemps 2001, Scribus s'est rapidement d&eacute;velopp&eacute; pour devenir l'une des applications bureautiques phares sous Linux. Pr&eacute;sent&eacute; par Newsforge comme <b>"..l'une des 'killer app' pour Linux"</b>, Scribus offre plus de puissance et d'outils pour la publication. Les nouvelles fonctionnalit&eacute;s telles que la pr&eacute;visualisation des s&eacute;parations, le support de scripts Python multiplateformes, ou le support avanc&eacute; de PDF 1.4 ne sont que quelques exemples des centaines d'am&eacute;liorations, petites ou grandes, de Scribus. Depuis la version 1.3.3.7, Scribus est maintenant compl&egrave;tement multiplateformes et fonctionne en mode natif dans les quatres environnements.</p>

<p>Sous son interface moderne et conviviale, Scribus offre un &eacute;ventail de fonctionnalit&eacute;s de publication professionnelle, comme le support des couleurs CMJN, les s&eacute;parations, la gestion des profils ICC et la cr&eacute;ation de fichiers PDF. <b>Scribus a &eacute;t&eacute; la toute premi&egrave;re application de PAO (dans le monde) &agrave; supporter l'exportation directe au format PDF/X-3, un standard ISO rigoureux.</b> Et ce depuis presque un an. Parmi les autres fonctionnalit&eacute;s, on notera l'importation de fichiers PDF, l'importation et exportation des fichiers EPS, ou le support du texte Unicode, y compris pour les langues &eacute;crites de droite &agrave; gauche comme l'arabe ou l'h&eacute;breu.</p>

<p><b>Scribus pr&eacute;sente &eacute;galement quelques fonctionnalit&eacute;s inattendues comme des outils de dessin vectoriel, l'importation et l'exportation au format SVG, ou encore le support des polices Open Type.</b> Le format natif des fichiers Scribus est bas&eacute; sur XML, ouvert et parfaitement document&eacute;. Contrairement aux fichiers binaires propri&eacute;taires, les fichiers endommag&eacute;s peuvent &ecirc;tre restaur&eacute;s au moyen d'un simple &eacute;diteur de texte - alors que cette op&eacute;ration peut s'av&eacute;rer tr&egrave;s complexe avec d'autres applications de PAO. Scribus dispose &eacute;galement d'un album accessible ais&eacute;ment par 'Glisser - D&eacute;poser'. L'application a &eacute;t&eacute; enti&egrave;rement traduite dans plus de 25 langues, et de nouvelles traductions sont &agrave; venir pour les prochaines versions. <b>L'&eacute;quipe Scribus est fi&egrave;re de son excellent support aux utilisateurs, avec un canal IRC vivant et une liste de discussion accueillante.</b></p>


<div class="news">
	<div class="item">
		<h3>Statut du projet</h3>
		<ul>
			<li><b>28/05/2007</b> - Scribus 1.3.4 disponible </li>
			<li><b>05/05/2007</b> - Scribus 1.3.3.9 disponible </li>
			<li><b>23/02/2007</b> - Scribus 1.3.3.8 disponible </li>
			<li><b>09/01/2007</b> - Scribus 1.3.3.7 disponible (OS/2 Port)</li>
			<li><b>04/12/2006</b> - Scribus 1.3.3.6 disponible</li>
			<li><b>09/11/2006</b> - Scribus 1.3.3.5 disponible</li>
			<li><b>03/10/2006</b> - Scribus 1.3.3.4 disponible</li>			
			<li><b>07/08/2006</b> - Scribus 1.3.3.3 disponible</li>
			<li><b>14/07/2006</b> - Scribus 1.2.5 disponible</li>
			<li><b>29/05/2006</b> - Scribus 1.3.3.2 (devel)  disponible</li>
			<li><b>10/04/2006</b> - Scribus 1.3.3.1 (devel)  disponible</li>
			<li><b>26/03/2006</b> - Scribus 1.3.3 (d&eacute;veloppement)  disponible</li>
			<li><b>22/01/2006</b> - Scribus 1.3.2 (d&eacute;veloppement)  disponible</li>
			<li><b>05/01/2006</b> - Scribus 1.2.4.1 disponible</li>
			<li><b>03/10/2005</b> - Scribus 1.3.1 (d&eacute;veloppement)  disponible</li>
			<li><b>12/09/2005</b> - Scribus 1.2.3 disponible</li>
			<li><b>14/07/2005</b> - Scribus 1.3.0 disponible</li>
			<li><b>05/07/2005</b> - Scribus 1.2.2.1 disponible</li>
			<li><b>8/01/2005</b> - Scribus 1.2.1 disponible</li>
			<li><b>28/08/2004</b> - Scribus 1.2 disponible</li>
			<li><b>06/06/2004</b> - Scribus 1.1.7 disponible</li>
			<li><b>28/03/2004</b> - Scribus 1.1.6 disponible</li>
			<li><b>14/02/2004</b> - Scribus 1.1.5 disponible</li>
			<li><b>18/12/2003</b> - Scribus 1.1.4 disponible</li>
			<li><b>28/11/2003</b> - Scribus 1.1.3 disponible</li>
			<li><b>28/10/2003</b> - Scribus 1.1.2 disponible</li>
			<li><b>03/10/2003</b> - Scribus 1.1.1 disponible</li>
			<li><b>06/09/2003</b> - Scribus 1.1.0 disponible</li>
			<li><b>07/08/2003</b> - Scribus 1.0.1 disponible</li>
			<li><b>21/06/2003</b> - Scribus 1.0 disponible</li>
			<!--
			<li><b>13/06/2003</b> - Scribus 0.9.11.1 released</li>
			<li><b>16/05/2003</b> - Scribus 0.9.10 released</li>
			<li><b>18/04/2003</b> - Scribus 0.9.9 released</li>
			<li><b>25/03/2003</b> - Scribus 0.9.8 released</li>
			<li><b>21/02/2003</b> - Scribus 0.9.7 released</li>
			<li><b>11/01/2003</b> - Scribus 0.9.6 released</li>
			<li><b>14/12/2002</b> - Scribus 0.9.4 released</li>
			<li><b>23/11/2002</b> - Scribus 0.9.3 released</li>
			<li><b>14/11/2002</b> - Scribus 0.9.2 released</li>
			<li><b>30/12/2002</b> - Scribus 0.9.1 released</li>
			<li><b>09/11/2002</b> - Scribus 0.9.0 released</li>
			<li><b>24/09/2002</b> - Scribus 0.8.0 released</li>
			<li><b>30/12/2002</b> - Scribus 0.7.8 released</li>-->
		</ul>
	</div>
</div>
</body>
</html> 