<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Installation de Scribus</title>
</head>
<body>
<h2>Installation de Scribus</h2>

<p>Le processus d'installation de Scribus d&eacute;pend de la distribution Linux/Unix que vous utilisez. Cette situation ressemble &agrave; celle de tout programme que vous d&eacute;sirez installer. Ce qui suit montre comment installer Scribus sur diverses distributions :</p>
<table border="1">
	<tr bgcolor="#dddddd"><td>Distribution Linux</td><td>M&eacute;thode d'installation</td></tr>
	<tr bgcolor="#eeeeee"><td>Debian</td><td><code>apt-get install scribus</code> ou de pr&eacute;f&eacute;rence utilisez une des interfac es graphiques comme &#034;Synaptic&#034; qui g&egrave;re les &#034;Recommends&#034; correctement. Pour plus d'information, veuillez lire <a href="install-dpkg.html">Comment utiliser le d&eacute;p&ocirc;t Scribus de Debian</a></td></tr>
	<tr bgcolor="#eeeeee"><td>Gentoo</td><td><code>emerge scribus</code></td></tr>
	<tr bgcolor="#eeeeee"><td>PLD</td><td><code>poldek -i scribus</code></td></tr>
	<tr bgcolor="#eeeeee"><td>RedHat/Fedora</td><td><code>rpm -Uvh ./scribus-1.x.rpm</code></td></tr>
	<tr bgcolor="#eeeeee"><td>Slackware</td><td>S'installe &agrave; partir de la source, &agrave; partir de la version 1.2 il fait partie de Slackware</td></tr>
	<tr bgcolor="#eeeeee"><td>SuSE</td><td>Utilisez Yast2 pour l'installation, OU, <code>rpm -Uvh ./scribus-1.x.rpm</code></td></tr>	
	<tr bgcolor="#dddddd"><td>Autre syst&egrave;mes d'exploitation</td><td>M&eacute;thode d'installation</td></tr>
	<tr bgcolor="#eeeeee"><td>FreeBSD</td><td><code>cd /usr/ports/print/scribus; make install</code></td></tr>
	<tr bgcolor="#eeeeee"><td>Mac OSX</td><td>Veuillez vous r&eacute;f&eacute;rer &agrave; la section <a href="cross-platform.html">Environnements multiplateforme</a> </td></tr>
	<tr bgcolor="#eeeeee"><td>Windows&#8482;</td><td>Veuillez vous r&eacute;f&eacute;rer &agrave; la section <a href="cross-platform.html">Environnements multiplateforme</a> </td></tr>
</table>

<p>Suivant la version de votre distribution, il est possible que vous deviez mettre &agrave; jour plusieurs d&eacute;pendances de Scribus, et les commandes ci-dessus devraient faire en sorte que tous les modules n&eacute;cessaires sont install&eacute;s.</p>
<p>Par exemple, pour acc&eacute;der aux fichiers de police que vous voulez utiliser dans Scribus, Scribus se fie &agrave; FreeType. Pour obtenir de meilleurs r&eacute;sultats, nous recommandons d'utiliser la version 2.1.9 de FreeType ou une version plus r&eacute;cente. Si vous ne poss&eacute;dez pas un certain niveau logiciel, nous ne pouvons pas garantir que Scribus fonctionnera correctement ni garantir que vous obtiendrez les r&eacute;sultats recherch&eacute;s. Si les commandes ci-dessus ne mettent pas &agrave; jour les d&eacute;pendances sur votre syst&egrave;me, reportez-vous &agrave; la page <a  href="install2.html">&Eacute;l&eacute;ments requis</a> pour v&eacute;rifier leur pr&eacute;sence.</p>
<p>Si vous souhaitez installer une version de Scribus plus r&eacute;cente que celle incluse dans votre distribution, v&eacute;rifiez que vous avez tous les <a href="install2.html">&Eacute;l&eacute;ments requis</a> et passez &agrave; la section <a href="install1.html">Source de Scribus</a>.</p>

</body>
</html>
 
