<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Gabarits de page - Utiliser la palette Page</title>
</head>
<body>
	
<h3>Gabarits de page - Utiliser la palette Page</h3>

<p>Les gabarits de page sont faits pour ajouter du contenu aux pages qui ont un contenu r&eacute;p&eacute;titif comme les num&eacute;ros de page, les noms de chapitre, les en-t&ecirc;tes de section et autres &eacute;l&eacute;ments similaires. Les utilisateurs d'autres applications de mise en page connaissent peut-&ecirc;tre le concept de <em>gabarits de page</em> ou de pages de fond statiques. Il est fondamental de comprendre que ces gabarits ne sont pas &eacute;ditables &agrave; partir du canevas de page normal. Tout les &eacute;l&eacute;ments, sauf les num&eacute;ros de page, sont des &eacute;l&eacute;ments de fond statiques.</p>

<p>Une cr&eacute;ation bien pens&eacute;e des gabarits de page et des styles peut grandement simplifier et acc&eacute;l&eacute;rer la mise en page des documents. Plus les documents sont complexes, plus les gabarits deviennent essentiels. Le premier usage, et peut-&ecirc;tre le plus courant, est l'addition automatique des num&eacute;ros de page. Commen&ccedil;ons ici :</p>

<h4>Addition automatique des num&eacute;ros de page</h4>
<p>C'est actuellement assez simple. Aller &agrave; <strong>&Eacute;dition > Gabarits</strong>, puis cr&eacute;ez un cadre de texte o&ugrave; vous voulez que le num&eacute;ro de page apparaisse. Ensuite, en mode &eacute;dition, tapez Alt+#. (Pour les utilisateur des claviers US, nous recommandons de re-mapper cette combinaison &agrave; F7 par exemple.) Enregistrez le mod&egrave;le et retournez au document principal.</p>

<h4>Palette de page</h4>


<p>La palette de page vous fournit une mani&egrave;re rapide par le glisser-d&eacute;poser d'appliquer des gabarits de page, en navigant entre les pages et en d&eacute;pla&ccedil;ant et ins&eacute;rant des pages. La moiti&eacute; sup&eacute;rieure de la palette montre les gabarits disponibles pour votre document. La moiti&eacute; inf&eacute;rieure montre les pages actuelles de votre document.</p>

<table width="100%"><tr><td align="center"><img src="images/pagetemplate1.png" title="Palette de page" alt="Palette de page" align="center" /></td></tr></table>


<p>&Agrave; l'aide de la palette de page, vous pouvez :</p><ul>
<li>Ins&eacute;rer une page en glissant une page gabarit de l'espace gabarit vers l'espace mise en page. Lorsque l'espace montre une barre horizontale, rel&acirc;chez le bouton gauche de la souris.</li>
<li>Appliquer un gabarit en glissant un gabarit et en le d&eacute;posant sur la page s&eacute;lectionn&eacute;e.</li>
<li>Supprimer une page ou un gabarit en le glissant sur la poubelle.</li>
<li>D&eacute;placer les pages en les glissant et les d&eacute;posant entre les pages. Quand une ligne horizontale appara&icirc;t, rel&acirc;chez le bouton gauche de souris.</li>
<li>Naviguer entre les pages, par un clic du bouton gauche de la souris, d&eacute;placera le canevas &agrave; cette page.</li>
<li>Vous pouvez changer les aper&ccedil;us dans la zone de gabarit en cliquant avec le bouton droit de la souris dans cet espace et en d&eacute;cochant Aper&ccedil;u de la page.</li>
<li>Un double clic sur un gabarit permet d'&eacute;diter le gabarits&eacute;lectionn&eacute;.</ul></li>



<!--<p>Above is an example of how to use a template which allows you to have recurring objects on several pages. The template page is has a background of black tinted at 5% to simulate glossy grey paper with a faded logo in the background. The eliminates the time to recreate this on each page.
</p>-->


<h4>Appliquer des gabarits</h4>
<p>Ici, vous pouvez appliquer un gabarit cr&eacute;&eacute; auparavant avec une taille, des goutti&egrave;res et d'autres param&egrave;tres. Les gabarits sont propres &agrave; chaque document. Cette technique est utile si vous avez besoin d'une s&eacute;rie de pages avec un fond r&eacute;p&eacute;t&eacute; sur chaque page, ou des cadres de texte par d&eacute;faut pour la num&eacute;rotation, les en-t&ecirc;tes ou les pieds de page.</p>
<p>Si vous pensez avoir besoin de plusieurs gabarits qui partagent les m&ecirc;mes caract&eacute;ristiques,  vous pouvez gagner du temps en cr&eacute;ant un seul gabarit contenant
toutes les caract&eacute;ristiques, pour utiliser ensuite la fonction dupliquer et produire des variations de l'original (au lieu de cr&eacute;er un gabarit &agrave; partir de rien).</p>
<p>Les gabarits peuvent aussi &ecirc;tre import&eacute;s &agrave; partir d'autres documents. Par exemple, un livre qui a des fichiers de chapitre s&eacute;par&eacute;s peut importer les gabarits &agrave; partir d'un fichier commun.</p>

</body>
</html> 