<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>L'exportation PDF avec Scribus</title>
</head>
<body>
<h2>L'exportation PDF avec Scribus</h2>

<h3>Survol</h3>

<p>La puissance et la souplesse de l'exportation au format PDF figurent parmi les caract&eacute;ristiques les plus remarquables de Scribus. Il faudrait presque lui r&eacute;server un chapitre pour la documenter en entier. Je vous invite &agrave; lire cette introduction jusqu'au bout pour vous familiariser avec toutes les fonctions et options PDF de Scribus. Je vous invite aussi &agrave; jeter un coup d'oil sur des fichiers PDF cr&eacute;&eacute;s avec Scribus dans la section T&eacute;l&eacute;chargement de <a href="http://www.scribus.net">www.scribus.net</a>.</p>
<p>La nature multiplateforme du format PDF permet aux utilisateurs de Scribus de surmonter ce qui pourrait faire obstacle &agrave; Linux et &agrave; la PAO. Scribus exporte de fa&ccedil;on fiable des fichiers PDF "pr&ecirc;ts pour les presses" incluant les fonctions avanc&eacute;es du PDF 1.4, le PDF/X-3 conforme &agrave; la norme ISO et les PDF capables de g&eacute;rer la couleur au moyen des profils ICC gr&acirc;ce &agrave; <a href="http://www.littlecms.com">little cms</a>. Si votre imprimeur est sceptique, dirigez-le vers <a href="prepress.html">La pr&eacute;-impression avec Scribus</a>. Il y trouvera un fichier PDF t&eacute;l&eacute;chargeable qui d&eacute;crit les tests de pr&eacute;presse effectu&eacute;s sur Scribus ainsi que des renseignements additionnels.</p> 
<p>Si Scribus ne pouvait que cr&eacute;er des fichiers PDF haute r&eacute;solution de qualit&eacute; professionnelle, cela en ferait d&eacute;j&agrave; une grande application. Mais viennent en prime une facilit&eacute; d'utilisation et une souplesse qui permettent, par exemple : les pr&eacute;sentations &agrave; la Powerpoint, les formulaires web interactifs pouvant &ecirc;tre utilis&eacute;s lors de l'&eacute;change &eacute;lectronique de documents, le contr&ocirc;le des &eacute;l&eacute;ments du fichier PDF par JavaScript. Scribus permet aussi les annotations, les signets et la protection des documents, au besoin.</p>
<p>Si le format PDF est, en un sens, un standard propri&eacute;taire (il appartient &agrave; la soci&eacute;t&eacute; Adobe), il est largement disponible sur la plupart des plateformes informatiques. Il est aussi tr&egrave;s bien document&eacute;. Le livre de r&eacute;f&eacute;rence du PDF 1.5 ne fait <em>que</em> 1100 pages. Les capacit&eacute;s PDF de Scribus rendent possible la <strong>r&eacute;orientation</strong> des documents. Le m&ecirc;me document peut &ecirc;tre destin&eacute; &agrave; l'impression, au t&eacute;l&eacute;chargement sur Internet ou &agrave; une pr&eacute;sentation comme Star Office Impress ou MS Powerpoint. Il s'agit d'une tendance du monde de l'&eacute;dition qui se refl&egrave;te dans la strat&eacute;gie de Adobe InDesign 2.0+ ainsi que dans les nouvelles capacit&eacute;s PDF de QuarkXpress 6 et de Adobe Illustrator 10+. En PAO et en pr&eacute;presse, les am&eacute;liorations li&eacute;es au format PDF sont souvent l&agrave; pour repousser les limites respectives du HTML et du PostScript traditionnel.</p>
<p>Vous obtiendrez de meilleurs r&eacute;sultats au pr&eacute;visionnement et &agrave; l'impression avec la version la plus r&eacute;cente d'Acrobat Reader: 5.0.10 ou 7.0.1 pour Linux et 6.0+ pour toute autre plateforme, lorsque disponible. Veuillez noter &eacute;galement que <strong>gv et ses d&eacute;riv&eacute;s ne sont pas de bons visualiseurs</strong> pour les EPS ou les PDFs de Scribus. De la m&ecirc;me mani&egrave;re, Adobe Reader sous MacOSX sera pr&eacute;f&eacute;r&eacute; &agrave; l'applications de pr&eacute;visionnement inclus.</p>
<p>L'un des d&eacute;fis auxquels font face les visualiseurs PDF et EPS sur Linux est que Scribus cr&eacute;e des fichier PS niveau 3 et PDF 1.4 dont les fonctions vont bien au-del&agrave; des capacit&eacute;s de la plupart des visualiseurs en code source libre. Certaines de ces fonctions ne peuvent &ecirc;tre interpr&eacute;t&eacute;es que par des logiciels commerciaux de pr&eacute;-impression ou de PAO. De plus, aucun des visualiseurs open source n'est capable d'interpr&eacute;ter correctement le PDF avec gestion de couleur. Plus de deux ann&eacute;es de travail avec Scribus m'ont men&eacute; &agrave; la conclusion que pour les fichiers PS/EPS/PDF cr&eacute;&eacute;s par Scribus les trois visualiseurs suivants sont les plus fiables  :</p>
<ul>
<li><strong>Adobe Reader 5.0.8+ pour Linux</strong> - Le meilleur choix, sinon le seul, pour voir les fichiers PDF. Notes d&eacute;taill&eacute;es et conseils : <a href="toolbox1.html">Adobe Reader</a>.</li>
<li><strong>GSview 4.7+</strong> - avec la derni&egrave;re version de Ghostscript. Cette combinaison est la meilleure pour visionner les fichiers EPS, PS et la plupart des fichiers PDF. En plus, GSview offre plusieurs autres possibilit&eacute;s tr&egrave;s utiles avec des modules comme <code>pstoedit</code> et <code>epstool</code>. Pour plus de renseignements et des conseils : <a href="toolbox6.html">GSview</a>. Je le consid&egrave;re comme un outil essentiel pour la PAO sur Linux.</li>
<li><strong>Kpdf 3.4+</strong> - La mise &agrave; jour de ce visualiseur PDF comporte un nouveau moteur de rendu et est capable de visionner les fichiers PDF 1.5.</li>
</ul>
<p><strong>Si tout autre visualiseur PDF ou EPS de votre choix ne peut correctement montrer les fichiers PDF cr&eacute;&eacute;s par Scribus mais que ces fichiers PDF sont montr&eacute;s sans erreur dans Acrobat Reader, faites un rapport de bogue aupr&egrave;s de l'auteur du logiciel. Dans pratiquement tous les cas que j'ai test&eacute;s, c'est le visualiseur qui est en cause. Les fichiers PDF de Scribus sont test&eacute;s quotidiennement avec des logiciels de pr&eacute;-impression sp&eacute;cialis&eacute;s pour en confirmer la conformit&eacute; aux sp&eacute;cifications officielles du format PDF.</strong></p>
</body>
</html>
 
