<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>

		<title>Saveur PDFs</title>
</head>
<body>
<h2>Saveur PDF - lequel est meilleur pour vous ?</h2>

<p>La r&eacute;ponse &agrave; cette question soul&egrave;ve plusieurs discussions sur ce que sont les diff&eacute;rences de version. Un num&eacute;ro de version plus &eacute;lev&eacute; ne signifiepas un "meilleur" PDF et, dans certains cas, peut vous desservir.</p>
<h4>Quelle est la diff&eacute;rence entre les versions PDF 1.2 &agrave; PDF 1.6 ?</h4>
<p>Chaque version suit en gros une branche d'un lancement majeur d'Adobe Acrobat. En r&eacute;sum&eacute; :
</p>
<ul>
<li>PDF 1.2 = Acrobat 3.0 - relativement obsol&egrave;te maintenant
</li>
<li>PDF 1.3 = Acrobat 4.0 - La premi&egrave;re version de PDF qui avait vraiment toutes les caract&eacute;ristiques n&eacute;cessaires pour supporter les PDF "pr&ecirc;t &agrave; imprimer", incluant la gestion des couleurs, les profils ICC, etc. Elle a aussi apport&eacute; les capacit&eacute;s multim&eacute;dia interactives par le JavaScript. Ce standard est probablement le plus s&ucirc;r si vous n'&ecirc;tes pas certain des capacit&eacute;s dont dispose votre destinataire. PDF/X-3 et un nombre de processus d'impressions commerciales sont bas&eacute;s sur PDF 1.3.</li>
<li>PDF 1.4 = Acrobat 5.0 - actuellement introduit avec Illustrator 9. La principale diff&eacute;rence pour les utilisateurs Scribus sont les capacit&eacute;s de transparence et de transparence alpha. Cela constitue une diff&eacute;rence majeure sur l'endroit o&ugrave; un PDF avec ces caract&eacute;ristiques peut &ecirc;tre imprim&eacute;. Il faut disposer soit du dernier processeur RIP commercial ou de certaines imprimantes PostScript de niveau 3 pour les utiliser correctement. De plus,
toutes les imprimantes PostScript de niveau 3 ne g&egrave;rent pas la transparence. Les derni&egrave;res versions de Ghostscript supportent les caract&eacute;ristiques avanc&eacute;es de PDF 1.4 que Scribus peut cr&eacute;er en exportant en PDF. <strong>La plus remarquable des caract&eacute;ristiques de PDF 1.4 pour Scribus est la possibilit&eacute; d'exporter une vraie transparence en PDF. </strong>Note : souvent, la seule mani&egrave;re d'&ecirc;tre capable d'imprimer exactement les caract&eacute;ristiques de transparence vues &agrave; l'&eacute;cran est d'exporter en PDF 1.4 et d'imprimer &agrave; partir de Acrobat Reader 5.x ou plus r&eacute;cent. </li>
<li>PDF 1.5 = Acrobat 6.0 - parmi le plus int&eacute;ressant pour les utilisateurs Scribus : plusieurs am&eacute;liorations pour le PDF "pr&ecirc;t &agrave; imprimer", la capacit&eacute; d'avoir de vrais calques dans le PDF, la capacit&eacute; de validation PDF-X, plus de s&eacute;curit&eacute; et de caract&eacute;ristiques interactives, comme la capacit&eacute; d'ajouter des commentaires qui sont s&eacute;par&eacute;s du document original. Scribus peut supporter plusieurs caract&eacute;ristiques PDF 1.5 dans la version en d&eacute;veloppement 1.3.x. PDF 1.5 peut aussi supporter des options de compression plus sophestiqu&eacute;es pour les images utilisant JPEG 2000. </li>
<li>PDF 1.6 = Acrobat 7.0 - des raffinements des caract&eacute;ristiques de la version 1.5 et un usage plus intensif de PKI et de la signature digitale pour le contr&ocirc;le des documents ainsi qu'un syst&egrave;me de commentaires &eacute;tendu pour un groupe de collaboration. En ce qui concerne Scribus, il n'y a rien &agrave; signaler sauf la sortie d'Adobe Reader 7.0 pour Linux. </li>
</ul>
<p>Pour choisir la meilleure version &agrave; utiliser pour l'exportation, consid&eacute;rez ce qui suit : </p>
<ul>
<li><strong>O&ugrave; vais-je imprimer en bout de ligne ?</strong> - Si vous planifiez de faire imprimer commercialement vos fichiers, essayez toujours de demander &agrave; votre imprimeur d'abord.</li>
<li><strong>Est-ce que mon document utilise la transparence ?</strong> - Voir ci-dessus et assurez-vous que le reste de votre &eacute;quipement ou processus peut supporter PDF 1.4. </li>
<li><strong>J'exporte des formulaires PDF. Comment puis-je savoir si les utilisateurs de mon fichiers peuvent l'utiliser?</strong> - Savez-vous quelle version de Acrobat Reader vos utilisateurs poss&egrave;dent ? Le plus s&ucirc;r est d'utiliser PDF 1.3 ou 1.4.</li>
<li><strong>Est-ce que j'ai besoin de calques ?</strong> - Seul PDF 1.5 supporte les calques et uniquement dans la version 1.3.x de Scribus. Soyez conscient que le support pour PDF 1.5 n'est pas complet dans la plupart des visualiseurs open source. Ghostscript 8.5x supporte une partie, mais pas toutes les caract&eacute;ristiques de PDF 1.5. </li>
</ul>
<p></p>
<h4>Qu'en est-il des autres types de PDF sur lesquels j'ai pu lire, comme PDF-X et PDF-A ?</h4>
<p>PDF marqu&eacute;s d'une des mani&egrave;res suivantes : PDF/X-1:2001, X-1a:2001 et 2003; X-2:2003; X-3:2002 et 2003 sont tous des variations de PDF-X, qui est un moyen de cr&eacute;er un PDF avec certains crit&egrave;res pour la pr&eacute;-impression. Scribus supporte le dernier PDF-X-2:2003. Le support pour les autres versions de PDF/X est planifi&eacute;. </p>
<p>PDF-A est un standard ISO en cours d'&eacute;criture bas&eacute; sur PDF 1.4 pour la conservation &agrave; long terme des documents publics dans un format ouvert.</p>
</body>
</html> 