<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
		<title>Imprimeurs amis de Scribus</title>
</head>
<body>
	<h2>Imprimeurs amis de Scribus</h2>
	<p>Une fois que vous avez cr&eacute;&eacute; un chef-d'ouvre, l'&eacute;tape suivante consiste parfois dans l'impression commerciale de votre fichier.</p>
	<h4>Qu'est-ce qui d&eacute;finit un "imprimeur ami de Scribus" ?</h4>
	<p>Premi&egrave;rement, c'est la capacit&eacute; de manipuler les PDF directement, sans conversion vers d'autres formats. La conversion pour le placement dans d'autres applications de mise en page n'est <strong>pas</strong> recommand&eacute;e et peut alt&eacute;rer la qualit&eacute; d'impression. Id&eacute;alement, un imprimeur peut manipuler un fichier Scribus nativement, mais ce n'est pas essentiel. Le plus important, c'est de pouvoir manipuler correctement les nouvelles versions de PDF, sans autre forme de modification.</p>
	<p>La liste suivante n'est pas compl&egrave;te, mais certains imprimeurs ont particip&eacute; au d&eacute;veloppement de Scribus ou ont exprim&eacute; le d&eacute;sir de manipuler les fichiers Scribus nativement, ou en tant que PDF : </p>

	<h3>Am&eacute;rique du nord/Canada</h3>
	<p><a href="http://www.mardigrafe.com/index.html">Mardigrafe</a> bas&eacute;e &agrave; Montr&eacute;al - peut imprimer des travaux &agrave; partir des fichiers natifs de Scribus. Peut travailler avec des textes en anglias, fran&ccedil;ais, allemand, italien, russe et espagnol.</p>
	<h3>Am&eacute;rique du nord/&Eacute;.-U.</h3>
	<p><a href="http://ecape.com/mediakit/print_dsn_index.shtml">Cape Cod Ink</a> bas&eacute;e au Massachusetts. Peut r&eacute;pondre &agrave; une vaste gamme de besoins d'impression, y compris les petits travaux d'impression couleur. Peut travailler &agrave; partir des fichiers natifs de Scribus sur demande.</p>
	<h3>Europe/Allemagne</h3>
<p> <a href="http://digital-print-center.com/">Digital Print Center</a> bas&eacute;e &agrave; Konstanz - sp&eacute;cialiste de la copie num&eacute;rique et de la publication de base de donn&eacute;es. </p>
<p>Si vous connaissez des imprimeurs qui devraient &ecirc;tre ajout&eacute;s &agrave; cette liste, veuillez &eacute;crire &agrave; mrdocs (&agrave;) scribus.info.</p>
</body>
</html> 