<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Copyright de Scribus</title>
</head>
<body>
<p>Le copyright de Scribus 2001-2006 s'applique &agrave; Franz Schmid et au reste des membres de l'&eacute;quipe de Scribus.  L'"&eacute;quipe de Scribus" est compos&eacute;e des personnes suivantes : Franz Schmid, Peter Linnell, Paul Johnson, Craig Bradney, Petr Vanek, Riku Leino, Craig Ringer, Andreas Vox et Jean Ghali.</p>

<p>Ce programme est un logiciel libre; vous pouvez le redistribuer et/ou le modifier au titre des clauses de la Licence Publique G&eacute;n&eacute;rale GNU, publi&eacute;e par la Free Software Foundation; soit la version 2 de la Licence, ou (&agrave; votre discr&eacute;tion) une version ult&eacute;rieure quelconque.</p>

<p>Ce programme est distribu&eacute; dans l'espoir qu'il sera utile, mais SANS AUCUNE GARANTIE; sans m&ecirc;me une garantie implicite de COMMERCIABILIT&Eacute; ou DE CONFORMIT&Eacute; A UNE UTILISATION PARTICULI&Egrave;RE. Voir la Licence Publique G&eacute;n&eacute;rale GNU pour plus de d&eacute;tails. </p>

<p>Vous devriez avoir re&ccedil;u un exemplaire de la Licence Publique G&eacute;n&eacute;rale GNU avec ce programme; si ce n'est pas le cas, &eacute;crivez &agrave; la Free Software Foundation Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.</p>

<p>De plus, comme exception sp&eacute;ciale, les tenants du copyright list&eacute;s ci-dessus donnent la permission de lier le code de ce programme avec les librairies dynamiques commerciales Trolltech AS Qt3 (ou avec des versions modifi&eacute;es des librairies dynamiques commerciales Trolltech AS Qt3 qui utilisent la m&ecirc;me license que les librairies dynamiques commerciales Trolltech AS Qt3) et de distribuer des combinaisons li&eacute;es incluant les deux. Vous devez vous conformer &agrave; la GNU General Public License en tous points pour le code autre que les librairies dynamiques commerciales Trolltech AS Qt3. Si vous modifiez ce fichier, vous pouvez &eacute;tendre cette exception &agrave; votre version du fichier, mais vous n'&ecirc;tes pas tenu de le faire. Si vous choisissez de ne pas le faire, supprimez l'&eacute;nonc&eacute; de cette exception de votre version.</p>

<p>Antiword, qui est livr&eacute; avec la version Windows de Scribus est un programm&eacute; avec une license s&eacute;par&eacute;e sous GPL et le copyright de cette license est inclus avec le programme.</p>

<p>Les dictionnaires de c&eacute;sures sont couverts par leurs propres copyrights et licences. Ils sont inclus dans les fichiers de c&eacute;sure.</p>
</body>
</html> 