<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
	<title>Espaces ins&eacute;cables pour Scribus</title>
</head>
<body>
<h2>Espaces ins&eacute;cables pour Scribus</h2>

<h4>R&ocirc;le du module d'espaces ins&eacute;cables :</h4>
<p>la fonction Espaces ins&eacute;cables de Scribus est une extension sp&eacute;ciale permettant d'ajouter des espaces ins&eacute;cables avant ou apr&egrave;s les mots courts.</p>
<p>Ces mots courts sont propres &agrave; chaque typographie nationale; par exemple, suivant les standards typographiques tch&egrave;ques, polonais et slovaques, il n'est pas permis de laisser des conjonctions comprenant seulement une lettre en fin de ligne si celle-ci contient plus de 25 caract&egrave;res. Un probl&egrave;me courant survient avec les unit&eacute;s de poids et
mesures, o&ugrave;, pour des raisons &eacute;videntes, des espaces ins&eacute;cables
doivent &ecirc;tre ins&eacute;r&eacute;s entre les unit&eacute;s et les nombres qui les pr&eacute;c&egrave;dent. Finalement,
il existe un grand nombre de dipl&ocirc;mes universitaires, de grades militaires, etc. qui sont abr&eacute;g&eacute;s et ne
doivent pas &ecirc;tre s&eacute;par&eacute;s du nom de leurs titulaires. </p>
<p>M&ecirc;me si l'&eacute;quipe de Scribus ne peut se pencher
sur chacun des standards nationaux, Petr Van&#283;k, un des d&eacute;veloppeurs du coeur de
Scribus, a d&eacute;cid&eacute; de proposer aux utilisateurs
une extension qui permettra de personnaliser la typographie
en fonction de leurs besoins sp&eacute;cifiques.</p>

<h4>Mode de fonctionnement</h4>
<p>La copie d'&eacute;cran ci-dessous montre du texte contenant un mot court, avant l'insertion d'espaces ins&eacute;cables.</p>
<p><b>Exemple de texte avant d'ex&eacute;cuter Espaces ins&eacute;cables</b></p>
<table width="100%"><tr><td align="center"><img src="images/before_short_words.png" alt="Exemple de texte avant d'ex&eacute;cuter Espaces ins&eacute;cables"  title="Exemple de texte avant d'ex&eacute;cuter Espaces ins&eacute;cables" /></td></tr></table>

<p>Le m&ecirc;me texte apr&egrave;s l'application de la fonction. Le mot cercl&eacute; de rouge (Mr) est pass&eacute; &agrave; la ligne suivante, parce que l'espace normal entre Mr et Justice a &eacute;t&eacute; remplac&eacute; par un espace ins&eacute;cable.</p>
<p><b>Exemple de texte apr&egrave;s l'ex&eacute;cution de la fonction Espaces ins&eacute;cables</b></p>
<table width="100%"><tr><td align="center"><img src="images/after_short_words.png" alt="Exemple de texte apr&egrave;s l'ex&eacute;cution de la fonction Espaces ins&eacute;cables"  title="Exemple de texte apr&egrave;s l'ex&eacute;cution de la fonction Espaces ins&eacute;cables" /></td></tr></table>
<h4>Comment ex&eacute;cuter Espaces ins&eacute;cables</h4>
<p>Si vous avez install&eacute; cette extension avec succ&egrave;s, allez dans le menu <code>Extra</code> et choisissez l'option <code>Espaces ins&eacute;cables...</code>:</p>
<p><b>Appeler Espaces ins&eacute;cables pour Scribus</b></p>
<table width="100%"><tr><td align="center"><img src="images/swmenu.png" alt="Appeler Espaces ins&eacute;cables pour Scribus"  title="Appeler Espaces ins&eacute;cables pour Scribus" /></td></tr></table>

<p><b>Fen&ecirc;tre de dialogue Espaces ins&eacute;cables</b></p>
<center><img src="images/" alt="" /></center>
<table width="100%"><tr><td align="center"><img src="images/swdialog.png" alt="Fen&ecirc;tre de dialogue Espaces ins&eacute;cables"  title="Fen&ecirc;tre de dialogue Espaces ins&eacute;cables" /></td></tr></table>
<ul>
<li><strong>Cadres s&eacute;lectionn&eacute;s</strong> - applique les espaces ins&eacute;cables aux cadres de texte s&eacute;lectionn&eacute;s</li>
<li><strong>Page active</strong> - applique les espaces ins&eacute;cables &agrave; tous les cadres de la page courante.</li>
<li><strong>Tous les objets</strong> - applique les espaces ins&eacute;cables &agrave; tout le document.</li>
<li><strong>Remplace les valeurs par d&eacute;faut par la configuration utilisateur</strong> -  lorsque le fichier de configuration utilisateur existe, vous pouvez choisir si vous le d&eacute;sirez d'ajouter votre configuration &agrave; la configuration globale en d&eacute;cochant le bouton. Vous pouvez &eacute;galement remplacer les valeurs pr&eacute;d&eacute;finies par les votre en cochant le bouton.</li>
</ul>
<h4>Configuration</h4>
<p>La fonction Espaces ins&eacute;cables pour Scribus fournit un fichier de configuration au niveau syst&egrave;me <code>scribus-short-words.rc</code>, qui est habituellement plac&eacute; dans le r&eacute;pertoire <code>$prefix/lib/scribus/plugins</code> (le r&eacute;pertoire actuel d&eacute;pend de l'endroit o&ugrave; vous ou votre distribution a install&eacute; Scribus). Ce fichier de configuration est clair : essentiellement il contient une liste de mots courts pour une langue donn&eacute;e, pr&eacute;c&eacute;d&eacute;s ou suivis d'un espace et s&eacute;par&eacute;s par des virgules. La position de l'espace, plac&eacute; avant ou apr&egrave;s chaque mot court, indique &agrave; l'extension l'endroit d'insertion. Chaque ligne portant des param&egrave;tres de configuration doit commencer avec la langue &agrave; laquelle elle est destin&eacute;e, par exemple "en" pour anglais ou "cs" pour tch&egrave;que :
</p>
<pre>
#  English stuff START here
en=Dr. ,Dr ,Mr. ,Mr ,Mrs. ,Mrs ,Ms. ,Ms ,Prof. ,Prof ,Rev. ,Rev ,
en= Kg, kg, g, mg, oz, lb, cwt, km, Km, m, cm, mm,

#  Czech short words START here
## hanging conjunctions
cs=K ,k ,S ,s ,V ,v ,Z ,z ,O ,o ,U ,u ,I ,i ,A ,
## physics and math
cs= kg, g, m, cm, mm, l, hl, s, %,
</pre>
<p>Si vous voulez utiliser vos propres mots courts, par exemple pour une nouvelle langue, cr&eacute;ez votre propre fichier de configuration avec les mots &agrave; traiter, puis enregistrez le fichier sous <code>scribus-short-words.rc</code> dans le r&eacute;pertoire <code>~/.scribus</code>. <em>L'extension peut &ecirc;tre ajout&eacute;e &agrave; votre configuration dans le syst&egrave;me ou servir de remplacement, pour &ecirc;tre utilis&eacute;e en autonome.</em></p>

<h3 class="title">Important</h3>
<p>L'auteur souhaite &eacute;tendre le fichier de configurations global pour r&eacute;pondre &agrave; vos besoins. Informez-le des mots courts et des standards propres &agrave; votre langage.</p>

<h3 class="title">Copyright de la fonction Espaces ins&eacute;cables </h3>
<p>Espaces ins&eacute;cables pour Scribus Copyright 2003, 2004 Petr Van&#283;k, &lt;<a href="mailto:petr@yarpen.cz">petr@yarpen.cz</a>&gt;</p>
<p>Ce programme est un logiciel libre ; vous pouvez le redistribuer
et/ou le modifier au titre des clauses de la Licence Publique
G&eacute;n&eacute;rale GNU, publi&eacute;e par la Free Software Foundation;
soit la version 2 de la Licence, ou (&agrave; votre discr&eacute;tion) une version
ult&eacute;rieure quelconque.</p><p>Ce programme est distribu&eacute; dans l'espoir
qu'il sera utile, mais SANS AUCUNE GARANTIE; sans m&ecirc;me une garantie
implicite de COMMERCIABILIT&Eacute; ou DE CONFORMIT&Eacute; A UNE UTILISATION PARTICULI&Egrave;RE. Voir la Licence Publique G&eacute;n&eacute;rale GNU pour plus de d&eacute;tails. </p><p>Vous devriez avoir re&ccedil;u un exemplaire de la Licence Publique G&eacute;n&eacute;rale GNU
avec ce programme; si ce n'est pas le cas, &eacute;crivez &agrave; la Free Software Foundation Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.</p>
<p>Copyright &copy; 2004 Petr Van&#283;k, Maciej Hanski, sous la license opencontent.org incluse avec ces documents avec Elected Option IV</p></p>
</body>
</html> 