<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Sp&eacute;cifications de Scribus</title>
</head>
<body>
<h2>Sp&eacute;cifications de Scribus</h2>
<h3>R&eacute;sum&eacute; :</h3>
<p>Scribus est une application GPL de publication assist&eacute;e par ordinateur (PAO) similaire pour les environnements Linux et Unix. Son but est d'&ecirc;tre agr&eacute;able &agrave; l'utilisateur, tout en offrant des caract&eacute;ristiques professionnelles avanc&eacute;es.</p>
<h3>Caract&eacute;ristiques du document :</h3>
<ul>
	<li>Supporte le texte Unicode, incluant les langues qui s'&eacute;crivent de droite &agrave; gauche comme l'arabe et l'h&eacute;breu, gr&acirc;ce &agrave; freetype2.</li>
	<li>Cadres, visibles et invisibles, avec support pour bords arrondis et coins pour du texte et des objets, qui peuvent &ecirc;tre tourn&eacute;s et agrandis</li>
	<li>Mod&egrave;les de pages - les palettes de page permettent une gestion de page plus facile</li>
	<li>Calques pour tout le document - &eacute;ditable et les &eacute;l&eacute;ments peuvent &ecirc;tre d&eacute;plac&eacute;s</li>
	<li>Stlyes de paragraphe avec de nombreuses options de style de paragraphe et de texte (alignement, police)</li>
	<li>Espacement manuel des types et inclusion des polices permises dans tous les documents incluant des PDF.</li>
	<li>Liens d'objets, groupes, mouvements, verrouillage, redimensionnement et conversion en diff&eacute;rents types d'objets.</li>
	<li>Marges, guides et grille magn&eacute;tique qui peuvent &ecirc;tre d&eacute;finis par l'utilisateur, ainsi que la possibilit&eacute; de les rendre visibles ou invisibles.</li>
</ul>

<h3>Caract&eacute;ristiques professionnelles de publication :</h3>
<ul>
	<li>Couleurs CMJN incluant des aper&ccedil;us d'images g&eacute;r&eacute;s par profil couleur ICC et l'inclusion de profils ICC dans les documents PDF pour une correspondance entre la couleur &agrave; l'&eacute;cran et celle imprim&eacute;e. Scribus supporte la sp&eacute;cification propos&eacute;e openicc pour les profils.</li>
	<li>Cr&eacute;ation de s&eacute;parations PostScript couleur CMJN ou RGB.</li>
	<li>Cr&eacute;ation sophistiqu&eacute;e de PDF, incluant les formulaires interactifs PDF, le support pour presque tous les types de champs PDF et les actions JavaScript.</li>
	<li>La capacit&eacute; de produire des tirages avec des param&egrave;tres images de qualit&eacute; professionnelle, y compris sur les &eacute;quipements dot&eacute;s de PostScript &eacute;volu&eacute;, niveau 3/PDF 1.4.</li>
	<li>Importation PostScript encapsul&eacute;e avec aper&ccedil;us dans le canevas de la page / l'exportation EPS.</li>
	<li>Support pour les sorties PostScript niveau 2 et une tr&egrave;s grande partie du niveau 3; support pour les caract&eacute;ristiques PDF 1.4 incluant la transparence, les d&eacute;grad&eacute;s et la s&eacute;curit&eacute; 128 bits.</li>
	<li>Conformit&eacute; totale avec PDF/X-3, une norme ISO pour la cr&eacute;ation de PDF &#034;pr&ecirc;t &agrave; l'impression&#034; - un incontournable pour toute application de mise en page.</li>
	<li>Inclusion de polices et des sous-ensembles de polices en exportation PostScript et PDF.</li>
	<li>Scribus peut convertir toutes les polices support&eacute;es en contours PostScript, lesquels peuvent ensuite &ecirc;tre &eacute;dit&eacute;s dans l'application.</li>
</ul>

<h3>Caract&eacute;ristiques de facilit&eacute; d'utilisation :</h3>
<ul>
	<li>Glisser-d&eacute;poser avec KDE 3, incluant un album glisser-d&eacute;poser pour les &eacute;l&eacute;ments souvent utilis&eacute;s comme les blocs de textes, les images de logos, les fonds, etc.</li>
	<li>Navigateur d'aide en ligne contenant beaucoup de documentation &agrave; jour en anglais, ainsi que des fichiers d'exemple.</li>
	<li>Outils et palettes faciles &agrave; utiliser pour la mesure, la rotation et d'autres propri&eacute;t&eacute;s d'objets</li>
	<li>Support complet pour les polices TrueType, Type 1 PostScript et OpenType.</li>
	<li>Raccourcis clavier configurables par l'utilisateur.</li>
	<li>Possibilit&eacute; de dialogues ans 27 langues diff&eacute;rentes sans recompilation.</li>
	<li>Moteur de c&eacute;sure automatique &eacute;volu&eacute; supportant plusieurs langues.</li>
	<li>Outils de dessin pour tracer des formes personnalis&eacute;es facile &agrave; utiliser comme : lignes &agrave; main lev&eacute;e, lignes, courbes, ellipses, courbes de B&eacute;zier, polygones, etc.</li>
	<li>Pr&eacute;f&eacute;rences utilisateur d&eacute;taill&eacute;es et flexibles pour les param&egrave;tres par d&eacute;faut des documents et de l'application</li>
</ul>

<h3>Formats de fichier:</h3>
<ul>
	<li>EPS (Encapsulated PostScript), JPEG (Joint Photographic Experts Group), PNG (Portable Network Graphics), TIFF (Tag Image File Format), et XPM (XpixMap). Le support pour le format PSD inclut les calques et les chemins de coupure. Les TIFF  en 16 bits et le support pour le format PSD sont en cours de test.</li>
	<li>Le format natif de Scribus 1.2.x est parfaitement document&eacute; et est bas&eacute; sur XML. Le format courant 1.3.x est un format transitoire qui aura un DTD complet avant la prochaine version stable. </li>
	<li>Scribus peut &eacute;galement importer et exporter des SVG 1.0 (Scalable Vector Graphics) bien form&eacute;s, y compris du texte sur un chemin, des images et du texte. Scribus peut exporter toutes les caract&eacute;ristiques d'un document Scribus en tant que SVG. Les images sont converties en PNG lors de l'exportation en SVG.</li>
	<li>Scribus peut importer du texte dans plusieurs encodages diff&eacute;rents, incluant Unicode, et supporte aussi OpenOffice.org 1.x et les fichiers OASIS Open Document Writer et Draw. Les styles et le formatage sont pr&eacute;serv&eacute;s &agrave; l'importation. </li>
</ul>

<h3>Architecture:</h3>
<ul>
	<li>Scribus a &eacute;t&eacute; d&eacute;velopp&eacute; avec GPL QT 3 pour Linux et les syst&egrave;mes d'exploitation comme &#034;Unix&#034;. Il a &eacute;t&eacute; port&eacute; sur Fink et la version courante est disponible pour les applications X11 sous Mac OS X. Scribus 1.3.x est port&eacute; nativement sous Win32 et MacOSX.</li>
	<li>Support pour les extensions et les API, incluant l'importation et l'exportation d'extensions. </li>
	<li>Extension puissante de scriptage en Python permettant d'&eacute;tendre les fonctions de Scribus et d'automatiser des t&acirc;ches, mais aussi d'appeler des applications externes &agrave; partir de Scribus.</li>
</ul>
<h3>Exemples d'utilisation :</h3>
<ul>
	<li>Mises en page pour des journaux, des documents d'entreprise, des affiches, des manuels de formation, de la documentation technique, des cartes de visite et d'autres documents qui n&eacute;cessitent une mise en page flexible ou une manipulation d'image &eacute;volu&eacute;e, ainsi qu'un contr&ocirc;le typographique et un dimensionnement d'image indisponibles dans les traitements de texte courants.</li>
	<li>Les utilisateurs qui ont besoin de produire des tirages sur un &eacute;quipement de qualit&eacute; d'image professionnelle, ou encore d'adapter les documents pour impression interne pour les distribuer via le web en format PDF ou pour des pr&eacute;sentations.</li>
	<li>Les utilisateurs qui ont besoin de cr&eacute;er des formulaires PDF interactifs pour des pr&eacute;sentations et des inscriptions bas&eacute;es sur des cgi.</li>
</ul>
</body>
</html>
 
