<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Inkscape</title>
</head>
<body>
<h2>Inkscape</h2>
<p><em>Notice : J'appartiens &agrave; l'&eacute;quipe de d&eacute;veloppement de Inkscape, comme ressource technique, bien que mon r&ocirc;le consiste surtout &agrave; communiquer avec les autres membres et &agrave; constuire les progiciels RPM. Toutefois je n'en parlerais pas si a) Inkscape n'&eacute;tait pas une application si g&eacute;niale, promise &agrave; un bel avenir, et b) l'&eacute;quipe
Inkscape n'&eacute;tait pas aussi agr&eacute;able. Le d&eacute;veloppement de Inkscape est un excellent mod&egrave;le &agrave; suivre pour les d&eacute;veloppeurs OSS.</em></p>

<p>Cela dit, Inkscape est en voie de devenir le leader des logiciels OpenSource de dessin vectoriel ou d'outils d'&#034;illustration&#034;. L'&eacute;quipe d'Inkscape a fait de nombreux efforts pour adh&eacute;rer religieusement aux sp&eacute;cifications SVG du W3C. La derni&egrave;re version a fait de nombreux progr&egrave;s et propose de nouvelles options d'importation/exportation. Certaines plus exp&eacute;rimentales que d'autres. </p>

<p>En sa faveur : une interface tr&egrave;s agr&eacute;able, avec de nombreuses infobulles et deux tutoriels tr&egrave;s?bien faits sur le dessin vectoriel. Quasiment toutes les fonctions sont accessibles par des raccourcis clavier (la liste des raccourcis fait presque 10 pages). Comme celle de Scribus, l'&eacute;quipe d'Inkscape corrige tr&egrave;s rapidement les bogues et est tr&egrave;s ouverte aux suggestions et aux demandes d'am&eacute;lioration.</p>

<p>Le meilleur de Inkscape r&eacute;side dans sa fid&eacute;lit&eacute; envers les sp&eacute;cifications SVG. Non, il n'est pas parfait, aucune application ne l'est, d'ailleurs. Les fichiers SVG de Inkscape semble fonctionner correctement avec d'autres applications SVG, m&ecirc;me parfois mieux que ceux g&eacute;n&eacute;r&eacute;s par certaines applications commerciales co&ucirc;teuses. </p>

<p>Dans leur grande majorit&eacute;, les fichiers SVG de Inkscape sont import&eacute;s correctement dans Scribus. Il y a toutefois certaines fonctionnalit&eacute;s SVG qui ne sont pas encore support&eacute;es par Scribus (motifs), mais dans 99 % des cas, le r&eacute;sulat est gagnant. Si un fichier
n'est pas import&eacute; correctement dans Scribus, essayez de le sauvegarder en &#034;Plain SVG&#034; depuis Inkscape. Une autre chose &agrave; savoir pour travailler avec les fichiers SVG de Inkscape est que le mod&egrave;le de gestion de texte SVG est diff&eacute;rent du mod&egrave;le PDF/PostScript. (L'un des points les plus fragiles de la sp&eacute;cification, &agrave; mon sens).  Gardez le texte et les effets du texte pour Scribus. Celui-ci fait du bon boulot et offre une multitude d'effets de texte et les affichera/imprimera correctement. Scribus utilise les biblioth&egrave;ques freetype2 qui vous offre une large palette d'effets.</p>

<p>Cela ne veut pas dire que Inkscape ne le fait pas correctement. Simplement, que les modalit&eacute;s d'&eacute;change entre les applications SVG et PostScript sont parfois tr&egrave;s diff&eacute;rentes, et il devient donc difficile de faire des conversions. Inkscape poss&egrave;de un excellent support des fonctionnalit&eacute;s de texte SVG, y compris l'espacement et d'autres aspects &eacute;volu&eacute;s.</p>
</body>
</html>
 
