<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Autres visualiseurs PDF </title>
</head>
<body>
<h2>Autres visualiseurs PDF </h2>
<p>Un autre visualiseur PDF int&eacute;ressant est GSview, qui est une interface graphique de Ghostscript. La derni&egrave;re version (4.7) et Ghostscript 7.07+ fonctionnent tr&egrave;s bien conjointement et permettent entre autres de convertir du PS en PDF, et de visualiser les fichiers EPS, PS et PDF. La version 4.3 est la premi&egrave;re &agrave; fonctionner correctement sous Linux (GSView &eacute;tait &agrave; l'origine d&eacute;velopp&eacute; pour un autre syst&egrave;me d'exploitation). Pour plus de d&eacute;tails, lire la section <a href="gsview.html">GSview et Scribus</a>.</p>
<p><strong>Kpdf 3.4+ / Xpdf </strong> La version la plus r&eacute;cente de Kpdf dans KDE 3.4 me montre que les d&eacute;veloppeurs ont atteint leur objectif. Bas&eacute; sur Xpdf 3.x, il poss&egrave;de plusieurs bons points et semble afficher un rendu rapide. Je dis cela, non pas en tant que partisan de KDE, mais &agrave; titre d'utilisateur aguerri, qui a pr&eacute;f&eacute;r&eacute; cet outil aux puissants visionneurs d'Adobe. Un autre point, allez &agrave; l'&eacute;cran Settings et activez les options de performance, si vous avez la m&eacute;moire n&eacute;cessaire. Cela fait une grande diff&eacute;rence.  Vous pouvez toujours choisir Xpdf 3.00+ de Foolabs, qui fournit &eacute;galement des outils en ligne de commande pour la conversion PS vers PDF. Pour afficher les polices incorpor&eacute;es dans tous les documents PDF, (plut&ocirc;t que dans ls seuls documents cr&eacute;&eacute;s avec  Scribus), consultez la page du manuel de Xpdf pour configurer des chemins de recherche des polices dans le fichier .xpdfrc. Sinon,les polices incluses ne s'afficheront pas correctement. Une limitation connue de Xpdf est son inaptitude &agrave; afficher la transparence dans les fichiers PDF g&eacute;n&eacute;r&eacute;s par Scribus.</p>
<p>Pour go&ucirc;ter &agrave; quelques unes des fonctionnalit&eacute;s PDF de Scribus, jetez un coup d'oeil aux fichiers d'exemple situ&eacute;s dans le dossier "samples" dans le r&eacute;pertoire d'installation de Scribus. Maximisez la fen&ecirc;tre d'Acrobat Reader, ouvrez le fichier et suivez les instructions. Consid&eacute;rez ceci comme le premier "ouf de P&acirc;ques" de Scribus.;)</p>
</body>
</html>
 
