<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>GSview et Scribus</title>
</head>
<body>
<h2>GSview et Scribus</h2>
<p><strong>Certains passagees de cette section sont &agrave; mettre au cr&eacute;dit de Russell Lang, auteur et responsable de GSview, epstool et Ghostscript, dont lesconseils et r&eacute;ponses sur GSview et Ghostscript ont &eacute;t&eacute; pr&eacute;cieux. Cela a aid&eacute; l'&eacute;quipe Scribus &agrave; utiliser certaines fonctions avanc&eacute;es de Ghostscript, d'o&ugrave; l'am&eacute;lioration de certains composants de l'application. </strong></p>
<p>D'embl&eacute;e, je crois fermement que nous avons ici une <strong>solution sup&eacute;rieure &agrave; gv et &agrave; ses d&eacute;riv&eacute;s. De plus, pour visualiser des documents avant  l'impression, il s'agit du meilleur visualiseur PDF open source.</strong>  Bien que, d'apr&egrave;s mon exp&eacute;rience, Acrobat Reader&#174; soit parfois plus performant pour le visionnement PDF proprement dit, je consid&egrave;re Gsview comme l'un des outils indispensables &agrave; l'utilisateur de Scribus. GSview poss&egrave;de bon nombre de fonctions utiles. Pour ceux qui ne connaissent pas cet outil, il propose une &quot;interface graphique&quot; facile d'acc&egrave;s &agrave; Ghostscript, ainsi qu'&agrave;  <code>pstoedit</code>, outil de conversion de fichiers bitmap vers des fichiers vectoriels. Pour les habitu&eacute;s des mondes Windows ou Mac, il offre aussi les fonctionnalit&eacute;s d'Acrobat Distiller, &agrave; partir d'une interface graphique utile pour les applications n'exportant pas du PDF nativement.</p>
<p>Deuxi&egrave;mement, assurez-vous d'avoir la derni&egrave;re version 4.7+. (GSview est originaire du monde Windows, o&ugrave; il excelle depuis les versions 4.x)</p>
<p>Troisi&egrave;mement, pour que tout fonctionne correctement, le chemin d'acc&egrave;s des polices doit &ecirc;tre bien configur&eacute; dans les pr&eacute;f&eacute;rences de GSview. D'autres informations suivront &agrave; ce sujet.</p>
<p>Les fonctionnalit&eacute;s utiles de GSview pour Scribus sont :</p>
<ul>
	<li>Avec l'aide de <a href="http://pstoedit.net">pstoedit</a>, il est possible de convertir des images bitmap ou du contenu PDF vers SVG ou tout autre format vectoriel.</li>
	<li>La possibilit&eacute; de visualiser, de convertir et d'ajouter des aper&ccedil;us (format Tiff recommand&eacute;) dans les fichiers (PostScript Encapsul&eacute;). Ces manipulations peuvent &ecirc;tre effectu&eacute;es &agrave; l'aide de <a href="http://www.cs.wisc.edu/~ghost/gsview/epstool.htm">Epstool</a>, du m&ecirc;me auteur. Epstool peut aussi corriger les fichiers EPS qui comportent des d&eacute;limitations incorrectes ou manquantes. Il s'agit d'un outil s&eacute;par&eacute; qui doit &ecirc;tre install&eacute; et qui fonctionne en tant qu'extension, comme pstoedit.</li>
	<li>La possibilit&eacute; d'extraire du texte d'un fichier PDF.</li>
	<li>La possibilit&eacute; de visualiser et de convertir des fichiers PostScript, et d'y ajouter des aper&ccedil;us. &Agrave; cela s'ajoute une interface simple pour cr&eacute;er des fichiers PDF depuis des applications ne poss&eacute;dant pas les capacit&eacute;s d'exportation de haut niveau de Scribus. (Il est conseill&eacute; d'utiliser la fonction d'exportation de Scribus, car elle est optimis&eacute;e pour les fichiers de l'application.)</li>
	<li>Une interface facile d'acc&egrave;s &agrave; toutes les fonctionnalit&eacute;s obscures de Ghostscript, telles que la conversion d'image ou le r&eacute;-&eacute;chantillonnage. L'exemple ci-dessous utilise le &quot;p&eacute;riph&eacute;rique&quot; <strong>epswrite</strong>. Parmi les autres fonctionnalit&eacute;s de Ghostscript, mentionnons la conversion entre les formats TIFF, le changement de la profondeur de couleur d'un fichier TIFF ou JPEG, ou encore le changement d'espace de couleurs d'une image.</li>
</ul>
<p>Un exemple du fonctionnement conjoint de Gsview avec Scribus : la r&eacute;solution de probl&egrave;mes de fichiers EPS qui ne s'affichent pas correctement dans Scribus. Bien que de nombreuses applications savent g&eacute;n&eacute;rer des fichiers EPS, certaines ajoutent de petites subtilit&eacute;s de leur cru,
ce qui peut poser des probl&egrave;mes (dans Scribus, p. ex.).</p>
<p>Donc, si un fichier EPS ou PDF vous cause des soucis dans Scribus, ouvrez le fichier EPS dans GSview. Ensuite, appuyez sur la touche <strong>M</strong> pour afficher les messages de Ghostscript. Ces messages peuvent indiquer des probl&egrave;mes qui provoquentdes erreurs d'affichage ou d'impression. Vous pouvez &eacute;galement utiliser le &quot;p&eacute;riph&eacute;rique&quot; <strong>epswrite</strong> afin de r&eacute;&eacute;crire le fichier EPS, ce qui peut permettre de supprimer ou de corriger le fichier.</p>
<p>Vous pouvez aussi <em>rast&eacute;riser</em> l'image EPS en la convertissant en PNG ou TIFF, puis en modifier la taille, ajuster ses couleurs, etc. avec un logiciel tel que GIMP ou Photoshop. J'ai d&eacute;j&agrave; eu recours &agrave; ce proc&eacute;d&eacute;, en convertissant le fichier EPSen fichier PNG &agrave; 600 ppp. Il s'est ensuite affich&eacute; et imprim&eacute; parfaitement dans Scribus. En imagerie ou en PAO, certaines t&acirc;ches peuvent &ecirc;tre r&eacute;alis&eacute;es de plusieurs fa&ccedil;ons - dans mon cas, il s'agissait d'un fichier EPS issu d'Illustrator, trop complexe pour &ecirc;tre affich&eacute; et imprim&eacute; correctement sous Scribus. Toutefois, il ne s'agit pas d'un bogue de Scribus, mais plut&ocirc;t d'informations PostScript non standard dans le fichier, que j'ai &eacute;t&eacute; capable de supprimer avec Ghostscript par l'interm&eacute;diaire de GSview, pour obtenir un fichier parfaitement affichable. </p>
<p> Note : GSview exige la biblioth&egrave;que partag&eacute;e <code>libgs.so</code> pour acc&eacute;der aux fonctions de Ghostscript. Certaines distributions ne contiennent pas ce module, donc les conseils de compilation de Ghostscript avec une installation parall&egrave;le s'appliquent vraiment ici. </p>
<h4>Pour obtenir Gsview :</h4>
<p>Certaines distributions n'offrent pas GSview. Cependant, pour les syst&egrave;mes bas&eacute;s rpm, une simple commande rpm permet une installation facile. Le tarball GSview poss&egrave;de d&eacute;j&agrave; un fichier de sp&eacute;cifications. Il suffit de taper : </p>
<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>
rpmbuild -tb ./gsview-4.7.tar.gz
</pre></td></tr></table></blockquote>
<p>pour d&eacute;marrer. La version Windows est dot&eacute;e d'un installateur traditionnel setup.exe. Malheureusement, l'outil n'est pas encore disponible sous MacOSX. </p>
<p>Depuis sa version 4.3, GSview s'est av&eacute;r&eacute; le plus fiable et polyvalent des visionneurs PDF sous Linux, aux c&ocirc;t&eacute;s de Acrobat Reader. Pour la PAO avec Scribus, je le consid&egrave;re comme essentiel.</p>
<p>Maintenant, pour des conseils experts sur GSview et Ghostscript, reportez-vous &agrave; : <a href="toolbox7.html">Utilisation avanc&eacute;e de GhostScript et GSView</a>. Pour apprendre &agrave; configurer Ghostscript de fa&ccedil;on &agrave; mieux rep&eacute;rer toutes vos polices, reportez-vous &agrave; : <a href="gsfont.html">Polices Ghostscript</a>.</p>
</body>
</html>
 
