<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Drucken unter Linux - mit CUPS, Gimp-Print und Scribus</title>
</head>
<body>
<h2>Drucken unter Linux - mit CUPS, Gimp-Print und Scribus</h2>
<p>CUPS, GIMP-Print und Scribus gemeinsam erm&ouml;glichen unter Linux ein ausgezeichnetes Druckergebnis, soweit sie richtig installiert und konfiguriert sind. Scribus gibt Ihnen sogar die M&ouml;glichkeit, CUPS direkt aus dem Programm heraus &quot;anzusteuern&quot;.</p>
<p>Vergewissern Sie sich zun&auml;chst, da&szlig; die richtigen Entwicklerbibliotheken von CUPS installiert sind, bevor Sie Scribus kompilieren. Bei Redhat hei&szlig;en diese zum Beispiel &quot;cups-devel&quot;. N&auml;here Einzelheiten finden Sie in der Datei BUILDING inklusive Quelltext.</p>
<p>Daneben gibt es f&uuml;r viele Linux-Distributionen optionale Gimp-Print-Treiber. Diese Treiber sind nicht allein f&uuml;r Gimp bestimmt, sondern k&ouml;nnen von beliebigen Programmen genutzt werden, um eine genauere Drucksteuerung und in manchen F&auml;llen deutlich bessere Ergebnisse beim Fotodruck zu erzielen. Oft ist es so, da&szlig; Tintenstrahldrucker unter Linux gleich von mehr als einem Treiber unterst&uuml;tzt werden - typischerweise von einem IJS-Treiber und Gimp-Print. Der Unterschied liegt meist in einigen zus&auml;tzlichen Optionen - oft zulasten der Druckgeschwindigkeit. Die n&auml;chste Version der Gimp-Print-Treiber wird &uuml;brigens unter dem Namen Gutenprint erscheinen, um Verwechselungen vorzubeugen.</p>
<p>Das CUPS-Bedienfeld in Scribus mit dem regul&auml;ren IJS-Modul plus Ghostscript-Treiber:</p>
<table width="100%"><tr><td align="center"><img align="center" alt="Cups Control Panel in Scribus" src="../en/images/cups1.png" /></td></tr></table>
<h3>Tipps:</h3>
<ul>
<li>CUPS besitzt ein separates Gimp-Print-Plugin, mit dem sich die Druckausgabe von Scribus mit jedem GIMP-Print-Treiber f&uuml;r farbige Dokumente verbessern l&auml;&szlig;t, insbesondere wenn diese viele Bilder enthalten.</li>
<li><strong>cups-calibrate</strong> ist ein Programm, das Sie als &quot;root&quot; per Befehlszeile bedienen, um Ihren Drucker zu kalibrieren. Das funktioniert ausschlie&szlig;lich mit Gimp-Print-Treibern - nicht mit anderen CUPS-Treibern. Dieses Verfahren arbeitet schrittweise und ist manchmal in der Lage, die Sch&auml;rfe Ihrer Ausdrucke zu verbessern.</li>
<li>F&uuml;r CUPS gibt es auch ein  Befehlszeilen-Hilfsprogramm namens <strong>escputil</strong>, mit dem sich Druckkopf und Tintenvorrat von Epson-Ger&auml;ten &uuml;berpr&uuml;fen lassen. Wenn Sie KDE installiert haben, k&ouml;nnen Sie &uuml;ber dessen Druckmanager darauf zugreifen. Andernfalls tippen Sie einfach <strong>escputil -help</strong> ein, um die Optionen zu sehen.</li>
<li>Um lokal installierte CUPS-Drucker einzurichten und zu konfigurieren, sind bez&uuml;glich CUPS zwei Vorgehenweisen zu empfehlen: 1. Geben Sie <code>http://localhost:631</code> ein, wenn die Online-Benutzeroberfl&auml;che von CUPS eingesetzt werden soll. 2. Verwenden Sie den Druckmanager von KDE; er ist die einzige Option, die Ihnen vollen Zugriff auf alle Funktionen von CUPS erlaubt.</li>
</ul>
<p>Die Abbildung unten zeigt den Unterschied bei installiertem GIMP-Print-Plugin.</p>
<table width="100%"><tr><td align="center"><img align="center" alt="Cups Control Panel in Scribus With Gimp-Print" src="../en/images/cups2.png" /></td></tr></table>
<p>Der Hauptunterschied liegt darin, da&szlig; GIMP-Print &uuml;ber differenziertere Einstellungen zur Farbdichte verf&uuml;gt. Nicht selten ist er langsamer als andere Treiber, doch wichtiger ist die Qualit&auml;t der Ausgabe. Sie k&ouml;nnen auch KPrinter einsetzen, kombiniert mit anderen Programmen, die ohne CUPS arbeiten - und dennoch zu einer hohen Druckqualit&auml;t gelangen. So verf&uuml;gt etwa der Acrobat Reader (der erst seit Linux-Version 7.0.5 CUPS erkennt) &uuml;ber ein Befehlszeilenfenster, in dem sich KPrinter aufrufen l&auml;&szlig;t. Auf diese Weise k&ouml;nnen Sie - wenn alle Einstellungen korrekt sind - PDF-Dokumente mit hoher Aufl&ouml;sung drucken, die an Qualit&auml;t Scribus gleichkommen. </p>
<p>Bez&uuml;glich CUPS m&ouml;chte ich Ihnen empfehlen, sich erst einen Drucker f&uuml;r den Alltagsgebrauch mit dem IJS- oder einem normalen KPrinter-Treiber einzurichten und dann eine zweite Druckerinstanz mit GIMP-Print hinzuzuf&uuml;gen, damit Sie eine schnellere Ausgabem&ouml;glichkeit f&uuml;r allt&auml;gliche Drucksachen wie Texte usw. haben.</p>
<h3>PostScript-Drucker und CUPS</h3>
<p>Hier sind meine Erfahrungen, die ich mit einigen &quot;echten&quot; PostScript-Druckern unter Scribus gemacht habe:</p>

<p>Wenn Sie einen echten PostScript-Drucker unter Linux verwenden, insbesondere wenn es ein komplexeres Ger&auml;t mit mehreren Papierf&auml;chern ist, mit Sortierfunktion oder Feineinstellungen f&uuml;r die Grafik und Druckaufl&ouml;sung, dann haben Sie idealerweise die PPD-Datei von der Treiber-CD Ihres Druckers. Ist das nicht der Fall, dann versuchen Sie eine aktuelle Version von der Webseite des Herstellers herunterzuladen. Benutzen Sie anschlie&szlig;end das Hilfsprogramm <strong>cupstestppd</strong>, um die Datei zu &uuml;berpr&uuml;fen. Dies ist ein sehr wichtiger Schritt. </p>

<p>Ein gro&szlig;er Teil der Druckertreiber werden als ausf&uuml;hrbare Windows-Programme (*.exe) geliefert. Bekanntlich sind viele dieser von HP nichts weiter als selbstextrahierende WinZip-Dateien. Jede aktuellere WINE-version kann sie leicht &ouml;ffnen. Danach sollten Sie die Datei auf jeden Fall mit &quot;cupstestppd&quot; pr&uuml;fen, um sicherzugehen, da&szlig; sie der PPD-Spezifikation entspricht. Sollten dabei Fehler auftreten, und kleinere gibt es &ouml;fter, finden Sie hier die aktuelle Spezifikation:</p>

<a href="http://partners.adobe.com/public/developer/ps/index_specs.html">http://partners.adobe.com/public/developer/ps/index_specs.html</a>

<p><strong>cupstestppd</strong> ist ein Befehlszeilen-Hilfsprogramm, das sich ganz einfach einsetzen l&auml;&szlig;t, um die Korrektheit von PPD-Dateien zu &uuml;berpr&uuml;fen. Was ist eine PPD-Datei? Eine PPD-Datei ist eine speziell formatierte Textdatei, mit der Sie unter Linux, MacOSX und Windows einen echten PostScript-Drucker installieren k&ouml;nnen. Unter Linux wird sie in Kombination mit foomatic und CUPS f&uuml;r <strong>alle</strong> Drucker eingesetzt, um s&auml;mtliche F&auml;higkeiten des jeweiligen Druckers anzuzeigen. Das Befehlszeilenprogramm &uuml;berpr&uuml;ft, ob die Datei den Spezifikationen f&uuml;r PPD-Dateien entspricht. Bei Problemen gibt sie Hinweise, wie sich diese l&ouml;sen lassen. Am effektivsten ist &quot;cupstestppd&quot;, wenn die PPD-Datei des Ger&auml;teherstellers unter Linux verwendet wird. </p>
</body>
</html>