<qt>
<title>Tips zu Ghostscript-Schriftarten</title>
<h2>Tips zu Ghostscript-Schriftarten</h2>

<em>Diese Anmerkungen verdanken wir Craig Ringer und Russell Lang, dem Programmierer von GSview.</em>

<p>Wenn Ghostscript eine Datei nicht rendern/importieren/konvertieren kann, liegt eine der h&auml;ufigsten Ursachen darin, da&szlig; Ghostscript die Schriftarten nicht findet, die zur Darstellung von EPS bzw. PS n&ouml;tig sind. Dies ist weder eine Schw&auml;che noch ein Fehler von Ghostscript, denn <strong>alle</strong> EPS/PS-Interpreter m&uuml;ssen auf die richtigen Schriftarten zugreifen k&ouml;nnen, die PostScript ihnen vorgibt.  Genau das kann sicher auch der Fall sein, wenn Sie versuchen EPS/PS-Dateien nach Scribus zu importieren. Einige Anwendungen betten die Schriftarten nicht korrekt ein, weshalb diese dann extern bereitgestellt werden m&uuml;ssen. </p>

<p>Wenn Ghostcript eine Schriftart nicht finden kann, erscheint in der Konsole gew&ouml;hnlich eine Fehlermeldung wie:</p>

<pre>
  gs -h
  AFPL Ghostscript 8.50 (2004-12-10)
  Copyright (C) 2004 artofcode LLC, Benicia, CA.  All rights reserved.
blah blah bah...

invalidfont
Current allocation mode is local
Last OS error: No such file or directory
und so weiter...
</pre>

<p>Der Fehler <strong>invalidfont</strong> bedeutet, da&szlig; a) Ghostscript die Schriftart(en) nicht finden kann, da&szlig; b) Ghostscript <strong>keinerlei</strong> Schriftarten finden kann, oder da&szlig; c) eine Schriftart im System besch&auml;digt oder verst&uuml;mmelt ist.</p>

<p>Die L&ouml;sung:</p>

<h4>Erzeugen einer Fontmap-Datei </h4>

In der GS-Quelldistribution verbirgt sich ein geheimes Juwel: <pre>$GS_SRC_DIR/toolbin/genfontmap.ps</pre> Dieses kann benutzt werden, um eine Fontmap-Datei zu erstellen &ndash; dasselbe machen &uuml;brigens jene furchterregenden Perl-Skripte, die im Internet zu finden sind. Diese Ghostscript-Datei mu&szlig; sich nicht automatisch in Ihrer Distribution befinden, weshalb wir uns hier auf das noch gepackte tar-Quellvereichnis (f&uuml;r eine parallele GS-Installation) beziehen. Benutzen Sie m&ouml;glichst ein <em>genfontmap.ps</em> der von Ihnen verwendeten Ghostscript-Version. Andere funktionieren m&ouml;glicherweise nicht korrekt. Dies ist ein weiterer guter Grund, weshalb Sie sich eine neuere Version von Ghostscript beschaffen sollten.

<pre>
  
  d$ gs -q -sFONTPATH=/usr/local/share/fonts/TrueType ${HOME}/build/ghostscript-8.31/toolbin/genfontmap.ps
  
  % This Fontmap generated by genfontmap.ps
  
  (AndaleMono)    (/usr/local/share/fonts/TrueType/AndaleMo.TTF) ;
  (Arial-Black)   (/usr/local/share/fonts/TrueType/AriBlk.TTF) ;
  (Arial-BoldItalicMT)    (/usr/local/share/fonts/TrueType/Arialbi.TTF) ;
  (Arial-BoldMT)  (/usr/local/share/fonts/TrueType/Arialbd.TTF) ;
  ... bla bla bla ...
  (Utopia-Regular)        (putr.pfa) ;
  (Verdana)       (/usr/local/share/fonts/TrueType/Verdana.TTF) ;
  (Verdana-Bold)  (/usr/local/share/fonts/TrueType/Verdanab.TTF) ;
  (Verdana-BoldItalic)    (/usr/local/share/fonts/TrueType/Verdanaz.TTF) ;
  (Verdana-Italic)        (/usr/local/share/fonts/TrueType/Verdanai.TTF) ;
  (Webdings)      (/usr/local/share/fonts/TrueType/Webdings.TTF) ;
  (ZapfChancery-MediumItalic)     /URWChanceryL-MediItal ;
  (ZapfDingbats)  /Dingbats ;
  
  genfontmap completed OK. 42 new fonts added.
  
</pre>

<p>Sie leiten also die Standardausgabe um oder &uuml;bertragen (mittels kopieren/einf&uuml;gen) alles aus der <code>% This Fontmap..</code>-Zeile in einen Texteditor, um die Fontmap zu speichern. Kopieren die erstellte FontMap-Datei ins Schriftarten-Verzeichnis und f&uuml;gen das Verzeichnis dann Ihrer GS_LIB-Umgebungsvariablen hinzu:</p>

<p>Die genaue Pfadbezeichnung kann variieren.</p>

<pre>
  $ gs -q -sFONTPATH=/usr/local/share/fonts/TrueType ${HOME}/build/ghostscript-8.50/toolbin/genfontmap.ps &gt; /tmp/Fontmap
  $ sudo cp /tmp/Fontmap /usr/local/share/fonts/Truetype
  $ export GS_LIB=/usr/local/share/fonts/TrueType:$GS_LIB
  
</pre>

<p>Nun k&ouml;nnen Sie Scribus von der Konsole aus starten. GhostScript wird die Schriftarten finden und die EPS/PS-Dateien problemlos importieren.</p>

<p>Alternativ k&ouml;nnen Sie Ihre GS-lib/Fontmap editieren und die neue Fontmap als Quelle eintragen &ndash; oder Sie h&auml;ngen die neuen Fontmap-Eintr&auml;ge an Ihre bestehende lib/Fontmap an.</p>

<h4>TrueType-Schriften nach dem Anlegen neuer Benutzer</h4>

<p>Obwohl sich die Ghostscript-Dokumentation gr&ouml;&szlig;te M&uuml;he gibt, einen anderen Anschein zu erwecken, werden TrueType-Schriften von Ghostscript gut unterst&uuml;tzt und sind einfach zu verwenden.</p>

<p>Ganz wichtig ist hierbei, da&szlig; die Verzeichnisse, die in der GS_FONTPATH-Umgebungsvariablen und im -sFONTPATH-Argument stehen, alle Schriftart-Typen enthalten d&uuml;rfen, die unterst&uuml;tzt werden &ndash; und nicht allein PostScript-Schriftarten, wie es die Dokumentation darstellt.</p>

<pre>$ export GS_FONTPATH=$MY_FONT_DIR:$HOME/.fonts
$ scribus</pre>

<h4>Ghostscript-Schriftarten und EPS-Import</h4>

<p>Der EPS-Import in Scribus ist verkn&uuml;pft mit dem Schriftarten-Pfad von Ghostscript. Wenn GS die Schriftarten nicht findet, so werden sie kommentarlos ersetzt. Wenn Sie das nicht m&ouml;chten, sorgen Sie also unbedingt daf&uuml;r, da&szlig; GS diese finden kann.</p>

<p>Es ist zu empfehlen, da&szlig; Sie f&uuml;r Ihre Schriftarten-Verzeichnisse Fontmap-Dateien erstellen und diese der GS_LIB-Umgebungsvariablen hinzuf&uuml;gen, denn hierdurch kann GS seine Schriftarten k&uuml;nftig schneller laden. Tests haben best&auml;tigt, da&szlig; &ndash; sobald GS informiert ist, wo sich die Schriftarten befinden &ndash; der EPS-Import in Scribus munter auf lokale Schriftarten zugreift, um dort eine passende zu finden, die von EPS gew&uuml;nscht, jedoch nicht eingebettet wurde.</p>
