<qt>
<title>Vektorisierungswerkzeuge zum Unwandeln von Bitmapgrafiken in Kurven</title>
<h2>Vektorisierungswerkzeuge zum Unwandeln von Bitmapgrafiken in Kurven</h2>

<p>Die unten genannten Programme geh&ouml;ren zur Kategorie der Vektorisierungs- oder "Tracing"-Werkzeuge. Wenn Sie h&auml;ufig mit eingescannten Bildern arbeiten, empfehle ich ihnen, alle zu verwenden. Sie haben einige gemeinsame Funktionen, indem sie Bitmapgrafiken &ouml;ffnen und sie in Vektordaten umwandeln k&ouml;nnen. Dies kann etwa w&uuml;nschenswert sein, wenn Zeichnungen oder Gem&auml;lde mit gro&szlig;er Genauigkeit wiedergegeben werden sollen. Ich empfehle alle Programme, weil sie unterschiedliche Algorithmen zur Umwandlung verwenden.</p> 

<p><strong>Autotrace/FrontLine:</strong> Kann ImageMagick zum Umwandeln in verschiedene Formate verwenden. Frontline ist eine grafische Benutzeroberfl&auml;che, die GTK verwendet, um die zahlreichen Kommandozeilenoptionen zug&auml;nglich zu machen.</p>

<p><strong>Delineate:</strong> Eine auf Java basierende Benutzeroberfl&auml;che f&uuml;r Autotrace und Potrace. Erfreulicherweise kann es direkt nach SVG umwandeln.</p>

<p><strong>Potrace:</strong> Arbeitet nur in schwarzwei&szlig;, aber es verf&uuml;gt &uuml;ber eine sehr gute Vektorisierungsroutine. F&uuml;r Potrace gibt es eine grafische Benutzeroberfl&auml;che, die Qt3 verwendet.</p>

<p><strong>Pstoedit:</strong> Unterscheident sich geringf&uuml;gig von den &uuml;brigen Programmen, da es auf die Umwandlung von Postscript in Vektordaten spezialisiert ist. Es ist ein Plug-in f&uuml;r GSview. </p>

<p><strong>Inkscape:</strong> Verwendet Potrace, um Bitmaps zu vektorisieren. Es erm&ouml;glicht Umwandlungen in Schwarzwei&szlig; und Farbe und verf&uuml;gt &uuml;ber eine Vorschau. In aktuellen Entwicklerversionen ist ein "Farbeimer"-F&uuml;llwerkzeug enthalten, das vielf&auml;ltige M&ouml;glichkeiten zum interaktiven Vektorisieren ausgew&auml;hlter Bildbereiche bietet. Diese Funktion wird Bestandteil von Version 0.46 sein.</p>

<p>Wenn Sie Bilder vektorisieren, sollten Sie bedenken, da&szlig; es viele Optionen gibt, dies zu tun. Daher m&uuml;ssen Sie manchmal ein wenig experimentieren, besonders wenn die Vorlage komplex ist. Erwarten Sie keine perfekten Ergebnisse. Als ich es das erste Mal probiert habe, mu&szlig;te ich ein bi&szlig;chen t&uuml;fteln, um ein Scribus-Logo, das als EPS-Datei mit einer eingebettetem Bitmapdatei vorlag, in eine reine SVG-Grafik f&uuml;r den Import in Scribus umzuwandeln.</p>
</qt>
