<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Importare contenuto in Scribus</title>
</head>
<body>
<h2>Importare contenuto in Scribus</h2>
<p>Come avete <a href="about2.html">imparato</a>, il desktop publishing consiste nell'assemblare dei contenuti dando loro un aspetto gradevole. Quindi, <b>importare i contenuti</b> &egrave; una parte importante dell'organizzazione del lavoro. L'obiettivo di questo capitolo &egrave; di aiutarvi a inserire contenuti esterni nel vostro documento nel modo pi&ugrave; efficiente, e inoltre di aiutarvi ad evitare errori, sia da parte vostra sia da parte dei vostri collaboratori.</p>
<p>Se create un nuovo documento vuoto, e tentate di usare il comando <i>File &gt; Importa</i>, probabilmente otterrete risultati deludenti, a meno che non abbiate gi&agrave; imparato che, in generale, un dato contenuto pu&ograve; essere importato solo in una <a href="WwFrames.html">cornice</a>, e la sola eccezione a questa regola generale sono i <a href="importhints2.html">disegni vettoriali</a>:</p>

<table width="100%"><tr><td align="center"><img src="images/fileimport.png" alt="Importazione di file" title="Importazione di file"/></td></tr></table>
<p>Inizieremo con suggerimenti sull'importazione di immagini bitmap, continueremo con quella di disegni vettoriali e finiremo con l'importazione di testo, anche se vi sono alcune sovrapposizioni tra le tre categorie.</p>

<h3>Immagini bitmap e vettoriali</h3>
<p>Uno dei concetti che dovete conoscere quando lavorate con Scribus &egrave; la differenza tra un'immagine bitmap e una vettoriale. Un'immagine bitmap consiste di un numero prefissato di punti colorati (detti pixel). Questo significa (tra l'altro) che un'immagine di questo tipo ha una certa risoluzione, cio&egrave; un certo numero di punti contenuti in una'area bidimensionale (un quadrato). Di conseguenza, la risoluzione di un'immagine bitmap ha una grande influenza sulla qualit&agrave; con cui &egrave; riprodotta su diversi mezzi o supporti, poich&eacute; pi&ugrave; grande &egrave; l'area su cui &egrave; visualizzata, pi&ugrave; grandi sono i punti che la compongono e peggiore &egrave; il risultato. Quindi la risoluzione dell'immagine &egrave; una delle cose di cui dovete tener conto quando create file destinati alla stampa commerciale.</p>
<p>Le immagini vettoriali, invece, utilizzano formule matematiche (geometriche) per descrivere il contenuto in termini di linee e curve, il che significa che le immagini di questo tipo (che d'ora in poi chiameremo &ldquo;disegni vettoriali&rdquo; o semplicemente &ldquo;disegni&rdquo;) possono essere ingrandite quasi illimitatamente senza perdere qualit&agrave;. Ma bisogna precisare che esistono parecchi modi per descrivere le immagini con metodi geometrici, e non tutti sono equivalenti. In generale, i disegni <a href="importhints1.html">basati sul formato PostScript</a> (EPS, AI) offrono il modello vettoriale pi&ugrave; sofisticato, con qualit&agrave; superiore persino su supporti di dimensioni paragonabili a quelle di un intero edificio. Questo vale anche per i <a href="fonts2.html">caratteri PostScript</a>, compresi i caratteri OpenType. Di qualit&agrave; lievemente inferiore sono i disegni <a href="scribus-svg.html">SVG</a>, e la differenza tra PostScript o SVG e formati come WMF, ODG o PICT &egrave; ancora maggiore. In molti casi, tuttavia, queste differenze di qualit&agrave; sono irrilevanti, poich&eacute; possono essere percepite soltanto a livelli d'ingrandimento molto alti.</p>
<table width="100%"><tr><td align="center"><img src="images/vector-clipart.png"></td></tr>
<tr><td align="center"><img src="images/vector-advanced.png"></td></tr> <tr><td align="center"><i>Differenze di qualit&agrave; tra formati di clipart (in alto: WMF e ODG) <br>e formati vettoriali pi&ugrave; avanzati (in basso: SVG ed EPS),<br> visualizzati in Scribus a un livello di ingrandimento del 3000&nbsp;%</i></td></tr></table>
<p>Se la differenza tra immagini vettoriali e bitmap non vi &egrave; ancora chiara, c'&egrave; un esempio che potete creare voi stessi. Andate su: <a href="http://www.isc.tamu.edu/~lewing/linux">http://www.isc.tamu.edu/~lewing/linux</a>, prelevate il file PostScript che vi trovate, che &egrave; una versione EPS di Tux, e poi fate clic col tasto destro su una delle GIF e scaricatela. Le dimensioni dei due file sono circa le stesse. In Scribus, create un documento di due pagine; inserite la GIF in una pagina e l'EPS nell'altra, ed esportate il documento in un file PDF. Aprite questo  PDF in Adobe Reader, ingrandite al 200&ndash;400&nbsp;%: ora dovreste vedere la differenza&nbsp;&hellip;</p>
</body>
</html>
