<html>
<head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
        <title>IRC di Scribus</title>
</head>
<body>
<h2>IRC di Scribus</h2>

Per entrare nel canale IRC di Scribus (link cliccabile): <a href="irc://irc.freenode.net/#scribus">irc://irc.freenode.net/#scribus</a>

<h4>Alcuni consigli</h4>
<p>La comunit&agrave; di Scribus ha una presenza online in &ldquo;tempo reale&rdquo;: IRC o Internet Relay Chat. Per alcuni utenti questo potrebbe essere un mezzo poco familiare per ottenere assistenza, ma secondo noi funziona veramente bene. Di solito &egrave; presente almeno un membro del team di Scribus o un utente esperto. L'orario migliore per servirsi di IRC &egrave; l'ora dell'Europa centrale, e soprattutto la sera il canale di Scribus tende ad essere pi&ugrave; frequentato. IRC &egrave; a volte considerato un luogo di discussioni accese e persino di insulti e scortesie, ma #scribus (il simbolo &lsquo;#&rsquo; indica il nome del canale) ha un ambiente piacevole e amichevole. Scambi di insulti e provocazioni non sono tollerati in #scribus. Ecco una buona introduzione (in inglese) su come comportarsi: <a href="http://blog.fnmueller.de/2008/02/23/rules-of-engagement-the-ten-commandments-of-irc">Rules of Engagement - The ten commandments of IRC</a>; ed eccone una in italiano: <a href="http://www.irchelp.it/?modulo=policies&sez=netiquette">IRCHelp.it: Policies - Netiquette</a>.</p>

<h4>Non siate timidi, chiedete!</h4>
<p>Quando accedete per la prima volta, dite &lsquo;hi&rsquo; (&lsquo;ciao&rsquo;) e fate la vostra domanda: #scribus &egrave; un luogo amichevole. Una breve presentazione sar&agrave; ben accetta. Se non parlate inglese, non temete: dovreste prima tentare in inglese, ma in #scribus vi sono parecchie persone che parlano lingue diverse. Anche nel Team, sono almeno sette le lingue conosciute abbastanza bene per conversare in IRC. Altri frequentatori regolari probabilmente ne coprono un'altra mezza dozzina.</p>

<h4>Fornite dettagli</h4>
<p>&Egrave; utile dire di pi&ugrave; che &ldquo;Ho un problema con una certa cosa che non funziona.&rdquo;</p>
<ul>
<li>per cominciare, dovreste dire su quale piattaforma usate Scribus e con quale versione di Qt: questo &egrave; sempre utile. Certi problemi riguardano specifiche piattaforme o distribuzioni.</li>
<li>descrivete il vostro problema in modo che per gli altri sia facile rispondere.</li>
<li>siate pronti a rispondere a domande su quali versioni di determinate applicazioni sono installate sul vostro computer.</li></ul>

<h4>Siate pazienti</h4>
<p>Il pregio di IRC &egrave; la comunicazione diretta &ldquo;all'istante&rdquo;, ma a volte gli utenti sono impegnati in altre attivit&agrave;, come programmare Scribus :-). Su IRC, spesso gli utenti abituali e gli sviluppatori sono collegati 24 ore al giorno, ma potrebbero essere lontani dal computer. Ci&ograve; non significa che dovete aspettare giorni per avere una risposta. Inoltre, #scribus ha un amichevole bot il cui nome &egrave; mrscribe, che pu&ograve; facilmente ritrasmettere i messaggi: potete fare conoscenza con lui pi&ugrave; avanti in questa pagina.</p>

<h4>IRC non &egrave; una scusa per non leggere la documentazione</h4>
<p>Come minimo dovreste aver gi&agrave; letto le FAQ (domande frequenti) e le parti della documentazione attinenti al vostro problema. Se qualcuno (potrebbe essere mrscribe) vi d&agrave; una risposta o un link, significa che la vostra domanda &egrave; gi&agrave; stata fatta pi&ugrave; di una volta. E significa anche che le informazioni che cercate si possono trovare facilmente altrove. Molto tempo e fatica sono stati impiegati per scrivere la documentazione, per quanto imperfetta. Ma &egrave; stata scritta per aiutare <strong>voi</strong>.</p>

<h4>Vi presentiamo MrScribe</h4>
<p>MrScribe &egrave; il nostro amichevole &ldquo;bot&rdquo;. I bot sono molto utili su IRC, poich&eacute; aiutano ad automatizzare certe attivit&agrave; di manutenzione. MrScribe ha anche degli aspetti divertenti, che sono utili ad aiutare gli altri. Potete scoprire tutto su MrScribe qui: <a href="http://supybot.com/">http://supybot.com/</a>.</p>

<h4>Alcuni consigli su client IRC</h4>
<p>Visto che sui nostri pc abbiamo client IRC in funzione 7 giorni la settimana e 24 ore al giorno, ce ne sono un paio che possiamo consigliare:</p>
<ul>
   <li><a href="http://www.xchat.org">X-Chat</a> - un client maturo, basato su GTK, che funziona su Linux e Windows. La versione Windows si trova anche su <a href="http://www.psyon.org/projects/xchat-win32/">http://www.psyon.org/projects/xchat-win32/</a>. Per MacOSX: <a href="http://xchataqua.sourceforge.net/twiki/bin/view/Main/WebHome">X-Chat For Aqua on MacOSX</a>  </li>
   <li><a href="http://konversation.kde.org/">Konversation</a> - un client IRC molto stabile e completo, e facile da usare per i principianti.</li>
 </ul>

<h4>Soffermatevi in IRC</h4>
<p>Quando arriva la risposta che aspettavate, non siete obbligati a scomparire. #scribus non &egrave; solo per esperti e sviluppatori; i principianti sono altrettanto benvenuti. &Egrave; facile riconoscere gli sviluppatori, poich&eacute; di solito hanno lo status di &ldquo;operatore&rdquo;. IRC &egrave; il luogo dove gli sviluppatori vengono a sapere se gli utenti hanno difficolt&agrave; con qualche funzione di Scribus o se c'&egrave; qualcosa di poco chiaro nell'interfaccia del programma. Soffermarsi in IRC &egrave; un buon modo di venire a sapere particolari interessanti sulle caratteristiche pi&ugrave; recenti, e buoni trucchi e consigli per l'uso dai pi&ugrave; esperti. Cos&igrave;, quando ve la sentite, accomodatevi e godetevela.</p></body>
</html>
