<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Lavorare con le pagine mastro</title>
</head>
<body>
	
<h2>Lavorare con le pagine mastro</h2>

<p>Le <i>pagine mastro</i> sono il mezzo che permette di inserire automaticamente nelle pagine normali degli elementi che si ripetono uguali su ciascuna di esse, come numeri di pagina, titoli di capitolo, intestazioni di sezione, e simili. Se avete utilizzato altri programmi di impaginazione, il concetto di sfondi fissi per le pagine potrebbe esservi familiare. Un aspetto fondamentale del loro funzionamento &egrave; che non sono modificabili nel normale spazio di lavoro. Tutto il contenuto di una pagina mastro, tranne i numeri di pagina, consiste in elementi fissi posti sullo sfondo del documento.</p>

<p>Una progettazione attenta e intelligente delle pagine mastro pu&ograve; rendere molto pi&ugrave; semplice e veloce la creazione di documenti complessi; pi&ugrave; un documento &egrave; complesso, pi&ugrave; l'uso di pagine mastro &egrave; essenziale. Vi sono parecchi motivi per usare le pagine mastro, tra cui la capacit&agrave; di aggiungere automaticamente i <a href="pagenumber.html">numeri di pagina</a>, e la possibilit&agrave; di evitare l'inserimento ripetuto in pi&ugrave; pagine di oggetti che devono trovarsi nella stessa posizione in ciascuna di esse.</p>

<h4>Creazione di pagine mastro</h4>
<p>Ci sono due modi di creare una pagina mastro. Il pi&ugrave; ovvio &egrave; quello di crearne una da zero, e questa &egrave; un'operazione piuttosto semplice: andate in <i>Modifica &gt; Pagine mastro</i>, e si aprir&agrave; la finestra di dialogo pagine mastro:</p>

<table width="100%"><tr><td align="center"><img src="images/mpage1.png" title="Modifica pagine mastro" alt="Modifica pagine mastro" align="center" /></td></tr></table>

<p>Come vedete, una o pi&ugrave; pagine mastro sono state create automaticamente all'apertura di un nuovo documento. Quante e di quali tipi ne sono state create dipende dal formato documento che avete scelto: i formati a pagina singola hanno una sola pagina mastro, quelli a doppia pagina ne hanno due, e cos&igrave; via. In genere &egrave; una buona idea lasciare invariata la pagina mastro &ldquo;Normale&rdquo; e crearne altre secondo necessit&agrave;.</p>

<p>La finestra di dialogo <i>Modifica pagine mastro</i> mostrata qui sopra contiene quattro opzioni, che da sinistra a destra sono:
<ul>
<li><b>aggiungi pagina mastro</b>: premendo questo pulsante, si apre una nuova finestra di dialogo. Qui dovete inserire un nome per la nuova pagina mastro. A seconda del formato documento che avete scelto, dovete anche indicare il tipo di pagina mastro (ad esempio: pagina sinistra, pagina destra). Quando premete OK la pagina mastro viene creata, ed &egrave; possibile modificarla subito.</li>
<li><b>duplica pagina mastro</b>: questo pulsante crea una copia della pagina mastro selezionata; vi sar&agrave; chiesto di inserire un nome per la nuova pagina. Copiare pagine mastro pu&ograve; essere utile se lavorate su un documento che usa un'impaginazione simile su molte pagine, con differenze soltanto nei dettagli: in casi come questo potete creare una pagina mastro con una struttura di base e farne delle copie, in cui solo i dettagli variabili sono modificati.</li>
<li><b>importa pagina mastro</b>: premendo questo pulsante si apre una finestra di dialogo in cui dovete selezionare un file di Scribus. Dopo aver premuto OK, si apre una nuova finestra di dialogo che permette di scegliere nel documento selezionato una pagina mastro, che sar&agrave; importata nel documento attuale. Questa funzione pu&ograve; essere utile se avete suddiviso un progetto di grandi dimensioni in diversi file pi&ugrave; piccoli (che &egrave; una pratica sempre consigliabile): importando le pagine mastro da uno dei documenti, non siete costretti a ricrearle manualmente in ciascuno dei file.<br>
<table width="100%"><tr><td align="center"><img src="images/mpage2.png" title="Importa pagina mastro" alt="Importa pagina mastro" align="center" /></td></tr></table></li>
<li><b>Elimina pagina mastro</b>: cancella la pagina mastro selezionata nella finestra di dialogo. Se la pagina mastro &egrave; utilizzata, dovrete indicarne un'altra che la sostituir&agrave;.</li>
</ul>
</p>Il secondo modo di creare una pagina mastro consiste nel convertire una pagina esistente in pagina mastro con il comando <i>Pagina &gt; Converti in pagina mastro</i>. Anche in questo caso dovrete inserire un nome e un tipo per la nuova pagina mastro. Se contrassegnate l'opzione &ldquo;Copia elementi pagina mastro applicata&rdquo;, la pagina mastro che &egrave; applicata alla pagina corrente sar&agrave; fusa con essa in una nuova pagina mastro; in caso contrario solo gli elementi della pagina &ldquo;normale&rdquo; saranno inseriti nella nuova pagina mastro.</p>
<table width="100%"><tr><td align="center"><img src="images/mpage3.png" title="Converti pagina" alt="Converti pagina" align="center" /></td></tr></table>

<h4>Applicare le pagine mastro</h4>
<p>Cos&igrave; come c'&egrave; pi&ugrave; di un modo di creare pagine mastro, c'&egrave; pi&ugrave; di un modo di applicarle.</p>

<h5>Il men&ugrave; Pagina</h5>
<p>Il modo pi&ugrave; ovvio di applicare una pagina mastro &egrave; da <i>Pagina &gt; Applica pagina mastro</i>. Selezionando questa voce, si apre la seguente finestra di dialogo:</p>
<table width="100%">
<tr>
<td align="center"><img src="images/mpage4.png" title="Applica pagina mastro" alt="Applica pagina mastro" align="center" />
</td>
</tr>
</table>
<p>Nel men&ugrave; a discesa in alto potete scegliere la pagina mastro che volete applicare.</p>
<p>Le opzioni al di sotto permettono di scegliere l'intervallo di pagine a cui la pagina mastro selezionata sar&agrave; applicata:
<ul>
<li>pagina corrente</li>
<li>pagine pari (cio&egrave;, di solito, le pagine sinistre)</li>
<li>pagine dispari (cio&egrave;, di solito, le pagine destre)</li>
<li>tutte le pagine</li>
<li>un intervallo di pagine</li>
</ul>
</p>
<h5>Il pannello Disposizione pagine</h5>
<p>Il pannello Disposizione pagine (che si apre dal men&ugrave; <i>Finestre</i>) fornisce un modo veloce di applicare le pagine mastro trascinandole col mouse, di spostarsi tra le pagine, di spostare e inserire pagine. La met&agrave; superiore del pannello mostra le pagine mastro disponibili nel documento. Facendo clic col tasto destro su una delle pagine mastro elencate potete attivare una sua anteprima in formato ridotto. La met&agrave; inferiore elenca le pagine (normali) presenti nel documento. Per applicare una pagina mastro, basta selezionarla nella met&agrave; superiore e trascinarla con il mouse sopra la pagina (normale) desiderata.</p>
<table width="100%">
<tr>
<td align="center"><img src="images/mpage5.png" title="Disposizione pagine" alt="Disposizione pagine" align="center" />
</td>
</tr>
</table>
<br>
<p><b><i>Importante: gli elementi contenuti in una pagina mastro si trovano sempre al di sotto degli elementi contenuti nelle pagine normali. Non &egrave; possibile spostare un elemento di una pagina mastro sopra un elemento di una pagina normale.</i></b></p>
</body>
</html>
