<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Lavorare con lo sfondo degli oggetti: colori, sfumature e motivi</title>
</head>
<h2>Lavorare con lo sfondo degli oggetti: colori, sfumature e motivi</h2>
<h3>Colori di fondo</h3>
<p>Per cominciare descriviamo il modo pi&ugrave; intuitivo di usare un colore di fondo per una cornice. Selezionate la cornice e aprite il pannello Propriet&agrave;, scheda Colori: il men&ugrave; a discesa sotto i pulsanti <i>Modifica propriet&agrave; colore linea</i> e <i>Modifica propriet&agrave; colore di fondo</i> dovrebbe mostrare la voce &ldquo;Normale&rdquo;; scegliete un colore nell'elenco e questo diventer&agrave; il colore di fondo della cornice. Nell'elenco compaiono i colori della raccolta colori corrente: <a href="color1.html">ricordate</a> che per passare a una diversa raccolta colori dovete andare in <i>Modifica &gt; Colori...</i> dopo aver chiuso tutti gli eventuali documenti aperti.</p>
<p>La scelta di un colore nell'elenco cambia il colore di fondo, e questo &egrave; evidente per le cornici di testo, le forme e i poligoni, ma potrebbe esserlo meno per una cornice immagine, che pu&ograve; essere completamente riempita dall'immagine contenuta. Oltre alla scelta del colore, potete anche regolare la <b>tonalit&agrave;</b> (la saturazione del colore) e l'<b>opacit&agrave;</b> (il grado di trasparenza). Per una cornice di testo, la saturazione del colore del testo &egrave; un'impostazione a s&eacute; che si trova nella scheda <i>Testo</i> del pannello Propriet&agrave;. L'impostazione per l'opacit&agrave; nella scheda <i>Colori</i> si comporta diversamente, e influenza la trasparenza del colore di fondo, ma anche quella del testo in una cornice di testo e di un'immagine in una cornice immagine.</p>
<p>Sotto l'impostazione per l'opacit&agrave; si trova quella per la selezione del <i>Modo fusione</i>, una caratteristica che ha una certa complessit&agrave; e che sar&agrave; spiegata altrove.</p> 

<h3>Sfumature</h3>
<p>Il men&ugrave; a discesa di cui abbiamo parlato prima, e che per impostazione predefinita mostra &ldquo;Normale&rdquo;, contiene le seguenti opzioni:
<ul>
<li>normale</li>
<li>sfumatura orizzontale</li>
<li>sfumatura verticale</li>
<li>sfumatura diagonale</li>
<li>sfumatura diagonale incrociata</li>
<li>sfumatura radiale</li>
<li>sfumatura lineare libera</li>
<li>sfumatura radiale libera</li>
</ul>
</p>
<p>Se scegliete una delle sfumature, si apre il selettore delle sfumature, che inizialmente ha soltanto due punti di cambiamento del colore, entrambi neri, alle estremit&agrave; del selettore. La freccia rossa indica il punto di cambiamento selezionato; potete sceglierne un altro con il mouse. Il punto di cambiamento selezionato &egrave; quello a cui vengono applicate le scelte per colore, tonalit&agrave; e opacit&agrave;. Potete spostare il punto di cambiamento trascinandolo col mouse oppure con la casella di controllo &ldquo;Posizione&rdquo;. Sono sempre presenti almeno due punti di cambiamento, ma potete aggiungerne quanti ne volete, e potete modificare le propriet&agrave; di ciascuno di essi in modo indipendente da quelle degli altri. Quando il cursore del mouse si trova nello spazio sottostante la barra orizzontale che mostra la sfumatura, vicino a esso appare un segno <b>+</b> e facendo clic viene creato un nuovo punto di cambiamento, che sar&agrave; anche quello attivo. Potete eliminare un punto di cambiamento facendo clic su di esso e trascinandolo con il mouse <i>verso il basso</i>; se lo trascinate in altre direzioni non riuscirete mai a farlo sparire.</p>

<p>Potete anche modificare <b>tonalit&agrave;</b> e <b>opacit&agrave;</b> dei colori delle sfumature, e ciascun colore pu&ograve; avere impostazioni indipendenti. Inoltre, la modifica dell'opacit&agrave; di uno o pi&ugrave; dei colori delle sfumature non ha alcuna influenza sull'opacit&agrave; del testo contenuto in una cornice di testo.</p><br>
<table>
  <tbody>
    <tr>
      <td><img src="images/gradient_adjuster1.png"/></td>
      <td><img src="images/gradient_adjuster.png"/></td>
    </tr>
  </tbody>
</table>

<p>Se selezionate la &ldquo;sfumatura lineare libera&rdquo; o la &ldquo;sfumatura radiale libera&rdquo; compare un altro pulsante: &ldquo;Sposta vettore&rdquo;. Questo pulsante permette di spostare il primo e l'ultimo punto di cambiamento del colore con il mouse, ed &egrave; accompagnato da una piccola finestra con caselle di controllo che permettono di impostare i valori numerici delle posizioni:
<p><img src="images/gradient_adjuster_vector.png"/>
<h3>Motivi</h3>
<p>La prima cosa da sapere sull'uso dei motivi &egrave; che non potete usarli se non ne avete; ci&ograve; significa che dovete dire a Scribus che cosa dovr&agrave; usare come motivo. Questo si pu&ograve; fare con l'apposita finestra di dialogo, che si apre da <i>Modifica &gt; Motivi...</i> nella barra dei men&ugrave;, dove potete caricare file singoli (&ldquo;Carica file&rdquo;) o un'intera directory di file scegliendo &ldquo;Carica raccolta&rdquo;. I motivi possono essere in formato sia bitmap sia vettoriale.</p>
<table width="100%"><tr><td align="center"><img src="images/patterns1.png" title="Importare/creare motivi" alt="Importare/creare motivi" /></td></tr></table><br>
<p>Qualunque oggetto contenuto nel documento (cornice, gruppo, forma, ecc.) pu&ograve; essere usato come motivo per mezzo del comando &ldquo;Invia ai motivi&rdquo;, che si trova nel men&ugrave; contestuale e nel men&ugrave; <i>Elemento</i> nella barra dei men&ugrave;.</p>
<p>Quando avete creato almeno un motivo, nella scheda <i>Colori</i> del pannello Propriet&agrave;, in fondo al men&ugrave; a discesa delle sfumature sar&agrave; presente la voce &ldquo;Motivo&rdquo;. Selezionando questa voce, si apre una piccola finestra che mostra i motivi disponibili, e inoltre sono presenti caselle di controllo in cui impostare gli spostamenti X e Y, la scalatura e la rotazione:</p>
<table width="100%"><tr><td align="center"><img src="images/patterns2.png" title="Motivi nella scheda Colori" alt="Motivi nella scheda Colori" /></td></tr></table><br>
<p>Scoprirete che se applicate una trasparenza a un motivo, essa sar&agrave; applicata anche al testo contenuto in una cornice di testo. Una soluzione alternativa per fare in modo che il testo non abbia trasparenza consiste nel creare una copia della cornice e posizionarla esattamente sopra l'originale, e poi impostare &ldquo;Nessuno&rdquo; come colore di riempimento e opacit&agrave; al 100%.</p>
</body>
</html>
