<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>L'&eacute;quipe de Scribus </title>
</head>
<body>
<h2>L'&eacute;quipe de Scribus (par ordre d'entr&eacute;e en sc&egrave;ne)</h2>

<p>Franz Schmid - il est &laquo; notre Linus &raquo; Concepteur original et programmeur principal de Scribus, il a 40 ans et travaille pour une soci&eacute;t&eacute; mini&egrave;re. [RedHat, Suse 9.1 - KDE]</p>

<p>Peter Linnell, alias mrdocs, a d&eacute;but&eacute; en testant la version 0.3.6. D&egrave;s la version 0.5.0, il a pris en main la r&eacute;daction de la documentation. Il effectue les tests, cr&eacute;e les rpm et est le webmestre de <a href="http://www.scribus.net/">www.scribus.net</a>. Il a 40 ans et est consultant ind&eacute;pendant en PAO/TI pour des maisons d'&eacute;dition. [Red Hat/Fedora, Suse 9.1 - KDE/Blackbox]</p>

<p>Paul F. Johnson, alias Nodoid, a d&eacute;but&eacute; en produisant des correctifs pour la version 0.8. Il se charge de la r&eacute;vision et de l'optimisation du code, a 35 ans et est administrateur de r&eacute;seau pour la Salford University School of Music o&ugrave; www.scribus.net est gracieusement h&eacute;berg&eacute;. [Red Hat/Fedora &mdash Gnome] </p>

<p>Craig Bradney, alias MrB, s'est joint &agrave; l'&eacute;quipe &agrave; partir de la version 1.1.1. Il a mis en ouvre docs.scribus.net et bugs.scribus.net, effectue les tests et s'occupe de l'IRC #scribus sur freenode.net. Il a 30 ans et est consultant ind&eacute;pendant en TI et en d&eacute;veloppement web. [Gentoo - KDE] </p>

<p>Petr Van&#283;k s'est joint &agrave; l'&eacute;quipe au moment de la version 1.1.4. C'est un sp&eacute;cialiste des modules d'extension. On lui doit le manuel pratique d'&eacute;criture des modules d'extension de Scribus ainsi que plusieurs modules. Il travaille dans une banque et a 30 ans. [Gentoo, Suse - KDE]</p>

<p>Riku Leino, alias Tsoots, est arriv&eacute; en m&ecirc;me temps que la version 1.1.5. Il a &eacute;crit le module d'extension des maquettes et a &eacute;tabli la structure du nouveau module d'importation des formats OpenOffice.org et HTML de la version 1.2.2. Tsoots a 26 ans, est &eacute;tudiant en TI et travaille pour HKL-Metro. [Slackware - KDE]</p>

<p>Craig Ringer travaille au d&eacute;veloppement du scripteur, ainsi qu'&agrave; l'adaptation de Scribus pour Mac OS X. Il a apport&eacute; de nombreuses am&eacute;liorations &agrave; Scribus en plus de r&eacute;gler certains bogues li&eacute;s &agrave; Python. Il est administrateur PAO/TI pour un quotidien. [Fedora/Debian]  </p>

<p>Andreas Vox (prononc&eacute; [fox]) s'est joint &agrave; l'&eacute;quipe avec la version 1.3.0. Il travaille &agrave; l'adaptation de Scribus pour qu'il puisse tourner directement dans l'interface Aqua de Mac OS X. C'est un sp&eacute;cialiste des api de polices, il d&eacute;teste C++, il aime les bons designs et a un commentaire stupide pour n'imoprte quoi. Il a 38 ans et aspire &agrave; devenir professeur. [Mac OS/X]</p>

<p>Jean Ghali se charge de l'adaptation pour la plateforme Windows. Il a 27 and et est ing&eacute;nieur logiciel et pr&eacute;-impression pour une compagnie d'impression.</p>


<h2>Les acteurs de soutien </h2>
<h4>Utilisateurs et collaborateurs actifs qui ont aid&eacute; la communaut&eacute; de Scribus (sans ordre particulier):</h4>

<p>Oleksandr Moskalenko, alias malex, s'occupe de la maintenance des paquets de Scribus pour Debian, traduit, contribue &agrave; l'internationalisation de Scribus, aide les utilisateurs sur l'IRC &agrave; #scribus. Il est biologiste mol&eacute;culaire. [Debian -KDE]</p>

<p>Steve Callcott, alias sjc, a &eacute;crit le script Python d'&eacute;chantillonnage des polices, qui a montr&eacute; la r&eacute;elle puissance du scripteur Python de Scribus. Il travaille au contr&ocirc;le des syst&egrave;mes et en &eacute;lectronique grand public ainsi qu'&agrave; la conception de logiciels sur mesure et au soutien aux utilisateurs.</p>

<p>Alessandro Rimoldi a fourni des correctifs li&eacute;s &agrave; l'internationalisation de Scribus et a contribu&eacute; au nettoyage du code.</p>

<p>J.-J. Sarton a apport&eacute; des correctifs essentiels pour am&eacute;liorer la gestion des images, entre autres. On lui doit la compatibilit&eacute; de GIMP avec Scribus.</p>

<p>Alistair Robinson a fourni des correctifs importants pour la gestion des polices lors des premi&egrave;res versions de Scribus. Il a aussi &eacute;crit l'ing&eacute;nieux correctif permettant &agrave; GIMP de cr&eacute;er des TIFF CMJN.</p>

<p>Maciej Hanski est le traducteur polonais et l'auteur du manuel pratique de cr&eacute;ation des formulaires PDF. Il est l'un des premiers collaborateurs au wiki de Scribus.</p>

<p>Yves Ceccone, traducteur fran&ccedil;ais, a &eacute;crit de nombreux scripts Python livr&eacute;s avec Scribus. Il a aussi produit une imposante documentation fran&ccedil;aise sur Scribus.</p>

<p>Martin Costabel a effectu&eacute; l'adaptation de Scribus pour Fink et se charge de sa maintenance, incluant toutes les biblioth&egrave;ques requises, permettant ainsi &agrave; Scribus de fonctionner sous Mac OS X avec l'interface X11.</p>

<p>Niyam Bhushan a r&eacute;dig&eacute; un tutoriel exceptionnel sur Scribus.</p>

<p>Marti Maria a r&eacute;pondu &agrave; mes tonnes de questions et a fourni littlecms.</p>

<p>Johannes R&#252;schel, excellent traqueur de bogues, est le traducteur allemand. Il a 19 ans et fait son service civil</p>

<p>Alexandre Prokoudine est le traducteur russe. Son aide a &eacute;t&eacute; tr&egrave;s pr&eacute;cieuse pour r&eacute;gler les questions li&eacute;es &agrave; l'internationalisation. Il a peaufin&eacute; l'interface utilisateur. Il est r&eacute;dacteur technique professionnel.</p>

<p>Lukasz Jernas, alias DeeJay1, s'occupe de la maintenance des paquets de Linux PLD. Il assiste les utilisateurs sur l'IRC &agrave; #scribus. </p>

<p>Howard White est un ing&eacute;nieur de pr&eacute;-impression retrait&eacute; qui teste, teste et teste encore. Il est toujours partant pour tester du code tout frais. </p>

<p>Cedric Gemy est professeur d'arts graphiques et auteur. Il s'occupe des tests de l'interface utilisateur.</p>
</body>
</html> 