<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Notice de copyright et licence de publication</title>
</head>
<body>
<h2>Notice de copyright et licence de publication</h2>

<p>Cette notice de copyright concerne la version en ligne et livr&eacute;e du Manuel d'aide de Scribus, originellement &eacute;crit par Peter Linnell avec l'aide de Franz Schmid, programmeur principal de Scribus. Des additions ont aussi &eacute;t&eacute; effectu&eacute;es par le reste de l'&eacute;quipe de Scribus compos&eacute;e de Craig Bradney, Paul Johnson, Riku Leino, Petr Vanek. La conception du site original bas&eacute;e sur le site de <a href="http://www.inkscape.org">Inkscape</a>.</p>

<p>Le tutoriel de FreedomYug sur docs.scribus.net et la page "Formulaires PDF et PHP" sont pubi&eacute;s en vertu de la Free Documentation License, qui peut &ecirc;tre consult&eacute;e &agrave; la premi&egrave;re page de la section tutoriel de FreedomYug, en cliquant sur le lien FDL. La FDL s'applique UNIQUEMENT &agrave; cette section de la documentation.</p>

<p>Le manuel d'aide (sauf le tutoriel FreedomYug susmentionn&eacute; et la page "Formulaires PDF et PHP") est distribu&eacute; sous les directives de la licence Open Publication License d&eacute;crite &agrave; l'adresse <a href="http://www.opencontent.org">www.opencontent.org</a>.</p>

<p>Le texte qui suit est le texte de la licence et s'applique au pr&eacute;sent travail :</p>

<h3>I. CONDITIONS SUR LES VERSIONS ORIGINALES ET MODIFI&Eacute;ES</h3>

<p>Ce manuel d'aide en ligne "Manuel d'aide de Scribus" peut &ecirc;tre reproduit et distribu&eacute; en tout ou en partie, sur tout support physique ou &eacute;lectronique, pouvu que les termes de cette license soient accept&eacute;s, et que ladite license ou une r&eacute;f&eacute;rence &agrave; cette derni&egrave;re soit inscrite dans la reproduction.
<p>La formulation sugg&eacute;r&eacute;e pour l'incorporation par renvoi est la suivante :
<p>Copyright (c) 2003 Peter Linnell et Franz Schmid, 2004. L'&eacute;quipe de Scribus. Ce mat&eacute;riel est distribu&eacute; seulement en vertu des modalit&eacute;s
stipul&eacute;es dansla Licence de Publication Ouverte (Open Publication License), v1.0 ou ult&eacute;rieure (la derni&egrave;re version peut &ecirc;tre consult&eacute;e &agrave; <a href="http://www.opencontent.org/openpub/">http://www.opencontent.org/openpub/</a>).

<p>La r&eacute;f&eacute;rence doit &ecirc;tre suivie imm&eacute;diatement par toute option choisie (voir la section VI).

<p>La redistribution commerciale de mat&eacute;riel licenci&eacute; sous la Licence de Publication Ouverte est autoris&eacute;e.

<h3>II. COPYRIGHT</h3>

<p>Le copyright est d&eacute;tenu par Peter Linnell et Franz Schmid, ainsi que l'&eacute;quipe de Scribus.</p>

<h3>III. LIMITES DE LA LICENCE</h3>

<p>L'agr&eacute;gation de tout ou partie du pr&eacute;sent document avec d'autres ouvrages ou programmes sur le m&ecirc;me support n'est pas r&eacute;put&eacute;e &eacute;tendre cette licence aux autres ouvrages. Le document r&eacute;sultant doit contenir une note pr&eacute;cisant l'inclusion de mat&eacute;riel en Publication Ouverte et une notice de copyright appropri&eacute;e.</p>

<p>DIVISIBILIT&Eacute;. Si une partie quelconque de cette licence s'av&egrave;re invalide ou inapplicable dans un territoire administratif donn&eacute;, les autres parties de la licence conservent leur effet. </p>

<p>LIMITE DE GARANTIE. Les ouvrages sous Publication Ouverte sont licenci&eacute;s et fournis en l'&eacute;tat, sans aucune forme de garantie, explicite ou implicite, y compris les garanties de commercialisation et d'adaptation &agrave; une fin particuli&egrave;re, ni aucune garantie de non-transgression.</p>

<h3>IV. EXIGENCES LI&Eacute;ES AUX OUVRAGES MODIFI&Eacute;S</h3>

<p>Toutes les versions modifi&eacute;es des documents couverts par cette licence, incluant les traductions, anthologies, compilations et documents partiels, sont assujetties aux restrictions suivantes :</p>

<p>1) La version modifi&eacute;e doit &ecirc;tre d&ucirc;ment d&eacute;clar&eacute;e comme telle.</p>

<p>2) La personne faisant les modifications doit &ecirc;tre identifi&eacute;e et les modifications, dat&eacute;es.</p>

<p>3) Les cr&eacute;dits &agrave; l'auteur et &agrave; l'&eacute;diteur originaux, si possible, doivent &ecirc;tre maintenus selon les pratiques universitaires courantes en mati&egrave;re de citations.</p>

<p>4) L'emplacement du document original non modifi&eacute; doit &ecirc;tre identifi&eacute;.</p>

<p>5) Les noms des auteurs originaux ne doivent pas &ecirc;tre utilis&eacute;s pour sanctionner (implicitement ou explicitement)le document r&eacute;sultant sans l'autorisation desdits auteurs.</p>

<h3>V. PRATIQUES EXEMPLAIRES</h3>

<p>cOutre les exigences ci-dessus, il est demand&eacute; et fortement recommand&eacute; aux redistributeurs de respecter les pratiques courantes en la mati&egrave;re.</p>

<p>1) Si vous distribuez des ouvrages en Publication Ouverte sur un support imprim&eacute; ou sur CD-ROM, faites parvenir une note par email aux auteurs pour les informer de vos intentions de redistribuer leur ouvrage au moins trente jours avant la production finale, pour donner aux auteurs le temps de vous fournir une mise &agrave; jour des documents. Cette note devrait d&eacute;crire les modifications, s'il y en a, apport&eacute;es au document initial.</p>

<p>2) Indiquez clairement toutes les modifications substantielles (incluant les omissions) dans le corps du document ou d&eacute;crivez-lesdans une annexe.</p>

<p>Finalement, bien que cela ne soit pas obligatoire en vertu de cette licence, il est souhaitable d'offrir aux auteurs une copie gratuite de tout document imprim&eacute; ou de tout CD-ROM r&eacute;alis&eacute; &agrave; partir d'un ouvrage licenci&eacute; en Publication Ouverte. </p>

<h3>VI. OPTIONS DE LICENCE</h3>

<p>1) Toute distribution du pr&eacute;sent ouvrage ou d'un de ses d&eacute;riv&eacute;s dans un format de livre standard est interdite, &agrave; moins d'uneautorisation pr&eacute;alable de la part du tenant du copyright. Les autres formes de distribution, incluant les support CD-ROM, &eacute;lectroniques et magn&eacute;tiques, sont autoris&eacute;es. </p>


<ul>
<li>Adobe, Adobe Reader, Adobe Acrobat sont des marques d'Adobe Corporation aux &Eacute;tats-Unis ou dans d'autres pays.</li>
<li> Intel, Intel Inside (logos), MMX et Pentium sont des marques d'Intel Corporation aux &Eacute;tats-Unis ou dans d'autres pays.</li>
<li>Linux est une marque de Linus Torvalds aux &Eacute;tats-Unis ou dans d'autres pays.</li>
<li>Mac, Mac OS et Macintosh sont des marques d'Apple Computer, Inc., enregistr&eacute;es aux &Eacute;tats-Unis et dans d'autres pays.</li>
<li>Microsoft, Windows, Windows NT, Visual Studio et le logo de Windows sont des marques de Microsoft Corporation aux &Eacute;tats-Unis ou dans d'autres pays.</li>
<li>Motif est une marque d&eacute;pos&eacute;e de The Open Group aux &Eacute;tats-Unis ou dans d'autres pays.</li>
<li>UNIX est une marque d&eacute;pos&eacute;e de The Open Group aux &Eacute;tats-Unis et dans d'autres pays.</li>
<li>Les autres noms de soci&eacute;t&eacute;, de produit ou de service peuvent &ecirc;tre des marques de commerce ou des marques de service de tiers et appartiennent
&agrave; leurs propri&eacute;taires respectifs.</li></ul>
</body>
</html> 