<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Compilation et installation</title>
</head>
<body>
<h2>Compilation et installation</h2>
<p>Afin de compiler et d'installer Scribus sur votre syst&egrave;me, taper ce qui suit dans le r&eacute;pertoire de base de la distribution Scribus, apr&egrave;s avoir d&eacute;compress&eacute; le module t&eacute;l&eacute;charg&eacute; :</p>
<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>
./configure
make
make install
</pre>
</td></tr></table></blockquote>
<p>La commande <code>make install</code> devra &ecirc;tre ex&eacute;cut&eacute;e avec l'acc&egrave;s root si vous n'ex&eacute;cutez pas la commande <code>./configure</code> avec l'option <code>--prefix=[dir]</code> pour sp&eacute;cifier un r&eacute;pertoire d'installation diff&eacute;rent. Voici un exemple de la mani&egrave;re de configurer et installer dans votre r&eacute;pertoire maison. (Pour plus d'information sur la mani&egrave;re d'installer plus d'une version Scribus &agrave; la fois, reportez-vous &agrave; la section <a href="parallel-install.html">Installation parall&egrave;le</a>)</p>
<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>
./configure --prefix=/usr;make;make install prefix=~/scribus/cvs
</pre>
</td></tr></table></blockquote>

<p>Si vous recevez des avertissements lors de l'ex&eacute;cution de <code>./configure</code>, vous devrez v&eacute;rifier les versions de <code>autoconf</code> et <code>automake</code> en ex&eacute;cutant :</p>
<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>
autoconf --version
automake --version
</pre>
</td></tr></table></blockquote>
<p>Si les versions ne sont pas au moins celles mentionn&eacute;es dans la section <a href=install2.html">&Eacute;l&eacute;ments requis</a>, vous pourriez, selon votre distribution, devoir indiquer l'usage d'une version subs&eacute;quente comme suit :</p>
<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>
export WANT_AUTOCONF=&#034;2.5&#034;
export WANT_AUTOMAKE=&#034;1.7&#034;
</pre>
</td></tr></table></blockquote>
<p>Apr&egrave;s avoir ex&eacute;cut&eacute; ces deux commandes, rev&eacute;rifiez les versions. Si elles ne correspondent pas &agrave; celles requises, vous devrez mettre &agrave; jour ces programmes, mais la plupart des applications viennent avec une version suffisamment avanc&eacute;e.</p>
<p>Vous pouvez d&eacute;marrer Scribus &agrave; partir d'une ligne de commande avec les options suivantes :</p>
<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>
scribus --help
</pre>
</td></tr></table></blockquote>
<p>Sortie :</p>
<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>
Scribus, Open Source Desktop Publishing
---------------------------------------
Homepage:       http://www.scribus.net
Documentation:  http://docs.scribus.net
Issues:         http://bugs.scribus.net

Usage: scribus [option ... ] [file]
Options:
-l,  --lang xx          Uses xx as shortcut for a language
-la, --langs-available  Lists the currently installed interface languages
-h,  --help             Print help (this message) and exit
-v,  --version          Output version information and exit
</pre>
</td></tr></table></blockquote>
<p>L'ex&eacute;cutable de Scribus est situ&eacute; par d&eacute;faut dans<code>/usr/local/bin</code>. La documentation se trouve dans<code>/usr/local/lib/scribus/doc</code></p>
<p>De plus, il y a un fichier <code>desktop.config</code> nomm&eacute; <code>scribus.desktop</code> qui peut &ecirc;tre utilis&eacute; comme raccourci menu ou raccourci bureau. Copiez-le simplement du r&eacute;pertoire de base de Scribus dans votre bureau KDE et il d&eacute;marrera Scribus. Apr&egrave;s avoir mis ce fichier sur le bureau, cliquez dessus avec le bouton droit et assurez-vous que la case ex&eacute;cuter est coch&eacute;e. Ce fichier se conforme aux plus r&eacute;centes sp&eacute;cifications <a href="http://www.freedesktop.org">www.freedesktop.org</a>.</p>
<p>Vu que Scribus utilise <code>autoconf</code>, aussi longtemps que vous avez les bonnes versions des librairies de d&eacute;veloppement, vous ne deriez pas avoir beaucoup de difficult&eacute;s lors de la compilation. Si vous avez quand m&ecirc;me des probl&egrave;mes, veuillez les signaler dans la liste de diffusion Scribus ou sur le canal IRC. Voir la section <a href="resources.html">Ressources de la communaut&eacute;</a> de ce manuel.</p>
<p>Finalement :</p>
<blockquote><table width="100%" border="1" bgcolor="#eeeeee"><tr><td border="0">
<pre>man scribus</pre>
</td></tr></table></blockquote>


<p> affichera l'information additionnelle pour le d&eacute;marrage.</p>

</body>
</html> 