<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Avant-propos </title>
</head>
<body>
<h2>Avant-propos </h2>

<p>Cr&eacute;er de la documentation technique sur un mode tout &agrave; fait nouveau, voil&agrave; l'ambition du pr&eacute;sent document. Mon but est de fournir au lecteur une mani&egrave;re novatrice d'apprendre &agrave; se servir d'un logiciel en lui permettant d'utiliser les outils du logiciel pendant que celui-ci est en cours de d&eacute;veloppement. On peut lire la version papier ou acc&eacute;der &agrave; la version &eacute;lectronique qui tire profit des caract&eacute;ristiques de Adobe Acrobat Reader, t&eacute;l&eacute;chargeable gratuitement.</p>

<p>Me voici en train d'&eacute;crire ce passage suite &agrave; une parfaite illustration des hasards de la vie.  Cela vaut bien une petite anecdote. Voulant &eacute;largir ma connaissance du monde des PC, j'ai commenc&eacute; &agrave; bricoler dans Red Hat Linux &agrave; la suggestion d'un ami ouvrant dans les TI. Lorsqu'on explore un monde nouveau, on cherche souvent ce qu'on conna&icirc;t, ne serait-ce que pour comparer. J'ai vite compris, apr&egrave;s avoir d&eacute;couvert Gnome et KDE, et apr&egrave;s avoir appris &agrave; compiler des logiciels, que tout cela n'&eacute;tait pas si compliqu&eacute;. </p>

<p>Un petit tour sur Google me fait d&eacute;couvrir Scribus 0.3.6, logiciel de PAO ressemblant &agrave; Quark, dont le d&eacute;veloppement vient &agrave; peine de commencer. Je t&eacute;l&eacute;charge le progiciel, tape ./configure : Scribus refuse de se compiler. J'exp&eacute;die un courriel contenant le charabia du message d'erreur, message qu'il me faut maintenant d&eacute;chiffrer. Surprise, 20 minutes plus tard, je re&ccedil;ois une r&eacute;ponse. Poliment, on m'explique ce qui ne va pas dans ma d&eacute;marche. Heureux pr&eacute;sage.</p>

<p>En l'espace de quelques semaines, apr&egrave;s quelques &eacute;changes par courriel, je suis devenu r&eacute;dacteur de la documentation de Scribus. Je ne connaissais pas grand-chose &agrave; la conception d'un logiciel et je savais encore moins programmer, ne serait-ce qu'un tout petit peu, en HTML. Mais je connaissais et j'aimais la PAO. Mon sixi&egrave;me sens me disait que Scribus allait devenir quelque chose de tout &agrave; fait exceptionnel. </p> 

<p>Dans le monde du logiciel libre, il arrive que de tr&egrave;s bons logiciels ne soient pas du tout document&eacute;s. Il arrive aussi que des programmeurs de talent soient parfaitement incapables de documenter leur propre travail. (En d&eacute;pit du fait que l'anglais ne soit pas sa langue maternelle, Franz a pu me fournir des explications claires.)</p>

<p>Voici donc la documentation que, bien modestement, j'ai r&eacute;dig&eacute;e pour rendre plus accessible ce grand programme.</p>

<p>Et il en reste encore &agrave; venir... </p>

</body>
</html>
 
