<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>IRC de Scribus</title>
</head>
<body>
<h2>IRC de Scribus</h2>

Pour nous joindre (lien cliquable) : <a href="irc://irc.freenode.net/#scribus">irc://irc.freenode.net/#scribus</a>

<h4>Quelques conseils :</h4>
<p>Un partie de la communaut&eacute; Scribus appartient &agrave; l'univers en ligne : sur IRC (Internet Relay Chat). Pour certains,
il s'agit d'un instrument de soutien inusit&eacute;. Cependant, nous pensons que l'IRC fonctionne vraiment bien. Habituellement,
on trouve au moins un membre de l'&eacute;quipe de Scribus ou un utilisateur expert sur le canal. Tenez compte de l'heure : le meilleur moment est l'heure de l'Europe centrale,sp&eacute;cialement le soir, lorsque l'IRC est plus anim&eacute;. Pour d'autres personnes, IRC est propice aux insultes et aux arguments incessants, mais #scribus <strong>est un endroit convivial et agr&eacute;able</strong>. Les insultes et la drague n'y sontpas tol&eacute;r&eacute;s.</p>

<h4>Ne soyez pas timide, osez poser une question.</h4>
<p></p>
En vous connectant pour la premi&egrave;re fois, dites "allo" et posez votre question. #scribus (le '#' indique un canal) est un endroit convivial. Une courte introduction fait l'affaire. Si vous ne parlez pas l'anglais, n'ayez aucune crainte. Essayez
d'abord en anglais, mais il y a un certain nombre personnes dans #scribus qui connaissent une grande vari&eacute;t&eacute; de langues. Les membres de l'&eacute;quipe parlent au moins sept langues diff&eacute;rentes assez bien  bien pour converser sur IRC. D'autres membres r&eacute;guliers en couvrent probablement une autre demi-douzaine. Un de l'equipe est fran&#231;ais. Trois autres parle fran&#231ais aussi.
<h4>Donnez des d&eacute;tails</h4> 
<p>Il est utile de fournir des d&eacute;tails au-del&agrave; de : "Quelque chose s'est bris&eacute; et maintenant telle chose ne fonctionne pas". </p>
<ul>
<li>Commencez par mentionner sur quelle plateforme vous travaillez et quelle est votre version de Qt, ces informations &eacute;tant toujours utiles. Certains probl&egrave;mes sont propres &agrave; des plateformes ou &agrave; des distributions.</li>
<li>D&eacute;crivez votre probl&egrave;me en simplifiant la vie &agrave; vos interlocuteurs.</li>
<li>Pr&eacute;parez-vous &agrave; r&eacute;pondre &agrave; des questions sp&eacute;cifiques &agrave; propos des versions des applications install&eacute;es.</li></ul>

<h4>Soyez patient</h4>

<p>IRC est un instrument merveilleux par son aspect instantan&eacute; et direct, mais il arrive que les correspondants sont occup&eacute;es &agrave; faire d'autres choses, comme coder Scribus:-). Des membres r&eacute;guliers et des d&eacute;veloppeurs sont souvent connect&eacute;s 24 heures sur 24. On appelle cela la "marche au ralenti" (idling). Nous pouvons &ecirc;tre loin de l'ordinateur. Cela ne signifie pas que vous deviez attendre des jours pour obtenir une r&eacute;ponse. &Eacute;galement, #scribus poss&egrave;de un robot amical appel&eacute; mrscribe qui peut transmettre des messages facilement. Vous pouvez d&eacute;couvrir mrscribe ci-dessous.</p>

<h4>IRC ne vous dispense pas de lire la documentation.</h4>

<p>Au minimum, vous devez avoir lu les FAQ ainsi que les sections appropri&eacute;es de la documentation. Si quelqu'un r&eacute;pond par un lien(ce peut &ecirc;tre mrscribe), cela signifie que le probl&egrave;me a d&eacute;j&agrave; &eacute;t&eacute; expos&eacute; auparavant, plus d'une fois. Cela signifie &eacute;galement que l'information peut &ecirc;tre trouv&eacute;e facilement ailleurs. Beaucoup de temps et d'efforts ont &eacute;t&eacute; consacr&eacute;s &agrave; l'&eacute;criture de la documentation, aussi imparfaite qu'elle puisse &ecirc;tre. Elle est &eacute;crite pour <strong>vous</strong> venir en aide.</p>

<h4>Voici MrScribe</h4>
<p>MrScribe est notre "robot" amical "bot". Les robots sont tr&egrave;s utiles dans l'IRC, puisqu'ils aident &agrave; automatiser certaines t&acirc;ches de maintenance. MrScribe contient aussi plein d'anecdotes amusantes, qui sont utiles pour aider les autres. Vous pouvez en apprendre plus &agrave; propos de MrScribe ici : <a href="http://supybot.com/">http://supybot.com/</a>.</p>

<h4>Fl&acirc;nage</h4>
<p>Une fois que vous tenez votre r&eacute;ponse, vous n'&ecirc;tes pas oblig&eacute; de vous &eacute;clipser. #scribus n'est pas r&eacute;serv&eacute; aux d&eacute;veloppeurs chevronn&eacute;s. Les novices de Scribus sont aussi les bienvenus. Souvent, vous pouvez reconna&icirc;tre les d&eacute;veloppeurs facilement, puisqu'ils ont habituellement le statut  "operator". IRC est l'endroit o&ugrave; nous d&eacute;couvrons, en tant que d&eacute;veloppeurs, quelles sont les difficult&eacute;s pos&eacute;es par certaines fonctionnalit&eacute;s ou quelles sont les d&eacute;faillances de l'interface utilisateur. Le fl&acirc;nage est un bon moyen d'apprendre beaucoup de petits d&eacute;tails sur les nouvelles fonctionnalit&eacute;s et de gl&acirc;ner quelques trucs aupr&egrave;s des gourous. Lorsque l'ambiance est favorable, profitez-en.</p></body>
</html>




