<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Am&eacute;liorer un PDF Scribus avec JavaScript</title>
</head>
<body>
<h2>Am&eacute;liorer un PDF Scribus avec JavaScript</h2>
<p>Scribus poss&egrave;de un support complet pour l'ajout de caract&eacute;ristiques interactives &agrave; un document PDF. Aucune application ne convient mieux aux formulaires PDF, aux pr&eacute;sentations ou a d'autres &eacute;l&eacute;ments interactifs qu'Acrobat Pro lui-m&ecirc;me. Cette fonctionnalit&eacute; est activ&eacute;e via des bo&icirc;tes de dialogue dans les propri&eacute;t&eacute;s de chaque champ, en ajoutant des fonctions JavaScript associ&eacute;es aux boutons PDF et aux champs de texte. La meilleure
mani&egrave;re de le d&eacute;montrer est avec un tutoriel PDF qui poss&egrave;de ces caract&eacute;ristiques :</p>
 
<p>"Scripter un PDF en JavaScript" de http://docs.scribus.net est un guide pas &agrave; pas pour commencer &agrave; am&eacute;liorer un PDF avec JavaScript.</p>
<p>Lien direct : </p><a href="http://docs.scribus.net/content/en/pdfs/javascriptpdf.pdf">http://docs.scribus.net/content/en/pdfs/javascriptpdf.pdf</a></p>
<p>Apr&egrave;s avoir lu ce tutoriel PDF, la prochaine section, Formulaires web en PDF, vous guidera dans les &eacute;tapes de cr&eacute;ation d'un formulaire web en PDF avec un exemple de script .php pour lire les donn&eacute;es enregistr&eacute;es.</p>
<p>Il est pr&eacute;f&eacute;rable de d'afficher le formulaire dans Acrobat Reader 5.x, une fois t&eacute;l&eacute;charg&eacute;, et de l'ex&eacute;cuer en dehors du navigateur. Vous
pouvez g&eacute;n&eacute;ralement cliquer avec le bouton droit dans le PDF puis faire <em>Enregistrer sous</em> pour enregistrer le fichier localement. D'autres visualiseurs PDF n'ont pas le support JavaScript pour afficher cet exemple correctement.</p>

<p>Enfin, voici un lien utile contenant des exemples de code : <a href="http://www.accesspdf.com/article.php/20050510131850979#comments">http://www.accesspdf.com/article.php/20050510131850979</a> expliquant comment l'outil pdftk permet d'utiliser le html comme vitrine pour remplir un formulaire PDF.</p>
</body>
</html>
 
