<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>L'exportation PDF avec Scribus</title>
</head>
<body>
<h2>L'exportation PDF avec Scribus</h2>
<h3>Parcours pour l'exportation PDF avec Scribus</h3>

<p>En dehors de la cr&eacute;ation de PDF interactif expliqu&eacute; plus tard, pour un document donn&eacute;, il y a quatre voies possibles pour cr&eacute;er votre document :</p>
<ol>
<li>
<p><strong>T&eacute;l&eacute;chargement web - lecture &agrave; l'&eacute;cran - formulaires interactifs</strong> - suivez ce parcours lorsque vous voulez la plus petite taille de fichier et que l'impression &agrave; haute r&eacute;solution n'est pas requise.</p>
</li>
<li>
<p><strong>Effets de pr&eacute;sentation</strong> - il est recommand&eacute; de r&eacute;-&eacute;chantillonner toutes les images &agrave; 72, 96 ou 120 dpi, d&eacute;pendant de la r&eacute;solution sur l'&eacute;cran d'affichage. Inclure toutes les polices et une mise en page paysage vous donnera un espace image maximum &agrave; l'&eacute;cran si vous prevoyez d'utiliser un projection de pr&eacute;sentation. Des conseils sur les PDFs de pr&eacute;sentation suivront.</p>
</li>
<li>
<p><strong>Optimis&eacute; pour presse</strong> - supprimer tout r&eacute;-&eacute;chantillonnage ou compression des images l&agrave; o&ugrave; la qualit&eacute; de l'image est de plus haute importance. Toutes les images amen&eacute;es dans Scribus comme images plac&eacute;es doivent &ecirc;tre au minimum 200 ppp et pr&eacute;f&eacute;rablement 300 ppp ou plus pour des photos ou des TIFFs. L'art lin&eacute;aire ou les graphiques vectoriels convertis en EPS dans une application comme Illustrator doit avoir un minimum de 800 ppp pour de meilleurs r&eacute;sultats. La plupart des vecteurs EPS peuvent &ecirc;tre import&eacute;s directement en tant qu'objets natifs de Scribus et il est recommand&eacute; si possible. <strong>Si votre imprimante supporte le PDF/X-3 avec gestion des couleurs, ceci est recommand&eacute; pour des r&eacute;sultats optimaux. Cependant, seule la derni&egrave;re technologie d'impression peut supporterPDF/X-3. Vous devriez activer cette option seulement lorsque votre imprimante vous l'indique. </strong>.</p>
</li>
<li>
<p><strong>Optimis&eacute; pour l'impression</strong> - il s'agit de cibler le PDF pour l'impression sur une imprimante de bureau laser ou &agrave; jet d'encre. Param&egrave;tres recommand&eacute;s : r&eacute;-&eacute;chantillonner toutes les images &agrave; 300 ppp ou moins, inclure les polices et conserver les marges de la page avec un tol&eacute;rance suffisante pour les limites de marges sur les imprimantes courantes de bureau ou d'entreprise (approx. 6/10 de pouce ou 1,5 cm.)</p>
</li>
</ol>
</body>
</html>
 
