<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Cr&eacute;er des pr&eacute;sentations PDF</title>
</head>
<body>
<h2>Cr&eacute;er des pr&eacute;sentations PDF</h2>
<h3>Pr&eacute;sentations PDF</h3>
<p>Cr&eacute;er des pr&eacute;sentations PDF dans Scribus est non seulement facile, cela fonctionne bien. Utiliser PDF au lieu des applications de "pr&eacute;sentation" traditionnelles comporte certains avantages :</p>

<ol>
	<li>Elles sont portables. Vous pouvez cr&eacute;er une pr&eacute;sentation PDF avec Scribus qui s'affichera sur presque n'importe quel ordinateur avec Acrobat Reader. D'autres types requierrent habituellement que l'application soit install&eacute;e et tr&egrave;s peu sont multiplateforme.</li>
	<li>Vous pouvez utiliser tous les outils de dessin, de manipulation de texte et d'image dans Scribus, qui sont dans plusieurs cas sup&eacute;rieurs &agrave; ceux des autres applications de pr&eacute;sentation. Tr&egrave;s peu peuvent importer des fichiers SVG ou EPS vraiment bien.</li>
	<li>Vous aurez un contr&ocirc;le typographique plus pr&eacute;cis du texte.</li>
	<li>Parce qu'elles sont cr&eacute;&eacute;es dans Scribus, vous pouvez les exporter avec une plus haute r&eacute;solution et elles s'imprimeront superbement.</li>
<li>Contrairement aux autres outils de pr&eacute;sentation, avec les capacit&eacute;s puissantes de formulaire et de JavaScript de Scribus, vous pouvez faire des pr&eacute;sentations r&eacute;ellement interactives qui peuvent prendre des comptes, poser des questions avec des dialogues et plus. Vous &ecirc;tre seulement limit&eacute; par votre imagination et vos aptitudes de scriptage. </li>
</ol>

<h4>Conseils :</h4>
<ul>
	<li>R&eacute;-&eacute;chantillonez toutes les images &agrave; 72-96ppp. D&eacute;pendant de la r&eacute;solution du mat&eacute;riel d'affichage, vous pouvez monter aussi haut que 120dpi, mais plus haut ne vous apportera aucun gain en nettet&eacute;. Mais effectuez-le dans un programme d'&eacute;dition d'images comme GIMP. Puis importez-les dans Scribus.</li>
	<li>Incluez toutes les polices. Ceci permet de s'assurer que l'espacement et la mise en page resteront les m&ecirc;mes peu importe la plateforme que vous utilisez.</li> 
	<li>Vous pouvez utiliser le format US Letter ou A4 en mode paysage pour votre mise en page. Ceci fera concorder la sortie &agrave; l'&eacute;cran de Acrobat Reader en mode Plein &eacute;cran.</li>
	<li>Lors de l'affichage d'images comme des photos ou des copies d'&eacute;cran, utilisez un fond noir ou fonc&eacute; sur votre page. Les couleurs seront ainsi plus vibrantes et donneront un plus grand contraste &agrave; vos spectateurs afin qu'ils distinguent tous les d&eacute;tails de vos diapositives.</li>
	<li>Utilisez des couleurs RGB pour vos images et utilisez toujours &Eacute;cran/Web pour le type de sortie &agrave; l'exportation.</li>
	<li>Il y a un truc que j'ai appris avec l'utilisation des PDF pour des pr&eacute;sentations. Chargez le PDF et parcourez chaque page avant de faire la pr&eacute;sentation, pour que le fichier soit charg&eacute; en m&eacute;moire. Vous obtiendrez ainsi des transitions plus fluides &agrave; l'&eacute;cran.</li>
</ul>
<h4>Param&egrave;tres et options</h4>
<p>Les effets de pr&eacute;sentation et les param&egrave;tres sont r&eacute;partis dans deux cat&eacute;gories. La premi&egrave;re est le contr&ocirc;le des transitions entre les pages lors de l'ex&eacute;cution d'une pr&eacute;sentation PDF, comme vous le feriez sur une sc&egrave;ne par exemple. Il y a une vari&eacute;t&eacute; d'effets qui sont dans la liste d&eacute;roulante et ils sont souvent support&eacute;s non seulement dans Adobe Reader, mais aussi dans d'autres visualiseurs PDF comme KPDF ou Xpdf par exemple. De plus, chaque page peut poss&eacute;der sa propre transition, diff&eacute;rente des autres.  </p>
<table width="100%"><tr><td align="center"><img src="images/pdfeffect1.png" title="Effets PDF" alt="Effets PDF"/></td></tr></table>
<p>Les options du visualiseur constituent la deuxi&egrave;me cat&eacute;gorie et vous donnent le contr&ocirc;le sur la mani&egrave;re dont l'application de visualisation est ouverte. Ceci fonctionnera probablement uniquement dans Adobe Reader puisque ces options sont bas&eacute;es sur des commandes JavaScript dans le PDF. Les <strong>actions sp&eacute;ciales</strong> sont des moyens plus avanc&eacute;s de contr&ocirc;ler le visualiseur &agrave; l'ouverture, mais elles requierrent du JavaScript personnalis&eacute; pour fonctionner.</p>
<table width="100%"><tr><td align="center"><img src="images/pdfeffect2.png" title="Effets PDF" alt="Effets PDF"/></td></tr></table>

</body>
</html> 