<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Lisez-moi de Scribus version 1.3.3.9</title>
</head>
<body>
<h2>Lisez-moi de Scribus version 1.3.3.9</h2>
<h4>Quoi de neuf?</h4>
<p>Scribus 1.3.3.9 est la 10eme version de d&eacute;veloppement de la nouvelle g&eacute;n&eacute;ration de Scribus. Bien qu'assez stable, le programme requiert un certain nombre de changements, qui sont en cours d'ex&eacute;cution. Il s'agit de la deuxi&egrave;me version de Scribus disponible en tant qu'application native win32. </p>
<h4>Le format des fichiers a chang&eacute; et n'est PAS compatible avec les versions ant&eacute;rieures. Vous avez &eacute;t&eacute; avertis. Nous avons particuli&egrave;rement d&eacute;sactiv&eacute; la la possibilit&eacute; d'ouvrir des fichiers 1.3.3.x dans les versions 1.2.x. Nos plans de d&eacute;veloppement d'un nouveau format de fichier devraient se mat&eacute;rialiser dans les versions 1.3.4 - 1.3.5.</h4>
<ol>
<li>Les utilisateurs Windows sont <strong>fortement encourag&eacute;s</strong> &agrave; installer la derni&egrave;re version de <a href="http://ghostscript.com">Ghostscript</a> <strong>avant</strong> d'installer Scribus. Cela simplifie grandement le param&eacute;trage de l'importation EPS. Ghostscript est un interpr&eacute;teur PostScript mature, indispensable pour pouvoir importer des EPS dans Scribus.</li>
<li>&Agrave; cause des nouveaux raccourcis menu/clavier am&eacute;lior&eacute;s, les raccourcis clavier 1.2.x ne sont pas migr&eacute;s et seront recr&eacute;&eacute;s une seule fois
au premier lancement de la version 1.3.x. Il existe beaucoup plus de raccourcis clavier; ils peuvent &ecirc;tre export&eacute;s pour utilisation sur d'autres machines, moyennant une personnalisation ad&eacute;quate.</li>
<li>Au premier d&eacute;marrage, la version 1.3.x proposera de convertir les pr&eacute;f&eacute;rences au nouveau format 1.3.x. Il est recommand&eacute; de le faire. Scribus 1.3.x conservera ses pr&eacute;f&eacute;rences s&eacute;par&eacute;ment de 1.2.x.</li>
<!--<li>Vous <strong>pouvez</strong> installer les deux versions en parall&egrave;le et les ex&eacute;cuter en m&ecirc;me temps. Il suffit de les installer en utilisant un pr&eacute;fixe de r&eacute;pertoire diff&eacute;rent, comme par exemple 1.2 dans /usr/local et 1.3 dans /opt ou $home/bin. Vous pouvez utiliser l'argument --prefix pour indiquer o&ugrave; Scribus doit &ecirc;tre install&eacute;.</li>-->
</ol>
<h4>Scribus 1.3.x est bas&eacute; sur la branche de code 1.2.x la plus r&eacute;cente, mais inclut &eacute;galement :</h4>
<ul>
<li>Annulation avec les capacit&eacute;s d'annulation sp&eacute;cifiques aux objets. Le nombre d'annulations/r&eacute;tablissements peut &ecirc;tre param&eacute;tr&eacute; dans les pr&eacute;f&eacute;rences. Une nouvelle palette pr&eacute;sente &eacute;galement l'historique d'annulation d&eacute;taillant les actions pour chaque &eacute;l&eacute;ment. </li>
<li>Un support am&eacute;lior&eacute; des images CMJN, incluant les chemins de coupure dans les fichiers TIFF et JPEG, ainsi qu'un meilleur support des fichiers natifs Photoshop &#174; PSD. Le support pour les 16 bit CMJN TIFF et les PSD suivra sous peu. L'utilisation d'images CMJN est recommand&eacute;, avec la gestion des couleurs correctement param&eacute;tr&eacute;e et activ&eacute;e pour un meilleur rendu &agrave; l'&eacute;cran. Le format CMYK-JPEG est &eacute;galement support&eacute;. </li>
<li>Des pr&eacute;f&eacute;rences pour les documents et l'applicationno compl&egrave;tement r&eacute;vis&eacute;es. Elles sont ind&eacute;pendantes l'une de l'autre. Les nouveaux documents h&eacute;ritent des pr&eacute;f&eacute;rences courantes de l'application. De plus, les pr&eacute;f&eacute;rences 1.3.x peuvent coexister avec les pr&eacute;f&eacute;rences 1.2.x sans probl&egrave;me.</li>
<li>Cette documentation est en grande partie bas&eacute;e sur 1.2.x, mais il y a quelques mises &agrave; jour pour 1.3, en ce qui concerne notamment les pr&eacute;f&eacute;rences et l'impression.</li>
<li>Scribus poss&egrave;de maintenant de vraies pages et images en regard et d'autres objets peuvent les enjamber.</li>
<li>Scribus poss&egrave;de maintenant un "espace brouillon" qui peut &ecirc;tre utilis&eacute; pour stocker des objets partiellement ou compl&egrave;tement en dehors de la page.</li>
<li>Scribus poss&egrave;de maintenant son propre v&eacute;rificateur de fichier int&eacute;gr&eacute; pour l'impression ou l'exportation en PDF. Les param&egrave;tres par d&eacute;faut permettent de s'assurer que les images et les polices sont d'une qualit&eacute; suffisante pour une impression ou une exportation PDF sans probl&egrave;mes. Vous pouvez d&eacute;cider de les ignorer dans les param&egrave;tres, mais ils sont soigneusement choisis pour assurer une qualit&eacute; minimum ou pour &eacute;viter les limitations connues des version PS3 ou PDF.</li>

</ul>
<p>Pour tous les d&eacute;tails des changements, r&eacute;f&eacute;rez-vous au ChangeLog et au Roadmap &agrave; l'adresse<a href="http://wiki.scribus.net/">http://wiki.scribus.net/</a>.</p>
<p>Pour utiliser Scribus dans votre langue, assurez-vous que les variables LC_ALL, LC_MESSAGES, LANG, Qt locale, OU l'option de la ligne de commande -l/--lang &#060;lang&#062; est assign&eacute;e correctement. Ceci peut &eacute;galement &ecirc;tre chang&eacute; dans les pr&eacute;f&eacute;rences et prend alors effet imm&eacute;diatement.</p>

<p>Les caract&eacute;ristiques d'importation EPS/PS de la version 1.3.x utilise des fonctionnalit&eacute;s avanc&eacute;es de Ghostscript. Nous recommandons &agrave; TOUS les utilisateurs d'installer la plus r&eacute;cente version de Ghostscript qui est disponible pour votre distribution. Des indications d&eacute;taill&eacute;es peuvent &ecirc;tre trouv&eacute;es &agrave; l'adresse docs.scribus.net concernant l'installation de GS 8.x en parall&egrave;le avec le GS install&eacute; par votre distribution.</p>
	
<p>L'activation de la gestion des couleurs <strong>requiert</strong> l'installation des profils ICC CMJN et RGB. Les profils icc d'&eacute;chelle de gris dans les images ne sont pas support&eacute;s dans cette version. Scribus vient avec 2 profils icc afin que la gestion de la couleur fonctionne imm&eacute;diatement. Ces profils ne peuvent pas &agrave; eux seuls assurer une bonne gestion des couleurs. Veuillez consulter les fichiers d'aide inclus et <a href="http://docs.scribus.net">http://docs.scribus.net</a> pour plus de d&eacute;tails.</p>
<p>Si vous avez une version 64 bits de Qt, il arrive parfois que ./configure ne d&eacute;tecte pas les ent&ecirc;tes de version 64 bits. Essayez alors : <pre>./configure --enable-libsuffix=64</pre> pour tester l'existence de versions 64 bits des libraries.</p>
<h4>Autres notes/probl&egrave;mes connus au moment de la sortie de la version:</h4>
	
<p>Il y a un probl&egrave;me dans la manipulation des contours de police pour certaines polices dans les librairies freetype. Ce probl&egrave;me est en cours de r&eacute;solution. Ne signalez pas ce probl&egrave;me. Changez plut&ocirc;t de police utilis&eacute;e si vous avez besoin des contours. Ce probl&egrave;me n'est pas inh&eacute;rent &agrave; Scribus. Des tests ont montr&eacute;s que ce probl&egrave;me n'est pas pr&eacute;sent dans freetype 2.1.10+, mais nous recommandons passer &agrave; freetype2 avec pr&eacute;caution seulement. Passer &agrave; freetype2 peut &ecirc;tre assez difficile sur certaines distributions.</p>
	
<h4>Probl&egrave;mes avec les d&eacute;grad&eacute;s:</h4>
	
<p>Si vous avez un d&eacute;grad&eacute; (c-&agrave;-d avec la couleur noir) avec 50% d'ombre au d&eacute;but et &agrave; la fin du d&eacute;grad&eacute;, vous obtenez un centre plus fonc&eacute; que les bords. On pourrait s'attendre &agrave; ce que le d&eacute;grad&eacute; ait une nuance &eacute;gale du d&eacute;but &agrave; la fin, surtout s'il n'y a aucun arr&ecirc;t de couleur entre eux. Nous croyons que c'est un probl&egrave;me de libart que nous ne pouvons pas r&eacute;soudre. Le d&eacute;grad&eacute; sera export&eacute; et imprim&eacute; correctement. La construction optionnelle cairo est une option de compilation. Elle est activ&eacute;e par:</p>
<pre>./configure --enable-cairo</pre>

<p>Notre construction exp&eacute;rimentale Cairo n'a pas ces probl&egrave;mes.  Nous encourageons ceux qui d&eacute;sirent tester la construction Cairo &agrave; signaler les probl&egrave;mes sur la liste de diffusion et/ou l'IRC. Nous *savons* que la construction avec Cairo activ&eacute; est plus lente, mais nous sommes encourag&eacute;s par le d&eacute;veloppement courant effectu&eacute; par l'&eacute;quipe de Cairo.
</p>

<h4>Probl&egrave;mes avec les polices</h4>
<p>Il y a beaucoup de notes et de d&eacute;tails au sujet des polices et de la r&eacute;solution des probl&egrave;mes de polices dans la documentation et en ligne &agrave; l'adressehttp://docs.scribus.net.  Veuillez les lire avec attention avant de signaler un probl&egrave;me.</p>
<p>Il y a des probl&egrave;mes avec la convention des noms de PostScript pour les polices Computer Modern Type 1, suivant la distribution.  Dans certains cas, toutes les polices d'une m&ecirc;me famille ne sont pas visibles dans Scribus. Nous travaillons sur une solution plus compl&egrave;te pour la prochaine version.
</p>
	
<h4>Pour les utilisateurs Debian:	</h4>
<p>Si Scribus ne d&eacute;marre pas et signale l'absence de polices PostScript, veuillez installer xfonts-scalable ou gsfonts-x11.	Ils sont dans les "Recommand&eacute;s" et seront install&eacute;s par toutes les interfaces utilisateur sensibles.
</p>	
<h4>Pour les utilisateurs Suse 9.x :</h4>
<ul>
<li>Les librairies littlecms 1.10, qui sont livr&eacute;es avec Suse 9.0, n'offrent par un support complet pour les caract&eacute;ristiques les plus r&eacute;centes de CMS dans Scribus 1.2. Il y a des mises &agrave; jour Suse 9.x en format RPM disponibles sur le site Scribus.net. Nous recommandons &eacute;galement d'utiliser la derni&egrave;re version de lcms.littlecms 1.1.4, qui est la version courante.</li>
<li>Nous recommandons d'utiliser les derniers rmps Qt-3.3.4 de Suse.</li>
<li>Pour activer le support CUPS direct que nous recommandons, assurez-vous que cups-devel et openssl-devel sont install&eacute;s. Suse permet le support ssl dans CUPS. Voir le fichier BUILDING.</li></ul>
<p>Fedora/RH avec Qt 3.3.2-6+ a les m&ecirc;mes difficult&eacute;s.</p>
<p>Le fichier distinct PACKAGING (en anglais) fournit des indices et des notes d&eacute;taill&eacute;s sur la mani&egrave;re de construire des progiciels pour Scribus.</p>
<p> Plus d'indices et d'autres informations sont sur les sites <a href="http://www.scribus.net">http://www.scribus.net</a> et <a href="http://docs.scribus.net">http://docs.scribus.net</a>. La compilation, l'installation et les questions fr&eacute;quentes peuvent y &ecirc;tre trouv&eacute;es.</p>
	
<p>Il y a une communaut&eacute; vivante en ligne, sur IRC @ # scribus ou irc.freenode.net et sur la liste de diffusion. La liste de diffusion peut &ecirc;tre trouv&eacute;e &agrave; l'adresse: http://nashi.altmuehlnet.de/mailman/listinfo/scribus</p>
<p>Pour l'&eacute;quipe de Scribus,</p>
<p>Peter Linnell<br />
juin 2007<br />
</p>
</body>
</html>