<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Ressources de la communaut&eacute;</title>
</head>
<body>
<h2>Ressources de la communaut&eacute;</h2>
<p>La <strong>liste de diffusion de Scribus</strong> est en ligne &agrave; l'adresse<a href="http://nashi.altmuehlnet.de/mailman/listinfo/scribus">http://nashi.altmuehlnet.de/mailman/listinfo/scribus</a>. Il y a une interface en anglais et en allemand au gestionnaire de liste de diffusion. Celle-ci sert au soutien technique des utilisateurs ainsi qu'&agrave; la r&eacute;solution desprobl&egrave;mes de d&eacute;veloppement. Des recherches peuvent &ecirc;tre effectu&eacute;es sur la liste &agrave; l'adresse suivante : <a href="http://search.srem.org/">http://search.srem.org/</a></p>
<p>Le <strong>traceur de bogues</strong> se trouve &agrave; <a href="http://bugs.scribus.net/">http://bugs.scribus.net/</a></p>
<p>Le <strong>Wiki</strong> se trouve &agrave; <a href="http://wiki.scribus.net/">http://wiki.scribus.net/</a></p>
<p>Un canal IRC <strong>#scribus</strong> sur <strong>freenode.net</strong> est assez actif. Il y a habituellement au moins une personne du cour de l'&eacute;quipe de d&eacute;veloppement pr&eacute;sente ici. Pour une assistance imm&eacute;diate, c'est la meilleure option avec la liste de diffusion, mais cela ne vous dispense pas de faire des recherches dans la documentation :-) Voir : <a href="irc.html">IRC de Scribus</a>  </p>
<p>Les d&eacute;velopppeurs de Scribus maintiennent un blogue &agrave; l'adresse : <a href="http://rants.scribus.net/">http://rants.scribus.net/</a>. Tout utilisateur de Scribus y trouverait un int&eacute;r&ecirc;t.  </p>
<h4>Allemand</h4>
<p><a href="http://scribus-forum.de/news.php">http://scribus-forum.de/news.php</a></p>
<p>Il y a un site de documentation <a href="http://www.bomots.de/scribus/">en allemand</a>, bas&eacute; sur une version ant&eacute;rieure de Scribus.</p>
<h4>Fran&#231;ais</h4>
<p>Pour les francophones, trois membres de l'&eacute;quipe parlent fran&#231;ais. Nous vous demandons d'essayer l'anglais d'abord , mais le fran&#231;ais est aussi parl&eacute; sur IRC et sur la liste. Il y a souvent plusieurs francophones sur le canal. Il y a aussi un forum d&eacute;di&eacute; &agrave; Scribus sur <a href="http://www.linuxgraphic.org/forums/viewforum.php?f=20">Linuxgraphic.org</a></p>
<h4>Italien </h4> <p>Il y a une introduction &agrave; l'adresse<a href="http://www.freaknet.it/node/496" name="Guida a Scribus" title="Guida a Scribus">Guida a Scribus</a>, gracieuset&eacute; de Tommaso Cappello</p>
<h4>Polonais</h4>
<p>Il existe une traduction en polonais du tutoriel "D&eacute;marrer avec Scribus" &agrave; l'adresse :<br /><A href="http://linux.hanski.info/static/scribus/index.html">http://linux.hanski.info/static/scribus/index.html</A></p>
<p>Les versions fran&ccedil;aise, allemande et polonaise de la documentation sont en voie d'ach&egrave;vement et pourront &ecirc;tre consult&eacute;es &agrave; cette adresse.</p>
</body>
</html> 