<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Win32)">
	<META NAME="CREATED" CONTENT="20060712;10275318">
	<META NAME="CHANGED" CONTENT="20060712;10282532">
	<STYLE>
	<!--
		@page { size: 21.59cm 27.94cm; margin: 2cm }
		P { margin-bottom: 0.21cm }
	-->
	</STYLE>
</HEAD>
<BODY LANG="en-US" DIR="LTR">
<H2>L'essentiel sur Scribus</H2>
<H3>Ce qui distingue la PAO du traitement de texte</H3>
<P>&Agrave; quoi sert Scribus? Qu'est-ce qu'un programme de &laquo;&nbsp;mise
en page&nbsp;&raquo;? Entre autres, vous pouvez cr&eacute;er des PDF
comme celui-ci.</P>
<P>Fondamentalement, Scribus <B>n'est pas</B> un traitement de texte.
Il est important de comprendre ce concept. Scribus appartient &agrave;
la famille des applications de mise en page, aussi connues sous
l'appellation de programmes de PAO (publication assist&eacute;e par
ordinateur). Scribus permet de positionner des objets tels des
images, des logos, etc. avec une grande pr&eacute;cision et beaucoup
de souplesse. Ce petit guide est con&ccedil;u pour donner &agrave; un
utilisateur d&eacute;butant un aper&ccedil;u de ce que Scribus peut
faire. Vous ne trouverez pas ici une description de chaque fonction,
mais plut&ocirc;t un survol qui vous permettra de vous mettre en marche et d'&ecirc;tre
productif.</P>
<P>Avec Scribus, vous pouvez&nbsp;:</P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm">Cr&eacute;er des documents
 attrayants comme des pochettes de CD, des cartes de souhaits, des
 brochures commerciales, des infolettres, des affiches. 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">Cr&eacute;er des fichiers qui
 pourront ais&eacute;ment &ecirc;tre imprim&eacute;s par votre
 imprimeur commercial. 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">Cr&eacute;er des formulaires PDF
 interactifs et des documents de pr&eacute;sentation. Qu'est-ce qu'un
 PDF interactif? Vous en avez un sous les yeux. Les PDF interactifs
 sont dot&eacute;s de fonctions sp&eacute;ciales&nbsp;: hyperliens,
 annotations ou notes qui ne s'impriment pas, signets &mdash; une
 sorte d'index cr&eacute;&eacute; automatiquement pour votre PDF, en
 plus de fonctions de navigation &mdash; comme un fureteur web. 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">Cr&eacute;er des logos et des
 dessins ou de jolis effets typographiques au moyen d'outils faciles
 &agrave; utiliser. 
	</P>
	<LI><P>Importer photos et illustrations en conservant la qualit&eacute;
 et la pr&eacute;cision des couleurs en pr&eacute;vision de
 l'impression. 
	</P>
</UL>
<H4>Pour commencer, la th&eacute;orie - Avoir la bonne approche</H4>
<P>Les utilisateurs qui en sont &agrave; leur coup d'essai avec une
application de PAO comme Scribus &eacute;prouveront peut-&ecirc;tre
un peu de contrari&eacute;t&eacute;. L'interface a beau &ecirc;tre
facile d'approche, voire famili&egrave;re, quand on se met r&eacute;ellement
au boulot les choses ne tournent pas tout &agrave; fait tel que
pr&eacute;vu. Ne commettez pas l'erreur de lancer Scribus, de cr&eacute;er
un nouveau document et de vous mettre &agrave; taper votre texte.
Tirer le maximum d'une application comme Scribus requiert une
compr&eacute;hension minimum du d&eacute;roulement des travaux, ce
qu'on appelle le &laquo;&nbsp;flux de production&nbsp;&raquo; dans le
monde de la PAO. &Ccedil;a peut sembler un tantinet obscur au point
de d&eacute;part mais vous serez r&eacute;compens&eacute; au final.</P>
<P>Apprendre &agrave; utiliser Scribus pose souvent un d&eacute;fi
additionnel&nbsp;: vous n'&ecirc;tes pas simplement en train
d'apprendre &agrave; vous servir d'un nouveau programme, vous
d&eacute;couvrez la PAO, qui a ses petites r&egrave;gles bien &agrave;
elle. Des diff&eacute;rences subtiles la distinguent des traitements
de texte ou des &eacute;diteurs de texte. Heureusement, Scribus a son
propre &eacute;diteur de texte. Utiliser cet outil plut&ocirc;t que
de saisir son texte directement dans la page, apprendre comment cr&eacute;er
et appliquer des feuilles de styles, voil&agrave; qui accro&icirc;tra
votre productivit&eacute; en plus de vous permettre de cr&eacute;er
des documents plus ais&eacute;ment modifiables.</P>
<P>Au moment de cr&eacute;er votre document, vous devez d&eacute;j&agrave;
avoir &agrave; l'esprit ce qu'il en adviendra : comment il sera
imprim&eacute;, comment il sera utilis&eacute; : c'est ce qu'on
appelle le <I>flux de production</I> en PAO. Si, par exemple, vous
d&eacute;cidez de cr&eacute;er une brochure pour votre entreprise, il
est presque certain que vous la ferez imprimer chez un imprimeur. En
ce cas, ce serait une erreur grossi&egrave;re que de prendre les
jpegs en basse r&eacute;solution de votre site web et de les utiliser
directement dans Scribus. Le Web et l'imprimerie ont deux buts
diff&eacute;rents. <B><I>Les graphiques, photos et illustrations
utilis&eacute;s dans un site web sont presque toujours inutilisables
en impression.</I></B> Ces &eacute;l&eacute;ments doivent avoir une
r&eacute;solution <B>de beaucoup</B> sup&eacute;rieure. Dans le monde
de l'imprimerie, le poids des fichiers a beaucoup moins d'importance
que la qualit&eacute; de l'image.</P>
<P>Un exemple de flux de production en PAO&nbsp;:</P>
<OL>
	<LI><P STYLE="margin-bottom: 0cm">Prenez une feuille de papier et un
 crayon et esquissez votre maquette... Ceci vous aidera &agrave;
 visualiser les &eacute;l&eacute;ments de votre page&nbsp;: textes,
 illustrations, images. 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">Rassemblez vos images
 matricielles, pr&eacute;f&eacute;rablement &agrave; 200 dpi ou plus,
 en TIFF ou PNG. Rassemblez vos illustrations vectorielles en un
 format appropri&eacute; pour l'importation. Le format SVG est
 g&eacute;n&eacute;ralement le meilleur choix. 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">R&eacute;digez le texte dans un
 traitement de texte ou un &eacute;diteur de texte. Corrigez les
 fautes et r&eacute;visez la grammaire, etc. 
	</P>
	<LI><P>Rassemblez tous ces documents dans un r&eacute;pertoire et
 commencez votre mise en page dans Scribus. 
	</P>
</OL>
<P>En environnement commercial, tout ceci est bien plus complexe.
Mais selon mon exp&eacute;rience, l'application de cette m&eacute;thode
ou d'une m&eacute;thode similaire vous aidera &agrave; planifier et &agrave;
structurer votre travail et vous fera gagner en productivit&eacute;.</P>
<P>Enfin, le flux de production prend en consid&eacute;ration les
nombreuses options d'exportation en PDF ou d'impression. Le sujet est
abondamment document&eacute; dans le chapitre consacr&eacute; &agrave;
l'exportation en PDF. Pour l'impression, Scribus dispose de plusieurs
fonctions avanc&eacute;es qui diff&egrave;rent vraiment des autres
applications. Activez les <B>infobulles</B> afin d'obtenir une aide
ponctuelle et/ou lisez avec attention la section consacr&eacute;e &agrave;
l'impression pour en comprendre les options.</P>
<P>J'encourage les utilisateurs d&eacute;butants &agrave; lancer
Scribus tout en parcourant la documentation, particuli&egrave;rement
les passages qui traitent de sujets plus pointus. Lisez le tout
attentivement au moins une fois. Notez ce que vous ne comprenez pas
et postez vos questions sur la liste courriel ou dans l'IRC (forum de
discussion des programmeurs de Scribus).</P>
<P>Avant de plonger dans un projet, une des meilleures choses &agrave;
faire est de mettre l'ordinateur de c&ocirc;t&eacute;, de prendre du
papier et de faire une esquisse. J'ai moi aussi red&eacute;couvert la
plume et le papier. J'&eacute;tais en vacances et je n'avais pas
toujours acc&egrave;s &agrave; un ordinateur. J'ai d&eacute;couvert
que ne presque plus &eacute;crire &agrave; la main avait appauvri ma
calligraphie. R&eacute;sultat, j'ai &eacute;crit 8 pages compl&egrave;tes
en un apr&egrave;s-midi, plus que je peux &eacute;crire en trois
soirs. Pourquoi? Parce que j'&eacute;tais forc&eacute; de me
concentrer sur le contenu. Je vous sugg&egrave;re de faire la m&ecirc;me
chose. La magie de Scribus est son habilet&eacute; &agrave; assembler
toutes les pi&egrave;ces du puzzle <I>&agrave; la fin</I> pour cr&eacute;er
un chef-d'oeuvre.</P>
<P>Donc, si vous pr&eacute;voyez que le texte occupera une grande
part de votre document, lancez votre &eacute;diteur ou votre
traitement de texte pr&eacute;f&eacute;r&eacute; et r&eacute;digez
d'abord ce texte. De cette mani&egrave;re, vous pourrez vous
concentrer sur le contenu. Notez ici que, parfois, les traitements de
texte ne vous aident pas... Ils sont source de distraction avec
toutes leurs options de pr&eacute;sentation, au d&eacute;triment du
contenu. (Je suis moi aussi coupable.) Je n'ai pas &agrave; pr&ecirc;cher
aux convertis pour expliquer les b&eacute;n&eacute;fices du texte non
format&eacute;. C'est un usage bien &eacute;tabli dans le monde
Unix/Linux. Pour les migrants du monde Windows/Mac, c'est une autre
histoire. Enregistrez au format texte seulement, vous en serez
r&eacute;compens&eacute; un jour. Pour l'heure, c'est encore la
meilleure m&eacute;thode. Au moment d'&eacute;crire ces lignes, des
modules d'importation plus avanc&eacute;s sont sur les planches. <I>(NDT
- L'importateur OpenOffice.org est pr&eacute;sent &agrave; partir de
la version&nbsp;1.2.1 de Scribus.)</I></P>
<P>Il vous faudra ensuite tenir compte des dessins, des photos, des
tableaux, etc., qui feront partie de votre document.</P>
<P>Les <B><I>images matricielles</I></B> comme les photos proviennent
de GIMP, de Corel Photopaint, d'Adobe Photoshop ou de programmes
similaires. Elles pourraient aussi provenir d'un appareil photo
num&eacute;rique ou d'une application pour les scanners telle Xsane
ou Gphoto. Les images matricielles sont compos&eacute;es de pixels ou
points, habituellement compress&eacute;s dans un format de fichier
comme Jpeg, TIFF, PNG ou bmp. Pour Scribus, je pr&eacute;f&egrave;re
et je recommande le PNG pour les images comme les captures d'&eacute;cran
et le format TIFF pour les photos en haute r&eacute;solution. Le
format TIFF est reconnu en PAO pour sa fiabilit&eacute;.</P>
<P>Les <B><I>dessins vectoriels ou les illustrations</I></B>
proviennent d'applications comme Inkscape, Sodipodi, Adobe
Illustrator, Corel Draw, Sketch ou Xfig. Celles-ci produisent des
dessins qui sont conserv&eacute;s au format vectoriel, ce qui permet
de pr&eacute;server leur apparence &agrave; n'importe quelle &eacute;chelle.
Il existe deux bons formats pour importer ces dessins dans Scribus&nbsp;:
EPS (Encapsulated PostScript) et SVG (Scalable Vector Graphics).
L'avantage des dessins SVG est que ce sont des &eacute;l&eacute;ments
natifs, c'est-&agrave;-dire qu'ils sont directement modifiables dans
Scribus, comme s'ils avaient &eacute;t&eacute; cr&eacute;&eacute;s
dans Scribus. Tous les types de SVG qui sont normalis&eacute;s W3C
peuvent &ecirc;tre import&eacute;s dans Scribus &agrave; l'exception
de ceux qui contiennent des fonctions multim&eacute;dia et des
actions script&eacute;es pour les modules d'extension (plug-ins) de
Win32 destin&eacute;es &agrave; un fureteur.</P>
<P>Il est possible d'importer un autre format de fichier dans
Scribus&nbsp;: le PDF. Scribus aura recours &agrave; Ghostscript qui
en fera une image haute r&eacute;solution et une autre en basse
r&eacute;solution pour la fonction de pr&eacute;visualisation &agrave;
l'&eacute;cran. Cette technique est particuli&egrave;rement indiqu&eacute;e
pour r&eacute;cup&eacute;rer les dessins ou les images. S'il ne vous
faut que le texte, ouvrez Adobe Acrobat Reader et op&eacute;rez par
copier-coller. Note&nbsp;: vous ne pourrez importer qu'une page &agrave;
la fois sans pouvoir l'&eacute;diter, ni &eacute;diter un PDF cr&eacute;&eacute;
par une autre application.</P>
<P>Maintenant que vous avez rassembl&eacute; tous vos morceaux,
l'heure est &agrave; Scribus. Pour les routiers de la PAO, le premier
contact avec Scribus sera comme des retrouvailles avec un vieil ami.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
</BODY>
</HTML>