<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Scripter Scribus avec Python</title>
</head>
<body>
<h2>Scripter Scribus avec Python</h2>

<h4>Aper&ccedil;u</h4>
<p>On d&eacute;crit ici comment utiliser le module externe d'&eacute;criture de scripts de Scribus. Le scripteur vous permet d'utiliser le puissant langage Python comme dans Scribus. Cela peut vous permettre d'automatiser des t&acirc;ches qui, autrement, seraient r&eacute;p&eacute;titives, entre autres. </p>

<p>Ce manuel en est &agrave; sa premi&egrave;re version, qui n'est pas compl&egrave;te ni parfaitement pr&eacute;cise. Des additions au moteur de script sont faites fr&eacute;quemment, donc si vous avez des questions, laissez une courte note sur la liste de diffusion.</p>

<p>Il y quelques scripts d'exemples simples dans le sous-r&eacute;pertoire samples o&ugrave; Scribus est install&eacute;. Si vous avez cr&eacute;&eacute; des scripts qui seraient utiles &agrave; d'autres utilisateurs, ne vous g&ecirc;nez pas pour les t&eacute;l&eacute;charger sur www.scribus.net ou d'&eacute;crire &agrave; mrdocs &agrave; scribus.info avec un attachement. Nous esp&eacute;rons ajouter une galerie d'extensions au site principal dans le futur. </p>

<h3>Utiliser l'extension</h3>

<table width="100%"><tr><td align="center"><img src="images/Scripter.png" align="center" alt="Ex&eacute;cuter un script" title="Ex&eacute;cuter un script" /></td></tr></table>

<p>Pour ex&eacute;cuter un script Python, s&eacute;lectionnez "Script-&gt;D&eacute;marrer un script..." Scribus affichera une bo&icirc;te de s&eacute;lection des fichiers qui vous permettra de s&eacute;lectionner le script Python. Ci-dessous, vous rouverez la rubrique "Scripts r&eacute;cents", qui &eacute;num&egrave;re les script ex&eacute;cut&eacute;s r&eacute;cemment. Le nombre indiqu&eacute; d&eacute;pend des param&egrave;tres &eacute;tablis dans les pr&eacute;f&eacute;rences. </p> 

<p>Vous pouvez utiliser plusieurs modules Python avec ce module externe. La seule exception vise les scripts qui attendent des param&egrave;tres d'une ligne de commande. Ils ne fonctionnent pas parce que l'extension fournit &agrave; l'interpr&eacute;teur Python une ligne de commande vide.</p>

<p>L'&eacute;l&eacute;ment de menu "Afficher la console" vous donne une console Python interactive, o&ugrave; vous pouvez ex&eacute;cuter des commandes directement. Il n'est pas n&eacute;cessaire d'effectuer un "from scribus import *", car l'op&eacute;ration a d&eacute;j&agrave; eu lieu. Vous
pouvez utiliser toutes les commandes list&eacute;es dans la section sur l'API du scripteur directement, sans aucun pr&eacute;fixe.</p>

<p>Vous trouverez des pr&eacute;cisions utiles sur chacun des scripts en cliquant sur "Script-&gt;&Agrave; propos du script...".</p>

<p>Vous pouvez afficher le manuel de r&eacute;f&eacute;rence complet du scripteur en s&eacute;lectionnant "Aide-&gt;Manuel du moteur de script...".</p>

</body>
</html>
 
