<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Ma bo&icirc;te &agrave; outils de PAO sous Linux </title>
</head>
<body>
<h2>Ma bo&icirc;te &agrave; outils de PAO sous Linux</h2>
<p>Voici ma s&eacute;lection compl&egrave;te d'outils, bas&eacute;e sur une simple appr&eacute;ciation de la compatibilit&eacute; de ces applications avec Scribus. Si vous ne partagez pas mon avis, je suis pr&ecirc;t &agrave; &eacute;couter une argumentation constructive. Mais soyez pr&eacute;par&eacute; ! Une partie de mon travail quotidien consiste &agrave; &eacute;valuer des applications commerciales similaires pour mes clients. Certaines de ces applications ont &eacute;t&eacute; test&eacute;es dans les limites impos&eacute;es par l'architecture PC moderne. Par exemple : demander &agrave; Xnview de g&eacute;n&eacute;rer 10 000 vignettes d'un coup. Voici donc cette liste, en ordre alphab&eacute;tique :</p>
<ul>
	<li><a href="toolbox1.html">Acrobat Reader</a></li>
	<li><a href="toolbox2.html">Autres visualiseurs PDF</a></li>
	<li><a href="toolbox3.html">Batik</a></li>
	<li><a href="toolbox4.html">Gimp</a></li>
	<li><a href="toolbox5.html">Ghostscript</a></li>
	<li><a href="toolbox6.html">GSview</a></li>
	<li><a href="toolbox7.html">Ghostscript avanc&eacute; &amp; GSview</a></li>
	<li><a href="toolbox8.html">Imagemagick</a></li>
	<li><a href="toolbox9.html">Inkscape</a></li>
	<li><a href="toolbox10.html">KSnapshot</a></li>
	<li><a href="toolbox11.html">Outils de tra&ccedil;age</a></li>
	<li><a href="toolbox12.html">WINE</a></li>
	<li><a href="toolbox13.html">Xnview</a></li>
</ul>

<h4>Une note sur les visualiseurs PDF :</h4>
<p>Un d&eacute;fis avec les visualiseurs PDF et EPS sous Linux est que Scribus cr&eacute;e des PDF 1.4 et 1.6 PS niveau 3 de qualit&eacute; pour l'avenir. Parfois ces caract&eacute;ristiques sont au-del&agrave; des capacit&eacute;s de certains visualiseurs open source. Certaines de ces caract&eacute;ristiques sont n&eacute;cessaires &agrave; une impression commerciale fiable et sont seulement support&eacute;es dans des outils de pr&eacute;-impression ou de PAO commerciaux. Quatre ann&eacute;es de travail avec Scribus m'ont amen&eacute; &agrave; conclure que les trois visualiseurs suivants sont les plus fiables pour l'affichage des PS/EPS/PDF cr&eacute;&eacute;s par Scribus :</p>
<ul>
  <li><strong>Acrobat Reader 7.0.x pour Linux</strong> - Le meilleur et parfois le seul choix pour visualiser des PDF. Pour des notes d&eacute;taill&eacute;es et des conseils : <a href="toolbox1.html">Acrobat Reader de Adobe.</a> </li>
  
  <li><strong>GSview 4.7+</strong> - avec la derni&egrave;re version de Ghostscript. Cette combinaison est la meilleure pour visionner les fichiers EPS, PS et la plupart des fichiers PDF. En plus, GSview offre plusieurs autres possibilit&eacute;s tr&egrave;s utiles avec des modules comme <code>pstoedit</code> et <code>epstool</code>. Pour obtenir plus de renseignements et des conseils : <a href="/index.php&#063;lang=en&#038;sm=dtptoolbox&#038;page=toolbox6">GSview</a>. Je le consid&egrave;re comme un outil essentiel pour la PAO sur Linux.</li>
  <li><strong>Kpdf de KDE 3.4+</strong> - La mise &agrave; jour de ce visualiseur PDF comporte un nouveau moteur de rendu et est capable de visionner les fichiers PDF 1.5. Il y a une grande am&eacute;lioration entre Kpdf 3.3 &#062; Kpdf 3.4. Ce n'est pas pour d&eacute;nigrer Gnome, mais c'est le r&eacute;sultat de mes observations sur les derni&egrave;res versions des deux environnements. </li>
</ul>
<p><strong>Si vous choisissez un autre visualiseur PDF ou EPS qui ne peut pas afficher les PDF de Scribus, et si ces PDF s'affichent correctement dans Acrobat Reader 5+, signalez le probl&egrave;me &agrave; l'auteur de ce visualiseur. Je ne saurais insister trop sur ce point. Dans pratiquement tous les cas que j'ai test&eacute;s, il s'agit d'une limitation de l'application de visualisation. Les PDF de Scribus sont test&eacute;s quotidiennement par des sp&eacute;cialistes des logiciels de pr&eacute;-impression pour valider leur conformit&eacute; aux sp&eacute;cifications PDF publi&eacute;es.</strong></p></div>

</body>
</html>
 
