<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Outils de vectorisation - conversion bitmap vers vectoriel</title>
</head>
<body>
<h2>Outils de vectorisation - conversion bitmap vers vectoriel</h2>

<p>Les programmes ci-dessous sont des outils de vectorisation de diff&eacute;rents types. Si vous travaillez beaucoup sur des images scann&eacute;es,
vous aurez peut-&ecirc;tre besoin de toute la panoplie. Les outils sont tous capables
d'ouvrir des images bitmap pour les convertir vers un format vectoriel. Cette m&eacute;thode peut &ecirc;tre essentielle si vous avez des graphismes devant &ecirc;tre r&eacute;pliqu&eacute;s ou reproduits avec fid&eacute;lit&eacute;. La raison
pour laquelle je propose tous ces outils, c'est qu'ils utilisent des algorithmes de conversion diff&eacute;rents.</p> 

<p><strong>Autotrace / FrontLine</strong> - peuvent utiliser Imagemagick pour convertir vers diff&eacute;rents formats. Frontline est une interface graphique en GTK &agrave; Autotrace, permettant d'acc&eacute;der &agrave; de nombreuses options de la ligne de commande.</p>

<p><strong>Delineate</strong> - Une interface en Java &agrave; Autotrace et Potrace. Son atout est la conversion directe en SVG.</p>

<p><strong>Potrace</strong> - fonctionne en noir et blanc uniquement mais poss&egrave;de une routine de tracage tr&egrave;s efficace. Potrace poss&egrave;de &eacute;galement une interface graphique &eacute;crite en QT 3.x</p>

<p><strong>Pstoedit</strong> - est l&eacute;g&egrave;rement diff&eacute;rent puisqu'il se sp&eacute;cialise dans la conversion des fichiers PostScript vers des formats vectoriels via Ghostscript. Il fonctionne comme greffon dans GSview. </p>

<p>Rappel : ces outils comportent de multiples options pour la conversion; il faut proc&eacute;der &agrave; un minimum d'essais, particuli&egrave;rement pour des graphismes complexes. N'esp&eacute;rez pas la perfection. La premi&egrave;re fois, il m'a fallu quelques tentatives
pour convertir le logo Scribus en EPS avec des parties bitmap en SVG pur, ensuite import&eacute; dans Scribus.</p>

</body>
</html>
 
