<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Ghostscript - La magie de la bo&icirc;te noire</title>
</head>
<body>
<h2>Ghostscript - La magie de la bo&icirc;te noire</h2>

<p>Pour ceux d'entre vous qui ne le savent pas, GhostScript, stricto sensu, est un interpr&eacute;teur PostScript, et nombre de programmes s'en servent pour les conversions PostScript mais aussi pour l'importation/exportation. Comme les autres, Scribus s'appuie sur GhostScript, utilisant parfois les fonctions les plus avanc&eacute;es, disponibles uniquement dans les versions les plus r&eacute;centes. </p>

<p>Du point de vue de Scribus, il y a deux probl&egrave;mes principaux : Ghostscript est une esp&egrave;ce de bo&icirc;te noire accessible en ligne de commande, avec des options parfois obscures ou difficiles &agrave; comprendre. Nombre d'entre elles sont plus accessibles par l'interm&eacute;diaire de GSView, comme d&eacute;taill&eacute; plus loin. Deuxi&egrave;mement, il y a eu bon nombre d'am&eacute;liorations dans les versions 8.x, concernant notamment le support avanc&eacute; de PostScript niveau 3, celui de PDF 1.4 ou encore certaines fonctionnalit&eacute;s d'impression haute qualit&eacute;. La section suivante pr&eacute;sente une fa? possible de mettre &agrave; jour Ghostscript sans d&eacute;truire votre configuration actuelle d'impression CUPS/Foomatic/GIMP.</p>

<p>Bien que GhostScript soit issu d'une soci&eacute;t&eacute; commerciale et propos&eacute; sous une double licence, les d&eacute;veloppeurs sont attentionn&eacute;s envers la communaut&eacute; OSS et ont beaucoup aid&eacute; l'&eacute;quipe Scribus, notamment par le biais de documentation et d'explications sur les fonctionnalit&eacute;s les plus &eacute;sot&eacute;riques. Ghostscript est un des pilier du locigiel OSS. Il serait difficile d'imaginer un logiciel OSS sans lui.</p>

<p>Les p&eacute;riph&eacute;riques (&#034;devices&#034;) dans Ghostscript font r&eacute;f&eacute;rence &agrave; un certain type de pilote ou de module logiciel effectuant certaines conversions ou certaines op&eacute;rations PostScript sp&eacute;ciales.</p>

<p>La prochaine g&eacute;n&eacute;ration de GhostScript inclura un nouveau pilote jet d'encre,<strong>rinkj</strong>, apportant des techniques nouvelles pour une impression optimale sur les imprimantes jet d'encre. De plus, il supportera les formats jpeg2000, aussi nomm&eacute; jasper, pour la compression jpeg sans perte, ainsi que le PDF 1.5. Viendront s'ajouter de nouveaux p&eacute;riph&eacute;riques supportant de nombreuses fonctionnalit&eacute;s avanc&eacute;es de pr&eacute;-impression et d'impression. Scribus sera l'une des premi&egrave;res applications &agrave; b&eacute;n&eacute;ficier de ces am&eacute;liorations. Nous vous encourageons donc &agrave; toujours poss&eacute;der la derni&egrave;re version de GhostScript disponible pour votre syst&egrave;me, et nous invitons les distributions &agrave; migrer vers GPL Ghostscript 8.x. </p>


</body>
</html>
 
