<qt>
<title>Un peu de WINE avec Scribus</title>
<h2>Un peu de WINE avec Scribus</h2>
<h3>Aper&ccedil;u</h3>
<p>Une r&eacute;alit&eacute; du monde de la PAO : il arrive qu'on doive travailler dans un environnement multiplates-formes. Heureusement, pour les utilisateurs Linux en particulier, les projets Wine et Codeweavers ont fait beaucoup de progr&egrave;s pour faire fonctionner de nombreuses applications Windows sous Linux.</p>
<p>Voici l'objet principal des pr&eacute;sentes notes : comment faire fonctionner la derni&egrave;re version d'Adobe Acrobat Reader ainsi que la version compl&egrave;te d'Acrobat pour tester les fichiers PDF g&eacute;n&eacute;r&eacute;s par Scribus, et &eacute;ventuellement faire fonctionner un utilitaire exotique en Windows ou en DOS.</p>
<p>Depuis que j'ai choisi Linux comme environnement de travail par d&eacute;faut, j'ai pass&eacute; beaucoup de temps &agrave; installer diff&eacute;rentes applications Windows et suivi le projet pour diff&eacute;rentes raisons :</p>
<ol><li>Jusqu'aux toutes r&eacute;centes am&eacute;liorations de Gnucash, j'avais besoin d'une application de comptabilit&eacute; pour tenir les comptes de ma propre soci&eacute;t&eacute;. </li>
<li>Professionnellement, je dois tester et r&eacute;diger des supports de formation pour diff&eacute;rentes applications Windows, et j'&eacute;vite autant que possible d'avoir &agrave; red&eacute;marrer sous Windows. </li>
<li>J'ai utilis&eacute; VMware &agrave; une &eacute;poque. Il est superbe, mais est parfois trop gourmand en ressources. </li>
<li>Malheureusement, de nombreux objets multim&eacute;dia sur Internet n&eacute;cessitent une application sous Windows. </li></ol>
<h3>Conseils et mon exp&eacute;rience</h3>
<p>Mon exp&eacute;rience est que les versions "packag&eacute;es" de Wine fonctionnent rarement correctement, &agrave; l'exception des pr&eacute;-versions de Codeweavers. Je construis toujours wine &agrave; partir des sources. Le projet Wine met &agrave; disposition une archive des sources une fois par mois. Avec Wine, il y a une mani&egrave;re de compiler qui diff&egrave;re l&eacute;g&egrave;rement du mode traditionnel :</p>
<code>./configure &amp;&amp; make &amp;&amp; make install</code>
<p>Ce n'est pas &eacute;vident, mais il est possible d'utiliser les scripts d'installation de Wine qui rendent l'installation moins p&eacute;nible. Pour compiler depuis le r&eacute;pertoire dans lequel vous avez extrait l'archive des sources de Wine, ex&eacute;cutez simplement la commande ./tools/wineinstall et suivez les instructions. La compilation des sources est relativement longue, donc choisissez un moment o&ugrave; votre ordinateur est inutilis&eacute;. L'avantage &eacute;vident est que l'installation de Wine sera parfaitement adapt&eacute;e &agrave; votre configuration, aussi bien logicielle que mat&eacute;rielle. Je trouve que le progiciel fonctionne bien mieux ainsi.</p>
<p>Si vous ne voulez vraiment pas l'installer &agrave; partir des sources, t&eacute;l&eacute;chargez les paquetages rpm ou deb de Codeweavers. Leur module inclut &eacute;galement un outil graphique &eacute;l&eacute;gant de configuration permettant de cr&eacute;er le fichier wine.conf, indispensable pour faire fonctionner correctement Wine.</p>
<p>Apr&egrave;s l'installation, vous avez besoin d'un fichier wine.conf. Il est cach&eacute; dans le dossier .wine de votre r&eacute;pertoire personnel. Ouvrez-le dans un &eacute;diteur de texte et &eacute;tudiez-le minutieusement, car de petits changements dans ce fichier peuvent avoir de grandes r&eacute;percussions sur la performance et la stabilit&eacute;. Le fichier est correctement comment&eacute; et &eacute;galement document&eacute;.</p>
<p>Parfois, il y a des r&eacute;gressions : en r&egrave;gle g&eacute;n&eacute;rale, je conserve la version pr&eacute;c&eacute;dente jusqu'&agrave; ce que je sois s&ucirc;r que la nouvelle version fonctionne au moins aussi bien. Une ou deux fois durant les deux derni&egrave;res ann&eacute;es, je suis revenu &agrave; la version pr&eacute;c&eacute;dente, car un composant ne fonctionnait plus.</p>
<p>D&eacute;fauts : le support de l'impression est faible. Vous pouvez toutefois g&eacute;n&eacute;rer du PostScript pour traitement ult&eacute;rieur dans Distiller ou GSview. Wine supporte CUPS si vous avez les bonnes biblioth&egrave;ques install&eacute;es, mais il ne s'agit pas d'un code stable. </p>
<p>Les bonnes choses : les aper&ccedil;us mensuels de Wine de ces derniers mois font fonctionner Adobe Acrobat 5, &agrave; la fois Reader 5.1 et la version compl&egrave;te 5.0.5 de mani&egrave;re tr&egrave;s stable. Apr&egrave;s l'installation, rep&eacute;rez le dossier du plugiciel intertrust et supprimez-le avant d'ex&eacute;cuter Acrobat. Il s'agit d'un module peu fiable permettant l'achat en ligne de fichiers PDF. Lors de mes installations professionnelles d'Acrobat, je m'assure qu'il n'est pas install&eacute;, car il cause souvent des probl&egrave;mes. La partie Distiller de Acrobat, versions 3 &agrave; 5, fonctionne sans probl&egrave;me &agrave; condition qu'elle sache trouver vos polices correctement. J'ai g&eacute;n&eacute;r&eacute; des PDF en CMJN, tr&egrave;s haute r&eacute;solution de 35 Mo sans aucun souci. J'ai &eacute;galement install&eacute; l'extension gratuite PDFInspektor de Callas. Je l'utilise pour v&eacute;rifier la conformit&eacute; PDF/X-3 des sorties PDF/X-3 de Scribus (Ils sont pass&eacute;sd&egrave;s la premi&egrave;re tentative ;))</p>
<p>L'installation d'applications est devenue beaucoup plus fiable ces derni&egrave;res ann&eacute;es. Wine pose des probl&egrave;mes en cas d'installations personnalis&eacute;es. Souvent, il suffit de cliquer sur les valeurs par d&eacute;faut tout au long de l'installation pour voir l'application install&eacute;e correctement. </p>
<h2>Les alternatives</h2>
<h3>Crossover Office de <a href="http://www.codeweavers.com">Codeweavers</a></h3>
<p>Les versions 3.0+ font tourner nombre d'applications de mani&egrave;re satisfaisante, y compris Photoshop 5,6,7, ainsi que, d'apr&egrave;s mes tests, Illustrator 10 et Indesign 2.0.2. Ces deux derni&egrave;res peuvent parfois &ecirc;tre lourdes m&ecirc;me dans un environnement Windows. J'ai trouv&eacute; que la version de d&eacute;monstration avait un installateur soign&eacute; et facile d'utilisation, qui permet une configuration ais&eacute;e. <a href="http://www.codeweavers.com">Codeweavers</a> a &eacute;norm&eacute;ment contribu&eacute; au succ&egrave;s du projet Wine.  Crossover Office est disponible dans certaines versions des distributions Suse et Xandros.</p>
<h3>Win4Lin de <a href="http://win4lin.net/content/">Netraverse</a></h3>
<p><em>Note : <a href="http://win4lin.net/content/">Netraverse</a> a g&eacute;n&eacute;reusement fourni &agrave; l'&eacute;quipe de d&eacute;veloppement Scribus des licences &agrave; des fins de test.</em> </p>
<p>Win4Lin permet de faire tourner Win 2000 ou XP nativement sous Linux, via une couche d'interpr&eacute;tation, avec une vitesse d'ex&eacute;cution et des fonctionnalit&eacute;s proches de l'original, avec tr&egrave;s peu de limitations. Il suffit d'obtenir version sous licence de Win9x et de lancer l'installateur. L'outil fonctionne bien; il a une apparence soign&eacute;e et supporte la plupart des applications Win32 sans probl&egrave;me. </p>

<p>Je ne vous dissuaderai pas de l'acheter. Les deux soci&eacute;t&eacute;s ont des pratiques exemplaires dans la communaut&eacute; Open Source.</p>

<h3>Succ&egrave;s</h3>
<table width="100%"><tr><td align="center"><img src="images/acroreader5.1.png" alt="Acrobat Reader 5.1 sous WINE" /></td></tr></table>

<p>Bien qu'Acrobat 5.0.5 ne soit pas officiellement support&eacute; par Codeweavers, il s'installe et fonctionne tr&egrave;s bien. En attendant le jour o&ucirc; le monde Linux/Unix b&eacute;n&eacute;ficiera des m&ecirc;mes applications commerciales, Wine repr&eacute;sente une bonne strat&eacute;gie de migration. En esp&eacute;rant que ces quelques notes vous seront utiles pour votre utilisation de Scribus.</p>
</qt>

