<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Modificare forme</title>
</head>
<style>
@import "manual.css";
</style>
<body>
<h2>Modificare forme</h2>
<p>Molti degli oggetti che possono essere inseriti in un documento di Scribus sono disegni vettoriali, e come tali possono essere modificati. Anche se il titolo di questa pagina sembra riferirsi alle forme geometriche che possono essere facilmente create con l'apposito comando, gli stessi procedimenti possono essere applicati a tutti i seguenti oggetti:</p>
<ul>
<li>forme;</li>
<li>poligoni;</li>
<li>cornici (di ogni tipo);</li>
<li>linee di contorno;</li>
<li>curve di B&eacute;zier;</li>
<li>linee a mano libera;</li>
<li>contorni creati a partire da glifi di testo;</li>
<li>disegni vettoriali importati, come quelli in formato EPS e SVG.</li>
</ul>
<p>Come forse gi&agrave; sapete o ricordate, quando tenete presente la capacit&agrave; di convertire un oggetto da un tipo a un altro, scoprirete che c'&egrave; una grande flessibilit&agrave; in ci&ograve; che potete fare. Guardate i tre esempi mostrati qui sotto: nel primo abbiamo modificato la forma di una cornice di testo, nel secondo abbiamo preso un glifo di grandi dimensioni, l'abbiamo convertito in contorno e poi in cornice immagine, e nel terzo abbiamo creato un poligono e l'abbiamo convertito in cornice di testo. Lo stato dell'oggetto dopo le operazioni di conversione determina le possibilit&agrave; di modificarlo: cos&igrave; la grande B pu&ograve; essere modificata come qualunque altra cornice immagine, e il testo contenuto nel poligono pu&ograve; essere modificato nell'editor interno.</p>
<table cellpadding=3><tr>
<td><img src="images/edit_shapes.png" alt="Esempi di forme modificate" align=left></td></tr>
</table>

<h3>Propriet&agrave;: Forma</h3>
<table cellpadding=3><tr>
<td><p>Qui a destra &egrave; mostrata la scheda Forma nel pannello Propriet&agrave;, o pi&ugrave; precisamente la sua parte pi&ugrave; importante. L'opzione non mostrata qui (Regola di riempimento) sar&agrave; spiegata pi&ugrave; avanti, in <b>Combinare poligoni</b>. Iniziamo con l'esaminare la voce <b>Angoli arrotondati</b>, poich&eacute; &egrave; una modifica di tipo semplice, che fa ci&ograve; che il nome dice. La casella di controllo &egrave; attiva, e questo ci dice che l'oggetto a cui si riferisce &egrave; una cornice &ldquo;normale&rdquo; (di testo, immagine, rendering) oppure &egrave; la forma rettangolare (non il poligono a 4 lati). Il valore nella casella &egrave; il raggio dell'angolo, e potete aumentarlo finch&eacute; due angoli arrotondati adiacenti si incontrano: se ad esempio iniziate con un quadrato, finirete con un cerchio. Un rettangolo assumer&agrave; l'aspetto di una capsula con lati appiattiti ed estremit&agrave; arrotondate. Quest'operazione si pu&ograve; applicare allo stesso modo a cornici di testo o immagine.</p></td>
<td rowspan=2><img src="images/prop_shape.png" alt="Proprietà: Forma" align=right></td>
</tr>
<tr><td><img src="images/round_rectangle.png" alt="Rettangolo arrotondato" align=left></td></tr>
</table>
<table cellpadding=3><tr>
<td><p>Un'altra facile operazione di modifica si pu&ograve; eseguire dall'icona con la freccia verso il basso, vicino al pulsante <b>Modifica</b>. Il men&ugrave; a discesa che si apre &egrave; lo stesso, ben noto, dell'icona Inserisci forma sulla barra degli strumenti, ma in questo caso il risultato &egrave; una trasformazione, non la creazione di una nuova forma. Quindi, se volessimo, potremmo convertire la nostra capsula in un Tux accovacciato e obeso.</p>
<p>Questo si pu&ograve; fare anche con cornici di testo e di altro tipo, anche se una cornice di testo a forma di Tux sar&agrave; probabilmente di scarsa utilit&agrave;.</p>
</td>
<td><img src="images/squat_tux.png" align=left></td></tr>
</table>
<h3>Il pulsante Modifica</h3>
<table cellpadding="3">
<tr>
<td align=center width=200><img src="images/shape_edit.png"></td>
<td  colspan="2"><p>Passiamo ora al &ldquo;piatto forte&rdquo;, e cio&egrave; alla modifica di una forma o cornice per mezzo dei suoi nodi e punti di controllo. Quando premete il pulsante <b>Modifica</b> nella scheda Forma, si apre la finestra di dialogo <b>Nodi</b> mostrata a destra e la forma si trasforma in qualcosa di simile a ci&ograve; che vedete qui a sinistra, con quei cerchietti di colore blu e magenta.</p>
<p>Una cosa da notare subito &egrave; che in genere dove c'&egrave; un angolo sono visibili soltanto i nodi blu, ma dove c'&egrave; una curva si vedono anche i punti di controllo color magenta, che sporgono dal nodo come antenne. In realt&agrave; tutti i nodi hanno dei punti di controllo, ma quando si trovano nella stessa posizione del nodo non sono visibili.</p></td>
</tr>
<tr><td></td><td><img src="images/node_edit_close.png" ALIGN=right></td><td rowspan=2 valign="top"><img src="images/nodes_edit.png"></td>
</tr>
<tr><td colspan=2><p>Per descrivere l'uso della finestra di dialogo per la modifica delle forme, usiamo la numerazione mostrata qui sopra per indicare i vari pulsanti che vi si trovano.</p>
<p>Quando la finestra viene aperta, il pulsante <b>1</b> &egrave; selezionato, e questo vi permette di spostare i nodi blu con il mouse. Oltre a spostare nodi singoli, potete fare clic e trascinare una porzione di linea compresa tra due nodi, e spostarla insieme ai suoi nodi. La porzione di linea trascinata mantiene la sua misura, forma e orientamento; sono i segmenti adiacenti ad essere adattati allo spostamento.</p>
<p>Se premete il pulsante <b>5</b> potete spostare i punti di controllo color magenta. Quando fate clic su un nodo o punto di controllo, esso diventa rosso, e a questo punto, oltre a spostarlo col mouse, le caselle di controllo <b>Pos X</b> e <b>Pos Y</b> si attivano e indicano la posizione del punto selezionato. Se <b>Coordinate assolute</b> <b><i>non</i></b> &egrave; contrassegnato, i valori sono relativi all'angolo superiore sinistro del &ldquo;riquadro di delimitazione&rdquo; della forma o della cornice (<i>vedi Che cos'&egrave; il riquadro di delimitazione? pi&ugrave; avanti</i>). Ricordiamo che tutte le modifiche fatte possono essere annullate con <b>Ctrl-Z</b> se cambiate idea.</p>
<p>Il pulsante <b>2</b> permette di aggiungere nodi; i nuovi nodi devono trovarsi in qualche punto lungo il bordo della forma. Il pulsante <b>3</b> elimina i nodi su cui fate clic dopo averlo selezionato. Il suggerimento del pulsante <b>4</b> dice <i>Azzera punti di controllo</i>, ma non &egrave; chiaro come renderlo attivo.</p>
<p>Il pulsante <b>6</b>, una volta premuto, permette di spostare in modo indipendente ciascun punto di controllo. Se viene premuto il pulsante <b>7</b>, i due punti di controllo di un certo nodo si dispongono su lati opposti del nodo e a uguali distanze, non appena uno di essi viene spostato. Questo tende a far s&igrave; che la linea che attraversa il nodo sia una curva uniforme e priva di spigoli. Quando un punto di controllo &egrave; selezionato, il pulsante <b>8</b> &egrave; attivo e se viene premuto, il punto di controllo viene riportato nella posizione del suo nodo.</p>
<p>Il pulsante <b>9</b> apre la curva o forma, spezzandone il contorno. Premete il pulsante e poi fate clic su un punto del contorno a scelta: sembrer&agrave; che sia stato creato un nodo, come accade premendo il pulsante <b>2</b>, ma in realt&agrave; ne sono stati creati due, e se ne spostate uno vedrete che il contorno &egrave; stato spezzato. Il pulsante <b>10</b> esegue l'operazione contraria, unendo gli estremi liberi di una curva o forma spezzata (<i>e pu&ograve; anche essere usato per ottenere una figura chiusa a partire da una curva di B&eacute;zier</i>).</p>
<p>I pulsanti non numerati della terza riga (dopo il <b>10</b>) ribaltano la forma in senso orizzontale e verticale rispettivamente.</td>
</tr></table>
<h3>Distorsione</h3>
<table cellpadding=3><tr>
<td><p>I pulsanti nella prima riga al di sotto di quelle numerate eseguono le operazioni di distorsione. Ciascun clic su un pulsante distorce la forma di un piccolo ammontare. Qui vediamo i risultati della distorsione usando i quattro pulsanti in ordine da sinistra a destra, dove ciascuno &egrave; stato premuto 10 volte. All'inizio il lato superiore di tutte le quattro forme aveva la stessa posizione Y.</p></td>
<td><img src="images/skewing.png" alt="Esempio di distorsione"></td>
</tr></table>
<h3>Rotazione, allargamento, riduzione</h3>
<p>Sotto le quattro file di pulsanti si trovano tre caselle di controllo affiancate a sinistra da pulsanti. Le loro funzioni sono piuttosto intuitive, e i due pulsanti svolgono azioni opposte, per la rotazione, e per due modi di allargare o restringere: uno in base a percentuale e l'altro in base a un valore in punti. Ciascun clic su un pulsante provoca una modifica di ammontare pari a quello indicato nella casella di controllo.</p>
<p></p>
<h3>Che cos'&egrave; il riquadro di delimitazione?</h3>
<table cellpadding=3><tr>
<td><img src="images/boundingbox.png" align=left></td>
<td><img src="images/boundingbox1.png" align=left></td>
<td><p>Il <i>riquadro di delimitazione</i> &egrave; lo spazio rettangolare che definisce i confini di una forma e tutti i suoi componenti descrittivi. Vediamo questo concetto illustrato nella prima immagine a sinistra, che evidenzia che il riquadro di delimitazione &egrave; molto pi&ugrave; grande della forma vera e propria. Quando passiamo alla modalit&agrave; modifica, come mostrato nell'immagine accanto, vediamo che il riquadro di delimitazione comprende sempre tutti i punti di controllo della forma.</p>
<p>C'&egrave; una limitazione per i valori di <b>Pos X</b> e <b>Pos Y</b>, che non possono diminuire a meno di 0,0 quando sono riferiti al riquadro di delimitazione, quindi con le caselle di controllo non sar&agrave; possibile spostare nodi o punti di controllo a coordinate minori di questo valore. Tuttavia essi possono essere spostati con il mouse e l'angolo superiore sinistro del riquadro di delimitazione sar&agrave; allora riposizionato. Una soluzione alternativa pu&ograve; essere l'uso di <b>Coordinate assolute</b>, poich&eacute; i loro valori possono essere anche negativi.</p>
<p><b>Intorno al riquadro di delimitazione</b> &egrave; una delle possibilit&agrave; per il flusso del testo intorno alle cornici, come si vede nell'immagine della scheda Forma.</p>
</td>
</tr></table>
<br clear=all>
<h3>E infine: che cos'&egrave; la linea di contorno?</h3>
<p>O forse dovremmo dire: a che serve? La linea di contorno non &egrave; mai visibile, tranne in questa modalit&agrave; di modifica. Immaginiamo di avere una cornice o forma non rettangolare, e di voler far scorrere il testo intorno a essa, ma senza seguire il contorno della cornice o della forma. Anche se &egrave; una forma e ha un riquadro di delimitazione, quest'ultimo potrebbe non essere ci&ograve; che vogliamo; quindi possiamo usare una linea di contorno per far fluire il testo intorno a essa nel modo che vogliamo. Mentre si modifica la linea di contorno, il flusso del testo si adatta alle modifiche, e questo rende pi&ugrave; facile ottenere l'aspetto desiderato.</p>
<table cellpadding=3><tr>
<td><img src="images/frame_shape_flow.png" align=left></td>
<td><img src="images/contourline_flow.png" align=left></td>
</tr></table>
<p>La linea di contorno non &egrave; considerata parte dei componenti dell'immagine, quindi i suoi nodi e punti di controllo possono trovarsi anche fuori dal riquadro di delimitazione.</p>
<h3>Combinare poligoni</h3>
<p>Quest'operazione si applica sia ai poligoni che alle forme e a poligoni e forme insieme. L'idea &egrave; quella di combinare due o pi&ugrave; forme che si trovano a quote diverse per ottenerne una sola.</p>
<table cellpadding=3><tr>
<td><img src="images/combine_polygons.png"></td>
<td><img src="images/combine_polygons1.png"></td>
<td><img src="images/combine_polygons3.png"></td>
</tr></table>
<p>Le immagini qui sopra mostrano la situazione iniziale, con una forma sovrapposta a un poligono, e la forma &egrave; dotata di trasparenza. Nell'immagine centrale selezioniamo i due oggetti facendo clic e trascinando il mouse intorno a entrambi, poi selezioniamo <b>Elemento > Combina poligoni</b> nel men&ugrave; principale, e il risultato &egrave; quello dell'immagine a destra. Con questo metodo i colori derivano dall'oggetto inferiore.</p>
<table><tr>
<td><img src="images/combine_polygons2.png"></td>
<td><img src="images/combine_polygons4.png"></td>
<td><img src="images/combine_polygons5.png"></td>
</tr></table>
<p>Nell'immagine qui sopra a sinistra, abbiamo selezionato le forme tenendo premuto il tasto Maiusc e facendo clic prima sulla forma a croce, e poi abbiamo combinato le due forme; in questo modo, anche combinando pi&ugrave; di due forme, i colori derivano dal primo oggetto su cui si &egrave; fatto clic. L'immagine centrale mostra che il poligono combinato ha conservato la trasparenza. A destra vediamo i risultati di <b>Elemento > Dividi poligono</b>. &Egrave; sconsigliato annullare l'operazione di combinazione di poligoni, poich&eacute; i risultati possono essere imprevedibili, e in certi casi potrebbero anche causare una chiusura inattesa del programma.</p>
<p>Un altro particolare da notare &egrave; che nelle immagini dell'ultima fila, la combinazione pi&ugrave; a sinistra usa una <b>regola di riempimento pari-dispari</b> e quella centrale usa una regola <b>non zero</b>. La scelta tra le due regole di riempimento si trova nella scheda Forma e <i>si applica dopo aver combinato i poligoni</i>.</p>
<h3>Operazioni del tracciato</h3>
<p>Queste sono modi pi&ugrave; sofisticati di combinare forme e poligoni. Possono essere applicate soltanto a forme e poligoni, non a cornici di testo o immagine, ma la conversione in cornici di questi due tipi &egrave; sempre possibile successivamente.</p>
<table><tr><td><img src="images/pathops.png" alt="pathops.png" align=right></td>
<td><p>Iniziamo con questa situazione, due forme semplici. Prima di tutto, selezionatele entrambe, e poi, nel men&ugrave; principale, scegliete <br><b>Elemento &gt; Strumenti tracciato &gt; Operazioni del tracciato...</b>
<br>Se non selezionate entrambe le forme, questa opzione nel men&ugrave; sar&agrave; disattivata.</p></td>
</tr><tr>
<td valign="top"><img src="images/pathops1.png" alt="pathops1.png" align=left></td>
<td valign="top"><p>Si apre la finestra di dialogo mostrata qui a sinistra.
<br>Notate che un colore &egrave; stato assegnato alla forma a ciambella. Questo avviene soltanto per mostrare pi&ugrave; chiaramente il risultato dell'operazione. Se nessuna delle due forme avesse un colore di riempimento, verrebbero loro assegnati colori contrastanti. <b>Scambia forme</b> non fa altro che scambiare la posizione delle due forme, cosicch&eacute; la prima forma diviene la seconda.</p>
<p>Manteniamo l'operazione predefinita, che consiste nel combinare le forme. Vediamo qui a destra che dobbiamo scegliere il colore della forma combinata; come per <i>Combina poligoni</i>, la forma finale pu&ograve; avere un solo colore di <b>contorno</b> e un solo colore di <b>riempimento</b>. Come vedete, vi &egrave; un'opzione <b>Colori personalizzati </b> che permette di scegliere altri colori per entrambi.</p>
<p>E l'opzione <b>Conserva</b>? Se selezionata, conserva gli elementi della forma. La differenza &egrave; illustrata dagli esempi qui sotto.</p>
<p>A sinistra viene mostrato il risultato quando <b>Conserva</b> <i>non</i> è selezionato, e a destra quando <i>lo&nbsp;&egrave;</i>. In quest'esempio abbiamo mantenuto i colori della prima forma.</p>
<table><tr><td><img src="images/pathops2.png" alt="pathops2.png"></td><td><img src="images/pathops3.png" alt="pathops3.png"></td>
</tr></table>
</td>
</tr></table>
<h4>Altre operazioni</h4>
<table>
<tr><td align=center><p><b>Sottrazione</b></p></td><td align=center><p><b>Intersezione</b></p></td><td align=center><p><b>Esclusione</b></p></td><td align=center><p><b>Divisione</b></p></td></tr>
<tr><td><img src="images/pathops4.png" alt="pathops4.png"></td><td><img src="images/pathops5.png" alt="pathops5.png"></td><td><img src="images/pathops6.png" alt="pathops6.png"></td><td><img src="images/pathops7.png" alt="pathops7.png"></td>
</tr>
</table>
<p>
<table>
<tr><td></td><td align=center><p><b>Forme divise e poi separate</b></p></td></tr>
<tr><td width=450px Valign=top><p>La <b>divisione</b> ha alcune caratteristiche interessanti. Sopra abbiamo detto che la forma risultante pu&ograve; avere un solo colore di riempimento, ma qui non sembra che sia cos&igrave;. A differenza di tutte le altre opzioni, con la <i>Divisione</i> si pu&ograve; indicare un colore per l'<i>intersezione</i> delle due forme, e in questo caso abbiamo scelto un colore personalizzato. <i>Divisione</i> significa proprio questo: abbiamo ottenuto tre forme distinte, ciascuna delle quali pu&ograve; essere spostata e separata dalle altre. La conversione di queste forme in altri tipi di cornice &egrave; sempre possibile, come mostrato qui; notate inoltre che la forma in alto a destra &egrave; una cornice immagine fatta di due &ldquo;pezzi&rdquo;.</p>
<p>Per finire, osserviamo che con le <i>operazioni del tracciato</i> l'<b>annullamento</b> avr&agrave; probabilmente degli effetti, ma non annulla le operazioni eseguite qui.</p></td>
<td COLSPAN=3><img src="images/pathops8.png"></td>
</tr>
</table>
<h3>Crea tracciato dal contorno</h3>
Quando <i>una sola</i> forma &egrave; selezionata, in <b>Elemento &gt; Strumenti tracciato</b> &egrave; attiva questa voce. Il nome di quest'operazione &egrave; forse un po' oscuro, quindi &egrave; pi&ugrave; utile mostrare semplicemente ci&ograve; che fa.
<table width=70% cellpadding=10><tr>
<td><img src="images/pathtools.png"></td>
<td><p>Per farlo, creiamo una forma rettangolare, e aumentiamo lo spessore del suo contorno a 10 punti.<br>Ora selezionate <br><b>Elemento &gt; Strumenti tracciato &gt; Crea tracciato dal contorno</b>:<br>probabilmente vi sembrer&agrave; che nulla sia accaduto, tranne che per il fatto che se la forma aveva un colore di riempimento, esso &egrave; scomparso. Ora cambiate il colore di riempimento da <i>Nessuno</i> a un altro colore, nel nostro caso il rosso, aumentate il livello d'ingrandimento e osservate il rettangolo da vicino.</p></td></tr>
<tr><td><img src="images/pathtools1.png"></td>
<td><p>Guardando l'angolo superiore sinistro del rettangolo, qui visto con un ingrandimento di circa il 900%, cominciamo a capire ci&ograve; che &egrave; successo. Lo spazio che inizialmente era il bordo (contorno) &egrave; divenuto il riempimento, e lungo il suo bordo &egrave; stato creato un contorno (lo spessore del contorno &egrave; stato aumentato a 1 punto, in modo da renderlo pi&ugrave; visibile).</p>
<p>Se all'inizio il contorno fosse stato rosso, anche il nuovo contorno sarebbe rosso.</p></td></tr>
<tr><td><img src="images/pathtools2.png"></td>
<td><p>Per capire ancor meglio ci&ograve; che &egrave; successo, convertiamo l'oggetto in cornice immagine e carichiamovi un'immagine. Ora vediamo che lo spazio occupato dalla cornice coincide con quello del contorno originario, quindi abbiamo creato una cornice con un'immagine a partire dal rettangolo originario.</p></td>
</tr></table>
</body>
</html>
