<html>
<head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
        <title>Esportare PDF da Scribus</title>
</head>
<body>
<h2>Esportare PDF da Scribus</h2>

<h3>Panoramica</h3>

<p>La potenza e la versatilit&agrave; di Scribus nell'esportazione di documenti PDF (Portable Document Format) &egrave; una delle sue caratteristiche pi&ugrave; notevoli. L'indipendenza del PDF dalla piattaforma fa s&igrave; che gli utilizzatori di Scribus possano superare alcune potenziali barriere tra le procedure di lavoro &ldquo;tradizionali&rdquo; e quelle che utilizzano strumenti open source. Scribus esporta in modo affidabile documenti PDF di alta qualit&agrave; e &ldquo;pronti per la stampa&rdquo;, con propriet&agrave; PDF avanzate, formati PDF/X-1a o PDF/X-3 conformi alle specifiche ISO.</p>
<p>Se la sola capacit&agrave; di Scribus fosse quella di creare PDF ad alta risoluzione per la stampa commerciale, ci&ograve; basterebbe a renderlo una grande applicazione. Ma Scribus ha una versatilit&agrave; e una facilit&agrave; d'uso che lo rendono ancora pi&ugrave; utile, ad esempio con la capacit&agrave; di creare presentazioni in stile PowerPoint, moduli PDF interattivi utilizzabili sul web o per lo scambio di documenti in formato elettronico, o la possibilit&agrave; di utilizzare il JavaScript per controllare il comportamento di determinati elementi contenuti nel PDF. Inoltre Scribus fornisce altre utili funzioni, come annotazioni, segnalibri e la possibilit&agrave; di crittografare documenti.</p>
<p>Le molteplici capacit&agrave; di Scribus con il formato PDF permettono di adattare un determinato documento per usi diversi. Lo stesso documento pu&ograve; essere esportato per la stampa, per la pubblicazione sul web, oppure come presentazione. Che questa sia una tendenza del futuro nell'industria editoriale &egrave; mostrato dal fatto che Adobe InDesign segua la stessa strategia, e dalle nuove capacit&agrave; PDF in QuarkXPress o in Adobe Illustrator. Per venire incontro alle nuove esigenze dell'editoria, sono state aggiunte nuove capacit&agrave; allo standard PDF, che spesso permettono di superare le limitazioni dell'HTML e del PostScript tradizionale.</p>
<p>Quando visualizzate o stampate  un documento PDF, potete ottenere i migliori risultati con la pi&ugrave; recente versione di <a href="toolbox1.html">Adobe Reader</a>.</p>

</body>
</html>
