<html>
<head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
        <title>PDF/X-3</title>
</head>
<style>
@import "manual.css";
</style>
<body>
<h2>PDF/X-3</h2>
<p>La capacit&agrave; di esportare in formato PDF/X-3 &egrave; stata una tappa molto importante nello sviluppo di Scribus. Lo ha reso la prima applicazione di impaginazione in grado di gestire questo esigente, ma aperto, standard ISO (ISO 15930-3:2002).</p>

<h3>Quando dovrei usare il PDF/X-3?</h3>
<p>Quando volete ottenere una riproduzione del colore <strong>molto</strong> precisa <strong>e</strong> la vostra tipografia accetta (o richiede esplicitamente) file PDF/X-3. Se la vostra tipografia non &egrave; in grado di utilizzare questo formato, &egrave; probabile che nel prodotto finale i colori risultino alterati, rischio che &egrave; molto minore con file PDF di tipo pi&ugrave; tradizionale.</p>

<h3>Il PDF/X-3 e la gestione del colore</h3>
<p>Il principale beneficio del PDF/X-3 &egrave; che tipicamente il colore viene convertito in modo pi&ugrave; accurato dal modello RGB al modello CMYK utilizzato dalla macchina tipografica. Si ottiene una maggiore accuratezza perch&eacute; si mantiene il colore RGB fino a uno stadio avanzato del processo di stampa, e la conversione da RGB a CMYK viene eseguita dal RIP della macchina tipografica stessa, <b>e inoltre</b> perch&eacute; l'uso dei profili colore &egrave; obbligatorio. Poich&eacute; il RIP conosce in dettaglio l'esatta gamma di colore della macchina, lo si considera in grado di offrire, nella maggior parte dei casi, una conversione accurata. Il PDF/X-3 non impedisce di utilizzare immagini CMYK, ma &egrave; ideale per conservare i colori RGB il pi&ugrave; a lungo possibile nel processo.</p>
<p>Un problema da considerare &egrave; quale profilo colore utilizzare. Vi sono due strategie: la prima &egrave; quella di ottenere dalla tipografia il profilo ICC adatto per il particolare tipo di carta che sar&agrave; impiegato. La seconda consiste nel servirsi di uno standard per la stampa ben conosciuto, come SWOP, ECI o altri. L'uso del PDF/X-3 rende necessaria la collaborazione della tipografia, ma pu&ograve; realmente migliorare la corrispondenza dei colori nella stampa. Come sempre, una breve visita alla vostra tipografia <strong>prima di iniziare il lavoro</strong> &egrave; fortemente consigliata. Se non ottenete risposte, provate con un'altra. La stampa &egrave; un settore competitivo, e quasi sempre &egrave; possibile trovare delle alternative.</p>

<h3>Guida rapida alla creazione di un PDF/X-3</h3>
<p>Nelle <a href="settings1.html">Impostazioni documento</a> controllate che la gestione del colore sia attivata e che siano stati selezionati i corretti profili colore. La situazione ideale &egrave; che il profilo colore per la stampa corrisponda a una condizione di stampa definita da uno standard ISO, o che esso sia fornito dalla vostra tipografia. Se la gestione del colore non &egrave; attiva, non &egrave; possibile esportare in PDF/X-3. Poi selezionate <i>File&nbsp;&#062; Esporta&nbsp;&hellip;&#062; Salva come PDF&nbsp;&hellip;</i>, oppure fate clic sull'icona PDF nella barra degli strumenti.</p>
<p>Si apre questo pannello, in cui dovete selezionare &ldquo;PDF/X-3&rdquo; dal men&ugrave; a discesa &ldquo;Compatibilit&agrave;&rdquo; come mostrato qui sotto. Le impostazioni predefinite cambieranno automaticamente.</p>
<table width="100%"><tr><td align="center"><img src="images/pdfx3-1.png" alt="Scheda Generale nella finestra di creazione PDF" /></td></tr></table>
<p>Poi passate alla scheda &ldquo;Colore&rdquo;, come mostrato qui sotto:</p>
<table width="100%"><tr><td align="center"><img src="images/pdfxcolor.png" alt="Scheda Colore nella finestra di creazione PDF" /></td></tr></table>
<p>Notate che nella scheda &ldquo;Colore&rdquo; la scelta della destinazione del documento &egrave; disattivata. Il motivo &egrave; che quando si utilizza il PDF/X-3, la conversione allo spazio colore della macchina tipografica si presume che avvenga il pi&ugrave; tardi possibile, e ci&ograve; significa che la conversione sar&agrave; eseguita dalla tipografia, e non da voi.</p>
<p>Poi selezionate la scheda &ldquo;Pre-Stampa&rdquo;, come mostrato sotto:</p>
<table width="100%"><tr><td align="center"><img src="images/pdfxintent.png" alt="Scheda PDF/X-3 nella finestra di creazione PDF" /></td></tr></table>
<p>Questa &egrave; la fase in cui inserite nel PDF la condizione di stampa desiderata, che &egrave; definita dal profilo colore ICC. Questa &egrave; probabilmente la scelta pi&ugrave; importante per quanto riguarda i profili colore, perch&eacute; influenza il colore nel corso dell'intero processo. Potete anche inserire una breve nota sul documento, che potrebbe essere utile in seguito. <strong>Questo campo non pu&ograve; restare vuoto, poich&eacute; &egrave; richiesto dalle specifiche tecniche PDF/X-3. Se questo campo &egrave; vuoto, Scribus disabilita il pulsante &ldquo;Salva&rdquo;.</strong> Potete anche aggiungere altri elementi per la prestampa, come barre di colore o segni per la stampa, ma dovreste farlo soltanto se la vostra tipografia li richiede.<p>
<p>Nota: a causa dei rigorosi requisiti del PDF/X-3, alcune caratteristiche del formato PDF sono disabilitate, tra cui annotazioni, crittografia ed effetti di presentazione; tutti i caratteri sono automaticamente incorporati o inseriti come sottoinsieme. Inoltre le trasparenze non vengono esportate.</p>

</body>
</html>
