<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Adobe Reader </title>
</head>
<A>
<h2>Adobe Reader</h2>

<p>Adobe Reader &egrave; uno degli strumenti essenziali da usare con Scribus. Serve principalmente per visualizzare documenti, ma ha alcune funzioni avanzate che non sono presenti in alcun altro visualizzatore PDF, come la piena capacit&agrave; di eseguire JavaScript con documenti PDF e quella di fornire informazioni dettagliate su ci&ograve; che &egrave; incorporato nel PDF. Alcuni documenti possono essere visualizzati in modo affidabile soltanto in Adobe Reader.</p>

<p>In generale, non consigliamo di valutare la correttezza del colore nell'applicazione Anteprima di Mac o nei visualizzatori PDF open source o gratuiti.</p>

<p>Inoltre, anche se il PDF &egrave; divenuto uno standard ISO, la Adobe ha inventato il PostScript e il PDF, che &egrave; basato sul PostScript, e ha un incentivo commerciale a promuovere il PDF e il rispetto degli standard su tutte le piattaforme.</p>
<h3>Suggerimenti per gli utenti di Scribus:</h3>
<p><strong>Consigliamo fortemente di aggiornarvi alla pi&ugrave; recente versione di Adobe Reader</strong>. In poche parole, non esiste nient'altro con migliori capacit&agrave; di visualizzare correttamente i documenti PDF. Per quante obiezioni possiate avere nei confronti delle versioni pi&ugrave; vecchie (e ve n'erano di sostanziali, soprattutto su Linux), nelle versioni successive, specialmente dopo la 7.0.9, la grande maggioranza dei problemi &egrave; risolta. E anche se spesso &egrave; liquidato come &ldquo;divora-risorse&rdquo;, &egrave; molto pi&ugrave; stabile, contiene meno errori e viene caricato pi&ugrave; velocemente rispetto alle versioni pi&ugrave; vecchie. Su Linux ora ha un aspetto moderno. Le versioni dopo la 7.0.9 sono in grado di stampare direttamente tramite CUPS e offrono molte opzioni aggiuntive per la stampa. <strong>Se riscontrate problemi con documenti PDF generati da Scribus quando vengono aperti in altri visualizzatori, dovreste controllare se sono presenti anche su Reader 7 o successivo, prima di considerarli errori e segnalarli al team di Scribus.</strong></p>
<p>Uno dei principali vantaggi delle pi&ugrave; recenti versioni di Adobe Reader &egrave; la capacit&agrave; di &ldquo;appiattire&rdquo; le trasparenze nei file PDF 1.4+. Questa caratteristica &egrave; importante, perch&eacute; vi sono tipografie non in grado di stampare PDF con trasparenze; inoltre gli standard PDF/X precedenti alla versione X-4, che oggi sono richiesti da molte tipografie, non consentono l'uso di trasparenze. Anche se l'appiattimento da PDF a PDF &egrave; presente solo in Adobe Acrobat, Adobe Reader permette di creare un file PostScript &ldquo;appiattito&rdquo; tramite la finestra di dialogo di stampa. Il file PostScript cos&igrave; ottenuto pu&ograve; essere riconvertito in PDF con GSview o con uno strumento da riga di comando.</p>
<h4>Problemi noti</h4>
<p>Siamo informati che possono verificarsi errate corrispondenze di colore quando si visualizzano PDF con qualche tipo di trasparenza in file PDF 1.4+. La Adobe &egrave; stata informata di questo problema.</p>
<p>Dovreste sempre fare in modo che le vostre applicazioni siano aggiornate alla versione pi&ugrave; recente, per evitare che il vostro sistema divenga non sicuro. Nonostante i loro grandi vantaggi, il formato PDF in generale e Adobe Reader in particolare sono divenuti obiettivi di spicco per creatori di software maligno e attacchi via JavaScript. In base alla vostra situazione, potrebbe essere consigliabile disabilitare l'esecuzione di JavaScript nei vostri visualizzatori PDF quando questa funzione non vi serve.</p>
<h3>Nota per gli utenti di OS/2 ed eComStation</h3>
<p>Purtroppo la Adobe non fornisce pi&ugrave; nuove versioni di Adobe Reader per OS/2. L'ultima versione che, a quanto risulta, funziona su queste piattaforme &egrave; la 5.1, e richiede un ambiente di runtime aggiuntivo. L'ambiente di runtime pu&ograve; essere prelevato <a href="http://www.os2site.com/sw/dev/InnoTek/innotekruntime_112b20.exe">qui</a>. Il programma di installazione di AR si trova <a href="http://www.os2site.com/sw/util/pdf/os2kitacrobatreader51preview1.exe">qui</a>.</p>
<br>
<br>
</body>
</html>
