<html>
<head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
<title>Strumenti per PDF e PostScript</title>
</head>
<body>
<h2>Strumenti per PDF e PostScript</h2>
<h3>Visualizzatori PDF e PostScript</h3>
<p><a href="toolbox1.html">Adobe Reader</a> &egrave; il pi&ugrave; affidabile tra i visualizzatori PDF, ma &egrave; giustamente noto come un &ldquo;divora-risorse&rdquo;, e pu&ograve; aprire soltanto file PDF. Per una veloce anteprima dei documenti PDF, alcuni utenti potrebbero preferire un programma pi&ugrave; veloce; esistono molti visualizzatori PDF alternativi, ma soltanto due sono consigliati dal team di Scribus:</p>
<ul>
<li><a href="http://okular.kde.org/">Okular</a> &egrave; diventato il visualizzatore di documenti predefinito nell'ambiente desktop KDE 4. Per quanto riguarda la compatibilit&agrave; con le caratteristiche del formato PDF, Okular &egrave; sorprendentemente vicino ad Adobe Reader, anche se non &egrave; ancora in grado di gestire correttamente documenti PDF nello spazio colore CMYK con la gestione del colore attiva. Ci&ograve; che rende  Okular ancora pi&ugrave; interessante, oltre alle sue capacit&agrave; PDF, &egrave; il lungo elenco di formati di file che &egrave; in grado di aprire e convertire: PDF, PostScript, EPS, DjVu, DVI, G3 Fax, e inoltre molti formati di immagine.</li>
<li>Un altro affidabile visualizzatore e convertitore &egrave; GSview, le cui caratteristiche sono descritte in un <a href="toolbox6.html">apposito capitolo</a>.</li>
</ul>
<h4>Visualizzatori PDF per Haiku</h4>
<p>La Adobe non ha mai realizzato una versione di Acrobat/Adobe Reader per BeOS o Haiku. Come alternativa potete usare <a href="http://sourceforge.net/projects/bepdf/?source=directory">BePDF</a> o <a href="http://haikuware.com/directory/view-details/productivity/utilities/documentviewer">DocumentViewer</a>.</p>
<h3>Editor PDF</h3>
<p>Il formato PDF fu ed &egrave; progettato per essere una specie di &ldquo;carta elettronica&rdquo;, il che significa che non &egrave; fatto per essere modificabile. Ma, pi&ugrave; il PDF si diffuse, pi&ugrave; apparvero situazioni in cui aveva senso modificare questi file &ldquo;non modificabili&rdquo;: ad esempio correzioni di refusi all'ultimo minuto, o il riordinamento di pagine in una pubblicazione destinata alla stampa. La Adobe, che aveva inventato il PDF, prese l'iniziativa e svilupp&ograve; Acrobat, che &egrave; tuttora il pi&ugrave; importante programma per la modifica di PDF. Ma le specifiche tecniche del formato PDF sono aperte, e anche altri cominciarono a lavorarci; oggi esistono innumerevoli strumenti, open source e non, che permettono di modificare i file PDF. Ecco un elenco di programmi open source consigliati per l'editing PDF.</p>
<ul>
<li><a href="http://multivalent.sourceforge.net">Multivalent</a> e <a href="http://www.accesspdf.com/pdftk">PDF Toolkit (pdftk)</a> sono entrambi strumenti da riga di comando basati su Java, con numerose opzioni per la manipolazione di file PDF.</li>
<li><a href="http://pdfedit.petricek.net/index_e.html">PDF Edit</a> &egrave; un insieme di script Qt per manipolare file PDF, ma gli script sono &ldquo;nascosti&rdquo; dietro un'interfaccia grafica, quindi i file vengono modificati in modalit&agrave; WYSIWIG (&ldquo;What you see is what you get&rdquo;: quello che vedi &egrave; quello che &egrave;). PDF Edit permette di apportare molte modifiche dirette al contenuto di un file PDF, tra cui modifiche al testo o ai colori ed eliminazione di contenuto. Il programma &egrave; basato su Qt3, ma alla data in cui questa guida &egrave; stata scritta gli sviluppatori stanno lavorando per portarlo su Qt4.</li>
<li><a href="http://jpdftweak.sourceforge.net">jPDF Tweak</a>, un programma in Java, &egrave; stato giustamente definito il &ldquo;coltellino svizzero&rdquo; dei PDF. Per la modifica dei PDF utilizza la libreria iText, che ha un elevato grado di affidabilit&agrave;.</li><br>
<table width="100%"><tr><td align="center"><img src="images/tb-jpdf.png" alt="jPDF Tweak" title="jPDF Tweak" /></td></tr></table><br>
<li><a href="http://www.pdfsam.org">PDF Split and Merge (PDF SaM)</a> &egrave; ancora pi&ugrave; potente di jPDF Tweak e si &egrave; dimostrato un valido strumento in ambiente di prestampa. PDF SaM &egrave; uno strumento adatto ai professionisti, mentre i principianti saranno probabilmente messi in difficolt&agrave; dalle sue numerose opzioni. Come jPDF Tweak, PDF SaM &egrave; un programma Java, ma, a differenza di tutti gli altri programmi Java citati in quest'elenco, la lingua dell'interfaccia grafica pu&ograve; essere cambiata e vi sono molte traduzioni.</li>
<li><a href="http://www.quantumelephant.co.uk/bookbinder/bookbinder.html">Bookbinder</a> &egrave; un editor PDF per principianti e per operazioni semplici. Il suo scopo principale &egrave; riordinare (e riscalare se necessario) le pagine in un file PDF per la stampa come opuscolo, e operazioni simili. Anche Bookbinder &egrave; scritto in Java.</li><br>
<table width="100%"><tr><td align="center"><img src="images/tb-bookbinder.png" alt="Bookbinder" title="Bookbinder" /></td></tr></table>
<li>Per modificare un file PDF che contiene illustrazioni, potete servirvi di <a href="toolbox4.html">GIMP</a>, <a href="toolbox15.html">Krita</a>, <a href="toolbox9.html">Inkscape</a> o <a href="toolbox18.html">Libre Office Draw</a>, a seconda del contenuto, poich&eacute; tutte queste applicazioni possono importare documenti PDF e permettono di modificare i file.</li>
<table width="100%"><tr><td align="center"><img src="images/tb-pdf-imp.png" alt="PDF import in Inkscape" title="PDF import in Inkscape" /></td></tr><tr><td><div align="center"><i>Importazione PDF in Inkscape</i></div></td></tr></table>
</ul>
</body>
</html>
