<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
	<title>Lavorare con forme e poligoni</title>
</head>

<style>
@import "manual.css";
</style>
<body>
<h2>Lavorare con forme e poligoni</h2>

<p>La pagina <a href="WwFrames.html">Lavorare con le cornici</a> contiene informazioni sulla manipolazione di cornici valide per ogni loro tipo. Per quanto riguarda le forme e i poligoni, in quella pagina abbiamo spiegato soltanto come crearli usando le apposite icone sulla barra degli strumenti, oppure da tastiera premendo <b>S</b> o <b>P</b>.
<p>Quando create forme e poligoni potete scegliere tra molti tipi e possibilit&agrave;; sono tutti disegni vettoriali, e quindi potete ridimensionarli o modificarli liberamente dopo la creazione. Cominciano con le forme.</p>

<h3>Forme</h3>
<table cellpadding=5><tr>
<td valign="top"><p>Lo strumento &ldquo;Forme&rdquo; comprende un insieme di forme predefinite, che nella versione 1.4.x sono molto pi&ugrave; numerose che nelle precedenti. All'avvio di Scribus la forma predefinita &egrave; il rettangolo mostrato nell'icona. Immediatamente alla sua destra c'&egrave; una freccia che apre un men&ugrave; con alcuni sottomen&ugrave;; se selezionate uno dei sottomen&ugrave; e poi una particolare forma (facendo clic con il mouse) l'icona sulla barra degli strumenti assume la forma che avete selezionato. <i>Nota: l'aspetto delle icone delle forme &egrave; stato reso pi&ugrave; nitido nell'immagine qui a destra; in Scribus non hanno un aspetto cos&igrave; distinto.</i></p>
<p>Come spiegato in &ldquo;Lavorare con le cornici&rdquo;, nelle forme e nei poligoni i colori predefiniti per la linea e il riempimento sono rispettivamente <i>nero</i> e <i>nessuno</i>. Potete cambiare queste impostazioni per il documento corrente in <i>File &gt; Impostazioni documento &gt; Strumenti &gt; Propriet&agrave; disegno forme (icona)</i>, e per i documenti futuri in <i>File &gt; Preferenze &gt; Strumenti &gt; Propriet&agrave; disegno forme (icona)</i>.</p>
<p>Come per le altre cornici, potete disegnare una forma facendo clic e trascinando il mouse da un angolo a quello opposto. Se tenete premuto il tasto Maiusc mentre trascinate, quando lasciate andare il mouse la forma riempir&agrave; l'intero spazio fino ai margini della pagina.</p></td>
<td><img src="images/shapes8.png" ALT="Menù per la scelta della forma" ALIGN=right></td>
</tr>
</table>

<table cellpadding=5 width="80%"><tr><td><img src="images/shapes7.png" ALT="Inserisci dimensioni oggetto"></td>
<td><p>Un'altra possibilit&agrave; consiste nel selezionare una forma nel men&ugrave;, e poi fare clic sulla pagina (senza trascinare il mouse): si apre allora una finestra di dialogo, <b>Inserire dimensione oggetto</b>, in cui potete inserire le dimensioni della forma che volete creare.</p>
<p>Questo potrebbe essere utile, ad esempio, per disegnare esattamente un quadrato o un cerchio. L'<b>origine</b> si riferisce al punto sulla pagina in cui avete fatto clic per aprire questa finestra.</p>
</td></tr>
</table>
<br clear=all>
<h3>Poligoni</h3>
<table cellpadding=5>
<tr><td align="center"><img src="images/polygons.png" ALT="Proprietà dei poligoni" ></td></tr>
<tr><td><p>Lo strumento &ldquo;Poligoni&rdquo; crea poligoni regolari, che, se disegnati con uguali altezza e larghezza, avranno lati e angoli uguali. Il poligono predefinito ha 4 lati (e angoli), ma il numero pu&ograve; variare da 3 a 999. L'icona Inserisci Poligono mostra sempre un pentagono, ma selezionando Propriet&agrave; nel men&ugrave; a discesa si apre la finestra di dialogo mostrata qui a destra. Come vedete, le opzioni qui disponibili riguardano soltanto le caratteristiche geometriche del poligono. Potete impostare i valori predefiniti per i colori e le intensit&agrave; di linea e riempimento, e per lo stile e lo spessore della linea, in <i>File &gt; Preferenze &gt; Strumenti &gt; Propriet&agrave; disegno forme (icona)</i> o in <i>File &gt; Impostazioni documento &gt; Strumenti &gt; Propriet&agrave; disegno forme (icona)</i>. Le opzioni in <i>File &gt; Preferenze &gt; Strumenti &gt; Propriet&agrave; disegno poligoni (icona)</i> e in <i>File &gt; Impostazioni documento &gt; Strumenti &gt; Propriet&agrave; disegno poligoni (icona)</i> sono le stesse presenti nella finestra di dialogo <i>Propriet&agrave; poligono</i>.</p>
<p>Numero di <b>Vertici</b> e <b>Rotazione</b> non hanno bisogno di spiegazioni, ma notate che la rotazione pu&ograve; essere impostata sia nella casella di controllo sia con il cursore scorrevole.</p>
<p><b>Applica fattore</b> non &egrave; cos&igrave; intuitivo, ma l'anteprima vi chiarir&agrave; subito che un fattore minore di 0% genera una piegatura dei lati verso l'interno nel loro punto medio, e un fattore maggiore di 0% ha lo stesso effetto, ma verso l'esterno. <b>Curvatura</b> trasforma questa piega angolare in una curva.
</tr></td>
</table>
<p>Il modo migliore di imparare il funzionamento di queste impostazioni &egrave; quello di giocarci e vederne gli effetti. Se disegnate un poligono con larghezza e altezza disuguali, la forma che vedrete sar&agrave; distorta rispetto a quella mostrata nell'anteprima.</p>
<p>Proprio come per le forme, se fate clic sull'icona Inserisci poligono e poi sulla pagina, si apre la finestra di dialogo <b>Inserire dimensione oggetto</b>.</p>

<h3>Men&ugrave; contestuale</h3>
<table cellpadding=5><tr><td valign="top"><img src="images/context_shape.png" ALT="Menù contestuale forme" ALIGN=right></td>
<td><p>Il men&ugrave; contestuale per le forme e i poligoni comprende un numero minore di opzioni rispetto a quelli per le cornici di testo o immagine.</p>
<ul>
<li><b>Annulla</b>: &egrave; attiva soltanto quando c'&egrave; qualche operazione sulla cornice che pu&ograve; essere annullata.</li>
<li><b>Ripristina</b>: &egrave; presente soltanto quando qualche azione &egrave; stata annullata.</li>
<li><b>Attributi</b>: &egrave; un'opzione avanzata che non sar&agrave; descritta qui.</li>
<li><b>Bloccato</b>: se contrassegnata, blocca tutte la caratteristiche dell'oggetto.</li>
<li><b>Dimensione bloccata</b>: blocca soltanto le dimensioni dell'oggetto.</li>
<li><b>Invia alla biblioteca</b> e <b>Invia ai motivi</b>: permettono di riutilizzare facilmente l'oggetto in questo o in altri documenti.</li>
<li><b>Invia al livello</b>: &egrave; presente quando il documento ha pi&ugrave; di un livello.</li>
<li><b>Quota</b>: sposta l'oggetto a una quota superiore o inferiore rispetto agli altri sullo stesso livello.</li>
<li><b>Converti in</b>: permette di convertire l'oggetto in:</li>
<ul><li>curva di B&eacute;zier. Questo &egrave; necessario se volete <b>Unire un testo a tracciato</b> usando una forma o un poligono.</li>
<li>cornice immagine. Potrebbe essere necessario modificare i colori di linea e riempimento. Se l'immagine riempie completamente la cornice, il colore di riempimento non sar&agrave; visibile, a meno che non vi sia trasparenza.</li>
<li>cornice di testo. Potrebbe essere necessario modificare i colori di linea e riempimento.</li>
</ul>
<li><b>Taglia</b>, <b>Copia</b>, ed <b>Elimina</b> sono descritti in Lavorare con le cornici.</li>
<li><b>Propriet&agrave;</b>: apre o chiude il pannello Propriet&agrave;.</li>
</ul>
</td></tr>
</table>
<h4>Modificare le forme</h4>
<p>La modifica di forme &egrave; descritta in un'<a href="EditingShapes.html">apposita pagina</a>, perch&eacute; si applica non solo a figure geometriche, ma anche a oggetti di molti altri tipi.</p>
</html>
